
&ИзменениеИКонтроль("ПеренестиЗаписиОсновныхДанныхДоговоровКонтрактовСотрудников")
Процедура СЭ_ПеренестиЗаписиОсновныхДанныхДоговоровКонтрактовСотрудников()
	Запрос = Новый Запрос;

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СведенияКонтрактаДоговораСотрудника.УдалитьНомерДоговораКонтракта КАК НомерДоговораКонтракта,
	|	СведенияКонтрактаДоговораСотрудника.УдалитьДатаДоговораКонтракта КАК ДатаДоговораКонтракта,
	|	СведенияКонтрактаДоговораСотрудника.УдалитьПоступлениеНаСлужбуВпервые КАК ПоступлениеНаСлужбуВпервые,
	|	СведенияКонтрактаДоговораСотрудника.УдалитьСпособПоступленияНаСлужбу КАК СпособПоступленияНаСлужбу,
	|	СведенияКонтрактаДоговораСотрудника.Период,
	|	СведенияКонтрактаДоговораСотрудника.Регистратор КАК Регистратор,
	|	СведенияКонтрактаДоговораСотрудника.НомерСтроки,
	|	СведенияКонтрактаДоговораСотрудника.Сотрудник,
	|	СведенияКонтрактаДоговораСотрудника.ФизическоеЛицо,
	|	СведенияКонтрактаДоговораСотрудника.Организация 
	#Вставка
	//СЭ Ульяна 0016035
	|	,
	|	СведенияКонтрактаДоговораСотрудника.СЭ_ДатаДопСоглашения,
	|	СведенияКонтрактаДоговораСотрудника.СЭ_НомерДопСоглашения,
	|	СведенияКонтрактаДоговораСотрудника.СЭ_ТипДополнительногоСоглашения
	//СЭ Ульяна 0016035
	#КонецВставки
	|ИЗ
	|	РегистрСведений.СведенияКонтрактаДоговораСотрудника КАК СведенияКонтрактаДоговораСотрудника
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор";

	Результат = Запрос.Выполнить();	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.СледующийПоЗначениюПоля("Регистратор") Цикл
			НаборЗаписей = РегистрыСведений.ОсновныеДанныеКонтрактаДоговораСотрудника.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор["Регистратор"].Установить(Выборка.Регистратор);
			НаборЗаписей.Прочитать();

			Если НаборЗаписей.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;

			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
			КонецЦикла;

			ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);

		КонецЦикла;	
	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("ДобавитьДвижениеОсновныхДанныхКонтрактаДоговораСотрудника")
Процедура СЭ_ДобавитьДвижениеОсновныхДанныхКонтрактаДоговораСотрудника(Движения, ДанныеДоговора)

	НоваяСтрока = Движения.ОсновныеДанныеКонтрактаДоговораСотрудника.Добавить();

	НоваяСтрока.Период 			= ДанныеДоговора.Период;
	НоваяСтрока.Сотрудник 		= ДанныеДоговора.Сотрудник;
	НоваяСтрока.ФизическоеЛицо 	= ДанныеДоговора.ФизическоеЛицо;
	//Разница ЗУП
	//НоваяСтрока.Организация 	= ДанныеДоговора.Организация;
	НоваяСтрока.ГоловнаяОрганизация 	= ДанныеДоговора.Организация;

	НоваяСтрока.ДатаДоговораКонтракта 		= ДанныеДоговора.ДатаДоговораКонтракта; 
	НоваяСтрока.НомерДоговораКонтракта 		= ДанныеДоговора.НомерДоговораКонтракта;
	НоваяСтрока.ДатаНачала 					= ДанныеДоговора.ДатаНачала;
	НоваяСтрока.ДатаОкончания               = ДанныеДоговора.ДатаОкончания;
	НоваяСтрока.ВидТрудовогоДоговора 		= ДанныеДоговора.ВидТрудовогоДоговора;	
	НоваяСтрока.ПоступлениеНаСлужбуВпервые 	= ДанныеДоговора.ПоступлениеНаСлужбуВпервые;
	
	#Вставка
	//СЭ Ульяна 0016035
	Попытка
		НоваяСтрока.СЭ_ДатаДопСоглашения 				= ДанныеДоговора.СЭ_ДатаДопСоглашения;
		НоваяСтрока.СЭ_НомерДопСоглашения 				= ДанныеДоговора.СЭ_НомерДопСоглашения;
		НоваяСтрока.СЭ_ТипДополнительногоСоглашения 	= ДанныеДоговора.СЭ_ТипДополнительногоСоглашения;
	Исключение
	КонецПопытки;
	//СЭ Ульяна 0016035
	#КонецВставки

КонецПроцедуры

&ИзменениеИКонтроль("ДобавитьДвижениеСведенийКонтрактаДоговораСотрудника")
Процедура СЭ_ДобавитьДвижениеСведенийКонтрактаДоговораСотрудника(Движения, ДанныеДоговора)

	НоваяСтрока = Движения.СведенияКонтрактаДоговораСотрудника.Добавить();

	НоваяСтрока.Период 			= ДанныеДоговора.Период;
	НоваяСтрока.Сотрудник 		= ДанныеДоговора.Сотрудник;
	НоваяСтрока.ФизическоеЛицо 	= ДанныеДоговора.ФизическоеЛицо;
	//Разница ЗУП
	НоваяСтрока.Организация 	= ДанныеДоговора.Организация;
	НоваяСтрока.ГоловнаяОрганизация 	= ДанныеДоговора.Организация;

	НоваяСтрока.ПредставительНанимателя 			= ДанныеДоговора.ПредставительНанимателя;
	НоваяСтрока.ДолжностьПредставителяНанимателя 	= ДанныеДоговора.ДолжностьПредставителяНанимателя;
	НоваяСтрока.ОснованиеПредставителяНанимателя 	= ДанныеДоговора.ОснованиеПредставителяНанимателя;
	НоваяСтрока.ОборудованиеРабочегоМеста 			= ДанныеДоговора.ОборудованиеРабочегоМеста;
	НоваяСтрока.ИныеУсловияДоговора 				= ДанныеДоговора.ИныеУсловияДоговора;
	НоваяСтрока.ВидАктаГосоргана 					= ДанныеДоговора.ВидАктаГосоргана;
	
	#Вставка
	//СЭ Ульяна 0016035
	Попытка
	    НоваяСтрока.СЭ_ДатаДопСоглашения 				= ДанныеДоговора.СЭ_ДатаДопСоглашения;
		НоваяСтрока.СЭ_НомерДопСоглашения 				= ДанныеДоговора.СЭ_НомерДопСоглашения;
		НоваяСтрока.СЭ_ТипДополнительногоСоглашения 	= ДанныеДоговора.СЭ_ТипДополнительногоСоглашения;
	Исключение
	КонецПопытки;
	//СЭ Ульяна 0016035
	#КонецВставки

	Если ДанныеДоговора.СрочныйДоговор Тогда
		НоваяСтрока.СрочныйДоговор 					= ДанныеДоговора.СрочныйДоговор;
		НоваяСтрока.ДатаОкончания 					= ДанныеДоговора.ДатаОкончания;
		НоваяСтрока.СрокЗаключенияДоговора 			= ДанныеДоговора.СрокЗаключенияДоговора;
		НоваяСтрока.ВидТрудовогоДоговора 			= ДанныеДоговора.ВидТрудовогоДоговора;
		НоваяСтрока.ОснованиеСрочногоДоговора 		= ДанныеДоговора.ОснованиеСрочногоДоговора;
	КонецЕсли;

КонецПроцедуры
