 
 //СЭ+ Ульяна 0016726
 
#Область Программный_интерфейс

&НаСервере
Процедура СЭ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	КомандаВыгрузкаЛС = ЭтаФорма.Команды.Добавить("СоздатьВыгрузкаЛС");
	КомандаВыгрузкаЛС.Действие = "СЭ_СоздатьВыгрузкаЛС";
	
	КнопкаВыгрузкаЛС = ЭтаФорма.Элементы.Добавить("СоздатьВыгрузкаЛС", Тип("КнопкаФормы"), ЭтаФорма.Элементы.ШапкаСлужебное); 
	КнопкаВыгрузкаЛС.ИмяКоманды = "СоздатьВыгрузкаЛС";     
	
	СЭ_УстановитьВидимостьКоманд();
	
КонецПроцедуры

&НаСервере
Процедура СЭ_УстановитьВидимостьКоманд()
	
	ЗаголовокКомандыВыгрузки = СЭ_ЗаголовокВыгрузкиЛС(СЭ_ПолучитьБИКБанка());
	
	ЭтаФорма.Команды.СоздатьВыгрузкаЛС.Заголовок = ЗаголовокКомандыВыгрузки;
	ЭтаФорма.Элементы.СоздатьВыгрузкаЛС.Видимость = ?(ПустаяСтрока(ЗаголовокКомандыВыгрузки), ложь, истина);
	
КонецПроцедуры

&НаСервере
Функция СЭ_ПолучитьБИКБанка()
	
	БИКБанка = Неопределено;
	
	БанкЗарплатногоПроекта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ЗарплатныйПроект, "Банк");
	Если НЕ БанкЗарплатногоПроекта = Неопределено и ЗначениеЗаполнено(БанкЗарплатногоПроекта) тогда
		БИКБанка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БанкЗарплатногоПроекта, "Код");
		Если НЕ БИКБанка = Неопределено И НЕ ПустаяСтрока(БИКБанка) тогда
			БИКБанка = СокрЛП(БИКБанка);
		КонецЕсли;
	КонецЕсли;
	
	Возврат БИКБанка;
	
КонецФункции  

&НаСервереБезКонтекста
Функция СЭ_ЗаголовокВыгрузкиЛС(БИКБанка)
	
	ВозвращаемыйЗаголовок = "";

	Если БИКБанка = "ALFABY2X" тогда
		ВозвращаемыйЗаголовок = "ЗАО «Альфа-Банк»";
	КонецЕсли;
	
	Возврат ВозвращаемыйЗаголовок;
	
КонецФункции

&НаКлиенте
Процедура СЭ_ЗарплатныйПроектПриИзмененииПосле(Элемент)
	
	СЭ_УстановитьВидимостьКоманд();

КонецПроцедуры

#КонецОбласти


#Область МодульВыгрузкиСпискаЛицевыхСчетов

&НаКлиенте
Асинх Процедура СЭ_СоздатьВыгрузкаЛС(Команда)
	
	СтруктураДанныеФормата = новый Структура();
	СЭ_ЗаполнитьДанныеПоФормату(СтруктураДанныеФормата, СЭ_ПолучитьБИКБанка());
	
	Если СтруктураДанныеФормата.Свойство("РасширениеФайла") тогда
		
		ПутьСохранения = "";
		Диалог = новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		Диалог.Заголовок = "Выберите каталог";
		
		РезультатВыбора = Ждать Диалог.ВыбратьАсинх();
		
		Если НЕ РезультатВыбора = Неопределено и РезультатВыбора.Количество() > 0 тогда
			
			КаталогДляСохранения = РезультатВыбора[0];
			СтруктураДанныеФормата.Вставить("ПутьСохранения", 
				СтрШаблон("%1\Выгрузка (%2) %3.%4", 
					КаталогДляСохранения, 
					СЭ_ЗаголовокВыгрузкиЛС(СЭ_ПолучитьБИКБанка()), 
					Объект.Ссылка, 
					СтруктураДанныеФормата.РасширениеФайла)
			);
			
		Иначе
			
			СЭ_ОповеститьПользователяОбОшибках("Путь сохранения файла выгрузки не был выбран!");
			Возврат;
			
		КонецЕсли;
		
		ФайлВыгрузки = СЭ_СоздатьВыгрузкаЛСНаСервере(СтруктураДанныеФормата);
		Если НЕ ФайлВыгрузки = Неопределено тогда
			СЭ_ФайлВыгрузкиСохранение(ФайлВыгрузки, СтруктураДанныеФормата);
		Иначе
			СЭ_ОповеститьПользователяОбОшибках("Файл не был сформирован.");
		КонецЕсли;
		
	Иначе
		СЭ_ОповеститьПользователяОбОшибках(
			"Для выбранного формата файла отсутствует значение расширения!
			|Выгрузка невозможна.
			|Обратитесь к техническому специалисту!"
		);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СЭ_ЗаполнитьДанныеПоФормату(СтруктураДанные, БИКБанка)
	
    Если БИКБанка = "ALFABY2X" тогда
		СтруктураДанные.Вставить("ФорматБанк", 		"Альфабанк");
		СтруктураДанные.Вставить("ТипФайла", 		Тип("ТекстовыйДокумент"));
		СтруктураДанные.Вставить("РасширениеФайла", "txt");
		СтруктураДанные.Вставить("Кодировка", 		КодировкаТекста.ANSI);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СЭ_СоздатьВыгрузкаЛСНаСервере(ВспомогательныеДанные)
	
	ФайлВыгрузки = неопределено;
	
	СтруктураДанныхПараметров = СЭ_СформироватьЗаполнитьСтруктураПараметров();
	
	Если СтруктураДанныхПараметров.Свойство("Ошибки") тогда
		СЭ_ОповеститьПользователяОбОшибках(СтруктураДанныхПараметров.Ошибки);
		Возврат неопределено;
	КонецЕсли;
	
    Если ВспомогательныеДанные.ФорматБанк = "Альфабанк" тогда
		ФайлВыгрузки = СЭ_ВыгрузкаФорматАльфабанк(СтруктураДанныхПараметров);
	КонецЕсли;
	
	Возврат ФайлВыгрузки;
	
КонецФункции

&НаКлиенте
Процедура СЭ_ФайлВыгрузкиСохранение(ФайлВыгрузки, ДополнительныеДанные)
	
	Если ДополнительныеДанные.ТипФайла = Тип("ТекстовыйДокумент") тогда
		
		ФайлВыгрузки.НачатьЗапись(
			новый ОписаниеОповещения(
				"СЭ_ФайлВыгрузкиПослеЗаписи", 
				ЭтаФорма, 
				ДополнительныеДанные
			),
			ДополнительныеДанные.ПутьСохранения,
			ДополнительныеДанные.Кодировка
		);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СЭ_ФайлВыгрузкиПослеЗаписи(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = истина тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			СтрШаблон(
				"Файл сохранен по пути: %1", 
				ДополнительныеПараметры.ПутьСохранения));
	Иначе
		СЭ_ОповеститьПользователяОбОшибках("Файл не сохранен! Обратитесь к техническому специалисту.");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СЭ_ОповеститьПользователяОбОшибках(ВозникшиеОшибки)
	
	ТекстСообщения = "";
	Если ТипЗнч(ВозникшиеОшибки) = Тип("Массив") тогда
		
		ТекстСообщения = "При формировании файла возникли следующие ошибки:";
		НомерОшибки = 1;
		Для каждого Ошибка из ВозникшиеОшибки цикл
			ТекстСообщения = ТекстСообщения
				+ Символы.ВК + Символы.ПС
				+ СтрШаблон("%1. Параметр: %2. Описание: %3", НомерОшибки, Ошибка.Параметр, Ошибка.ОписаниеОшибки);
		КонецЦикла;
			
	ИначеЕсли ТипЗнч(ВозникшиеОшибки) = Тип("Строка") тогда
		
		ТекстСообщения = ВозникшиеОшибки;
		
	КонецЕсли;
	
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СЭ_ДобавитьСтроку(ФорматТег, ФорматЗначение, ТекстДокумент, СимволОбертки = "")
	
	СтрокаВставки = СтрШаблон("%1%2%3%1",СимволОбертки, ФорматТег, ФорматЗначение);
	ТекстДокумент.ДобавитьСтроку(СтрокаВставки);
	
КонецПроцедуры

&НаСервере
Функция СЭ_ВыгрузкаФорматАльфабанк(ДанныеПараметров)

	Отказ = ложь;
	МассивОшибок = новый Массив();
	
	СЭ_ПроверитьПараметрыАльфабанк(ДанныеПараметров, МассивОшибок, Отказ);
	
	Если МассивОшибок.Количество() <> 0 тогда
		СЭ_ОповеститьПользователяОбОшибках(МассивОшибок);
	КонецЕсли;
	
	Если Отказ = истина тогда
		Возврат неопределено;
	КонецЕсли;
	
	ТекстовыйДокументФорматАльфабанк = новый ТекстовыйДокумент;
	ТекстовыйДокументФорматАльфабанк.УстановитьТипФайла(КодировкаТекста.UTF8);
	
	ЗаголовокФайла = "***** ^Type=46^ ^Acc=0000000000000^ - Список на выдачу заработной платы";
	СЭ_ДобавитьСтроку("", 				ЗаголовокФайла, 											ТекстовыйДокументФорматАльфабанк);
	СЭ_ДобавитьСтроку("[IN_PARAM]", 	"", 														ТекстовыйДокументФорматАльфабанк);
	СЭ_ДобавитьСтроку("Date=", 			ДанныеПараметров.ДатаСоставленияСписка, 					ТекстовыйДокументФорматАльфабанк, "^");
	СЭ_ДобавитьСтроку("N_sp=", 			"1", 														ТекстовыйДокументФорматАльфабанк, "^");
	СЭ_ДобавитьСтроку("DateDog=", 		ДанныеПараметров.ДатаЗаключенногоДоговора, 					ТекстовыйДокументФорматАльфабанк, "^");
	СЭ_ДобавитьСтроку("NumDog=", 		ДанныеПараметров.НомерЗаключенногоДоговора, 				ТекстовыйДокументФорматАльфабанк, "^");
	// Номер платежного поручения устанавливаем всегда в "1", поскольку это обязательное поле,
	// однако в ЗУП его указать невозможно - клиент-банк присваивает ему СВОЙ номер, который
	// отличается (угадать его невозможно).
	СЭ_ДобавитьСтроку("N_poruch=", 		"1", 														ТекстовыйДокументФорматАльфабанк, "^");
	СЭ_ДобавитьСтроку("DatePP=", 		ДанныеПараметров.ДатаПлатежногоПоручения, 					ТекстовыйДокументФорматАльфабанк, "^");
	СЭ_ДобавитьСтроку("Period=", 		ДанныеПараметров.ПериодВыгрузки, 							ТекстовыйДокументФорматАльфабанк, "^");

	СЭ_ДобавитьСтроку("AccDebet=", 		ДанныеПараметров.НомерРасчетногоСчета, 						ТекстовыйДокументФорматАльфабанк, "^");
	СЭ_ДобавитьСтроку("Val=", 			ДанныеПараметров.КодВалютыСписка, 							ТекстовыйДокументФорматАльфабанк, "^");
	СЭ_ДобавитьСтроку("Vid_dohoda_code=", "9", 														ТекстовыйДокументФорматАльфабанк, "^");
	СЭ_ДобавитьСтроку("AmountComm=", 	ДанныеПараметров.ОбщаяСуммаСписка, 							ТекстовыйДокументФорматАльфабанк, "^");
	СЭ_ДобавитьСтроку("_Table=", 		СЭ_СформироватьСписокДляЗачисленияАльфабанк(), 				ТекстовыйДокументФорматАльфабанк, "^");
	
	СЭ_ДобавитьСтроку("[OUT_PARAM]", 	"", 														ТекстовыйДокументФорматАльфабанк);
	СЭ_ДобавитьСтроку("################################################### ", "", 					ТекстовыйДокументФорматАльфабанк);
	
	Возврат ТекстовыйДокументФорматАльфабанк;

КонецФункции

&НаСервере
Процедура СЭ_ПроверитьПараметрыАльфабанк(ДанныеПараметров, МассивОшибок, Отказ)
	
	// нет списка для проверки
	Заглушка = истина;
	
КонецПроцедуры

&НаСервере
Функция СЭ_СформироватьСписокДляЗачисленияАльфабанк()
	
	Список = "";
	
	НомерВСписке = 1;
	Для каждого СтрокаСостава из Объект.Состав цикл	
		Если НомерВСписке = 1 тогда
			Список = Список + СтрШаблон(
			"Npp1=%1~Name1=%2~Nch1=%3~Sum1=%4",
			НомерВСписке,
			СтрокаСостава.ФизическоеЛицо,
			СтрокаСостава.НомерЛицевогоСчета,
			Формат(СтрокаСостава.КВыплате, "ЧДЦ=2; ЧРД=.; ЧГ=")
			);
		Иначе
			Список = Список + СтрШаблон(
			"~Npp1=%1~Name1=%2~Nch1=%3~Sum1=%4", 
			НомерВСписке,
			СтрокаСостава.ФизическоеЛицо,
			СтрокаСостава.НомерЛицевогоСчета,
			Формат(СтрокаСостава.КВыплате, "ЧДЦ=2; ЧРД=.; ЧГ=")
			);
		КонецЕсли;
		НомерВСписке = НомерВСписке + 1;
	КонецЦикла;
	Список = Список + "~";
	
	Возврат Список;
	
КонецФункции

#Область Формирование_параметров_для_документов

&НаСервере
Функция СЭ_СформироватьЗаполнитьСтруктураПараметров()
	
	СтруктураПараметров = новый Структура();
	ОшибкиПриФормированииПараметров = новый Массив();
	
	ДатаСоставленияСписка 		= Формат(Объект.Дата, "ДФ=""дд.ММ.гггг""");
	ДатаПлатежногоПоручения 	= Формат(Объект.Дата, "ДФ=""дд.ММ.гггг""");
	ПериодВыгрузки 				= НРег(Формат(Объект.Дата, "ДФ='ММММ гггг""г""'"));
	ПорядковыйНомерСписка 		= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Объект.Номер, истина, истина);
	КоличествоСтрокСписка 		= Объект.Состав.Количество();
	НазначениеПеречисления 		= СтрШаблон("%1 (%2)", 
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СпособВыплаты, "Наименование"), 
		ПериодРегистрацииСтрокой);
	ФИООтветственныйИсполнитель = СЭ_ПолучитьФИООтветственногоИсполнителя();
	
	НомерПлатежногоПоручения 	= "";
	ДатаЗаключенногоДоговора	= "";
	НомерЗаключенногоДоговора 	= "";
	НомерРасчетногоСчета 		= "";
	ВалютаЗарплатногоПроекта 	= Справочники.Валюты.ПустаяСсылка();
	ВалютаСписка 				= "";
	КодВалютыСписка 			= "";
	НомерОтделения 				= "";
	НомерФилиала 				= "";
	НомерЦентраБанковскихУслуг 	= "";
	КодСпискаВидЗачисления 		= "";
	ТранзитныйСчетВБанке 		= "";
	ИННОрганизации 				= "";
	НаименованиеОрганизацииСокр = "";
	
	ОбщаяСуммаСписка 			= Объект.Зарплата.Итог("КВыплате");
	Если ОбщаяСуммаСписка = 0 тогда
		ОшибкиПриФормированииПараметров.Добавить(
			новый Структура("Параметр, ОписаниеОшибки",
			"сумма",
			"общая сумма списка не может быть равна 0!"));
	КонецЕсли;
	ОбщаяСуммаСпискаСтрокой 	= Формат(ОбщаяСуммаСписка, "ЧДЦ=2; ЧРД=.; ЧГ=");
	
	ЮридическийАдресОрганизации = ВРег(УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
		Объект.Организация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации, Объект.Дата, истина)
	);

	Если ПустаяСтрока(ЮридическийАдресОрганизации) тогда
		ОбщегоНазначения.СообщитьПользователю("Юридический адрес организации не найден.");	
		//ЮридическийАдресОрганизации = "223710,МИНСКАЯ ОБЛАСТЬ,ГОРОД,СОЛИГОРСК,КОЗЛОВА УЛИЦА,69,";	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Организация) тогда
		СтруктураРеквизитыОрганизация 	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Организация, "ИНН, НаименованиеСокращенное");
		ИННОрганизации 					= СокрЛП(СтруктураРеквизитыОрганизация.ИНН);
		НаименованиеОрганизацииСокр 	= ВРег(СокрЛП(СтруктураРеквизитыОрганизация.НаименованиеСокращенное));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ЗарплатныйПроект) тогда
		СтруктураРеквизитыЗП = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ЗарплатныйПроект,
			"РасчетныйСчет, Валюта, ОтделениеБанка, ФилиалОтделенияБанка, ДатаДоговора, НомерДоговора");
		НомерРасчетногоСчета 		= СокрЛП(СтруктураРеквизитыЗП.РасчетныйСчет);
		ВалютаЗарплатногоПроекта 	= СтруктураРеквизитыЗП.Валюта;
		НомерОтделения 				= СокрЛП(СтруктураРеквизитыЗП.ОтделениеБанка);	
		НомерФилиала 				= СокрЛП(СтруктураРеквизитыЗП.ФилиалОтделенияБанка);
		ДатаЗаключенногоДоговора 	= Формат(СтруктураРеквизитыЗП.ДатаДоговора, "ДФ=""дд.ММ.гггг""");
		НомерЗаключенногоДоговора 	= СокрЛП(СтруктураРеквизитыЗП.НомерДоговора);
		
		Если ЗначениеЗаполнено(ВалютаЗарплатногоПроекта) тогда
			СтруктураРеквизитыВалюта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВалютаЗарплатногоПроекта, "Наименование, Код");
			ВалютаСписка = ?(НЕ СтруктураРеквизитыВалюта.Наименование = Неопределено, ВРег(СтруктураРеквизитыВалюта.Наименование), "");
			КодВалютыСписка = ?(НЕ СтруктураРеквизитыВалюта.Код = Неопределено, СокрЛП(СтруктураРеквизитыВалюта.Код), "");
		КонецЕсли;
	КонецЕсли;
	
	//ОбщаяСуммаСпискаПрописью = ВРег(РаботаСКурсамиВалют.СформироватьСуммуПрописью(ОбщаяСуммаСписка, ВалютаЗарплатногоПроекта));
	ОбщаяСуммаСпискаПрописью = СЭ_ЧислоПрописью(ОбщаяСуммаСписка, КодВалютыСписка);
	
	СтруктураПараметров.Вставить("ПорядковыйНомерСписка", 		ПорядковыйНомерСписка);	
	СтруктураПараметров.Вставить("ДатаСоставленияСписка", 		ДатаСоставленияСписка);
	СтруктураПараметров.Вставить("ПериодВыгрузки", 				ПериодВыгрузки);
	СтруктураПараметров.Вставить("НомерФилиала", 				НомерФилиала);	
	СтруктураПараметров.Вставить("НомерЦентраБанковскихУслуг", 	НомерЦентраБанковскихУслуг);	
	СтруктураПараметров.Вставить("НомерОтделения", 				НомерОтделения);	
	СтруктураПараметров.Вставить("НомерРасчетногоСчета", 		НомерРасчетногоСчета);	
	СтруктураПараметров.Вставить("ВалютаСписка", 				ВалютаСписка);
	СтруктураПараметров.Вставить("КодВалютыСписка", 			КодВалютыСписка);
	СтруктураПараметров.Вставить("ФИООтветственныйИсполнитель", ФИООтветственныйИсполнитель);	
	СтруктураПараметров.Вставить("КоличествоСтрокСписка", 		КоличествоСтрокСписка);		
	СтруктураПараметров.Вставить("ОбщаяСуммаСписка", 			ОбщаяСуммаСпискаСтрокой);
	СтруктураПараметров.Вставить("ОбщаяСуммаСпискаПрописью", 	ОбщаяСуммаСпискаПрописью);
	СтруктураПараметров.Вставить("НазначениеПеречисления", 		НазначениеПеречисления);	
	СтруктураПараметров.Вставить("НомерПлатежногоПоручения", 	НомерПлатежногоПоручения);	
	СтруктураПараметров.Вставить("ДатаПлатежногоПоручения", 	ДатаПлатежногоПоручения);
	СтруктураПараметров.Вставить("ДатаЗаключенногоДоговора", 	ДатаЗаключенногоДоговора);
	СтруктураПараметров.Вставить("НомерЗаключенногоДоговора", 	НомерЗаключенногоДоговора);	
	СтруктураПараметров.Вставить("КодСпискаВидЗачисления",		КодСпискаВидЗачисления);
	СтруктураПараметров.Вставить("ТранзитныйСчетВБанке",		ТранзитныйСчетВБанке);
	СтруктураПараметров.Вставить("ИННОрганизации", 				ИННОрганизации);
	СтруктураПараметров.Вставить("НаименованиеОрганизацииСокр",	НаименованиеОрганизацииСокр);
	СтруктураПараметров.Вставить("ЮридическийАдресОрганизации", ЮридическийАдресОрганизации);
	
	Если ОшибкиПриФормированииПараметров.Количество() > 0 тогда
		СтруктураПараметров.Вставить("Ошибки", ОшибкиПриФормированииПараметров);
	КонецЕсли;
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаСервереБезКонтекста
Функция СЭ_ЧислоПрописью(ЗначениеЧисла, КодВалюты)
	
	ПрописьЧисла = "";
	
	Если КодВалюты = "933" тогда
		ФормСтрока = "Л=ru_RU";
		ПарПредмета = "белорусский рубль_, белорусских рубля_, белорусских рублей_, м, коп, коп, коп, ж";
		ПрописьЧисла = ЧислоПрописью(ЗначениеЧисла, ФормСтрока, ПарПредмета);
	Иначе
		ПрописьЧисла = ЧислоПрописью(ЗначениеЧисла);
	КонецЕсли;
	
	Возврат ВРег(СтрЗаменить(ПрописьЧисла, "_", ","));
	
КонецФункции

&НаСервере
Функция СЭ_ПолучитьФИООтветственногоИсполнителя()
	
	ФИООтветственныйИсполнитель = "";
	
	ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ответственный, "ФизическоеЛицо");
	Если НЕ ФизическоеЛицо = Неопределено и ЗначениеЗаполнено(ФизическоеЛицо) тогда
		ФИООтветственныйИсполнитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ФизическоеЛицо, "ФИО");
	Иначе
		ФИООтветственныйИсполнитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ответственный, "Наименование");
	КонецЕсли;
	
	Возврат ФИООтветственныйИсполнитель;
	
КонецФункции

#КонецОбласти

#КонецОбласти


//СЭ- Ульяна 0016726
