
&НаСервереБезКонтекста
&ИзменениеИКонтроль("ДобавитьЭлементФормыЕдиницаИзмерения")
Процедура СЭ_ДобавитьЭлементФормыЕдиницаИзмерения(Форма)

	Перем Элемент;

	// +CRM добавил элемент на форму вручную
	//Элемент     = Форма.Элементы.Добавить("ТоварыНоменклатураЕдиницаИзмерения", Тип("ПолеФормы"), Форма.Элементы.ТоварыУпаковкаЕдиницаИзмерения);
	//Элемент.Вид                       = ВидПоляФормы.ПолеВвода;
	//Элемент.КнопкаОткрытия            = Ложь;
	//Элемент.ТолькоПросмотр            = Истина;
	//Элемент.ОтображатьВШапке          = Ложь;
	//Элемент.Ширина                    = 8;
	//
	//Элемент.ПутьКДанным               = "Объект.Товары.Номенклатура.ЕдиницаИзмерения";
	//Элемент.АвтоОтметкаНезаполненного = Ложь;
	// -CRM	

	#Удаление
	НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(Форма, , "Объект.Товары.ЕдиницаИзмерения");
	#КонецУдаления
	
	#Вставка
	//СЭ+ Евгений исправляем ошибки ЦРМ в версии ЕРП 22
	ДополнительныеПараметры = НоменклатураСервер.НовыеПараметрыУсловногоОформленияЕдиницИзмерения();
	ДополнительныеПараметры.ПутьКПолюУпаковка = "Объект.Товары.ЕдиницаИзмерения";
	НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(Форма, ДополнительныеПараметры);
	//СЭ- Евгений
	#КонецВставки
	
КонецПроцедуры
