	  
&После("ПриСозданииНаСервере")
&НаСервере
Процедура СЭ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//СЭ+ Евгений [16792] Скрываем в зависимости от наличия ролей
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		
		СЭ_ВидетьТолькоСтрахование = РольДоступна("СЭ_Сотрудник_ВидимостьТолькоСтрахованияВыплатПодоходного");
		СЭ_СкрытьТолькоСтрахование = РольДоступна("СЭ_Сотрудник_СкрытьСтрахованияВыплатПодоходного");
			
		СЭ_СкрытьЭлементыШапкиПоРолям(СЭ_ВидетьТолькоСтрахование, СЭ_СкрытьТолькоСтрахование);
			
	КонецЕсли;
	//СЭ- Евгений [16792]
	
КонецПроцедуры

//СЭ+ Евгений [16792] Скрываем в зависимости от наличия ролей
&НаСервере
Процедура СЭ_СкрытьЭлементыШапкиПоРолям(СЭ_ВидетьТолькоСтрахование, СЭ_СкрытьТолькоСтрахование)

	Если СЭ_ВидетьТолькоСтрахование Тогда
		
		Для каждого ЭлементГруппы Из Элементы.ГруппаДополнительныеДанные1.ПодчиненныеЭлементы Цикл
			Если ЭлементГруппы <> Элементы.Страхование 
				И ЭлементГруппы <> Элементы.НалогНаДоходы Тогда
				ЭлементГруппы.Видимость = Ложь;
			КонецЕсли;	
		КонецЦикла;
		
		Для каждого ЭлементГруппы Из Элементы.ГруппаДополнительныеДанные2.ПодчиненныеЭлементы Цикл
			Если ЭлементГруппы <> Элементы.ВыплатаЗарплаты Тогда
				ЭлементГруппы.Видимость = Ложь;
			КонецЕсли;	
		КонецЦикла;
		
	КонецЕсли;
	
	Если СЭ_СкрытьТолькоСтрахование Тогда
		
		Для каждого ЭлементГруппы Из Элементы.ГруппаДополнительныеДанные1.ПодчиненныеЭлементы Цикл
			Если ЭлементГруппы = Элементы.Страхование 
				ИЛИ ЭлементГруппы = Элементы.НалогНаДоходы Тогда
				ЭлементГруппы.Видимость = Ложь;
			КонецЕсли;	
		КонецЦикла;
		
		Для каждого ЭлементГруппы Из Элементы.ГруппаДополнительныеДанные2.ПодчиненныеЭлементы Цикл
			Если ЭлементГруппы = Элементы.ВыплатаЗарплаты Тогда
				ЭлементГруппы.Видимость = Ложь;
			КонецЕсли;	
		КонецЦикла;   
		
	КонецЕсли;
	
КонецПроцедуры
//СЭ- Евгений [16792]