
&НаСервере
&После("ПриСозданииНаСервере")
Процедура СЭ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СЭ_СоздатьЭлементыФормы();
	СЭ_ОбновитьДанныеТаблицНаСервере();
	
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		
		РаботаСЗУН = РольДоступна("СЭ_РаботаСПланомПовышенияКвалификацииВШтатномРасписании");
		
		//Изменилась логика, теперь если роль есть то видна тока наша вкладка, если роли нет то видны вообще все
		Если РаботаСЗУН Тогда
			
			Элементы.ОплатаТрудаСтраница.Видимость 		= НЕ РаботаСЗУН;
			Элементы.ДополнительноСтраница.Видимость 	= НЕ РаботаСЗУН;
			Элементы.СпециальностиСтраница.Видимость 	= НЕ РаботаСЗУН;
			Элементы.ЛьготыСтраница.Видимость 			= НЕ РаботаСЗУН;
			Элементы.КадровыйРезервСтраница.Видимость 	= НЕ РаботаСЗУН;
			
			Элементы.СЭ_СтраницаСвязанныеЗУН.Видимость 	= РаботаСЗУН;
			Элементы.СЭ_СтраницаПланРазвития.Видимость 	= РаботаСЗУН;
			
		Иначе
			//Видит все вкладки	
		КонецЕсли;
		
		//СЭ+ Евгений [16766] не показываем не нужную инфу
		СЭ_СкрытьКадровуюИнформациюЗУН = РольДоступна("СЭ_СкрытьКадровуюИнформациюЗУН");
		
		Элементы.УтвердившийРегистраторНадпись.Видимость 	= НЕ СЭ_СкрытьКадровуюИнформациюЗУН;	
		Элементы.ЗакрывшийРегистраторНадпись.Видимость 		= НЕ СЭ_СкрытьКадровуюИнформациюЗУН;
		//СЭ- Евгений [16766]
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
&После("ПриЧтенииНаСервере")
Процедура СЭ_ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если Элементы.Найти("СЭ_СвязанныеЗУН") <> Неопределено Тогда
		СЭ_ОбновитьДанныеТаблицНаСервере();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СЭ_СоздатьЭлементыФормы()

	//СЭ+ Евгений [16177] создаём динамически заполняемую таблицу формы, похожую как в карточке ЗУН
	
	//СозданиеТЧ++++
	ИмяТЧ = "СЭ_СвязанныеЗУН";
	
	ТаблицаКолонок = Новый ТаблицаЗначений;
	ТаблицаКолонок.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(3, 0)), "НПП");
	ТаблицаКолонок.Колонки.Добавить("УровеньСотрудника", Новый ОписаниеТипов("СправочникСсылка.СЭ_УровниСотрудников"), "Уровень сотрудника");
	ТаблицаКолонок.Колонки.Добавить("ЗУН", Новый ОписаниеТипов("СправочникСсылка.СЭ_ЗУН"), "ЗУН");
	ТаблицаКолонок.Колонки.Добавить("РучнойВвод", Новый ОписаниеТипов("Булево"));
	
	СЭ_СоздатьРеквизитыТаблицы(ТаблицаКолонок, ИмяТЧ);
	
	НовСтраница = Элементы.Добавить("СЭ_СтраницаСвязанныеЗУН", Тип("ГруппаФормы"), Элементы.СтраницыФормы);
	НовСтраница.Вид = ВидГруппыФормы.Страница;
	НовСтраница.Заголовок = "План повышения квалификации";
		
	НоваяТаблица = Элементы.Добавить(ИмяТЧ, Тип("ТаблицаФормы"), Элементы.СЭ_СтраницаСвязанныеЗУН);
	НоваяТаблица.ПутьКДанным = ИмяТЧ;
	НоваяТаблица.Отображение = ОтображениеТаблицы.Список;
	НоваяТаблица.Заголовок = "План повышения квалификации";
	НоваяТаблица.УстановитьДействие("ПриНачалеРедактирования", "СЭ_СвязанныеЗУНПриНачалеРедактирования");
	
	//СЭ+ Евгений [17199] было принято решение скрыть вкладку мол больше не нужна, но не удалять вдруг снова понадобится
	НовСтраница.Видимость = Ложь;
	НоваяТаблица.Видимость = Ложь;
	//СЭ- Евгений [17199]

	//СЭ+ Евгений новая вводная, все колонки Только просмотр и заполнять будут только из карточек ЗУН
	НоваяТаблица.ИзменятьСоставСтрок = Ложь;
	НоваяТаблица.УстановитьДействие("Выбор", "СЭ_СвязанныеЗУНВыбор");
	//СЭ- Евгений новая вводная, все колонки Только просмотр и заполнять будут только из карточек ЗУН

	Для каждого Колонка из ТаблицаКолонок.Колонки Цикл
		
		Если Колонка.Имя = "РучнойВвод" Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяКолонка = Элементы.Добавить(СтрШаблон("%1_%2", ИмяТЧ, Колонка.Имя), Тип("ПолеФормы"), НоваяТаблица);
		НоваяКолонка.Вид 			= ВидПоляФормы.ПолеВвода;
		НоваяКолонка.ПутьКДанным 	= СтрШаблон("%1.%2", ИмяТЧ, Колонка.Имя);
		НоваяКолонка.Заголовок 		= Колонка.Заголовок;
		
		//СЭ+ Евгений новая вводная, все колонки Только просмотр и заполнять будут только из карточек ЗУН
		//Если Колонка.Имя = "Порядок" Тогда
		//	НоваяКолонка.ТолькоПросмотр = Истина;
		//Иначе
		//	НоваяКолонка.КартинкаШапки 	= БиблиотекаКартинок.Изменить;
		//КонецЕсли;
		НоваяКолонка.ТолькоПросмотр = Истина; 
		//СЭ- Евгений новая вводная, все колонки Только просмотр и заполнять будут только из карточек ЗУН
		
	КонецЦикла;
	
	//Производные колонки от ЗУН
	СЭ_ДобавитьКолонкуВТЧПоЗУН(ИмяТЧ, "УчебныеМатериалы", "Учебные материалы");
	СЭ_ДобавитьКолонкуВТЧПоЗУН(ИмяТЧ, "ОбластьЗУН", "Область ЗУН");
	СЭ_ДобавитьКолонкуВТЧПоЗУН(ИмяТЧ, "ТипЗУН", "Тип ЗУН");
	СЭ_ДобавитьКолонкуВТЧПоЗУН(ИмяТЧ, "СпособПолученияЗУН", "Способ получения ЗУН");
	СЭ_ДобавитьКолонкуВТЧПоЗУН(ИмяТЧ, "УровеньИзученияЗУН", "Уровень изучения ЗУН");
	СЭ_ДобавитьКолонкуВТЧПоЗУН(ИмяТЧ, "НеОбязательное", "Не обязательное");
	СЭ_ДобавитьКолонкуВТЧПоЗУН(ИмяТЧ, "НеАктуально", "Не актуально");
	//СозданиеТЧ----
	                            
	//Команды++++
	//Группа сортировки
	НоваяГруппа = Элементы.Добавить(СтрШаблон("%1_КомандыСортировать", ИмяТЧ), Тип("ГруппаФормы"), НоваяТаблица.КоманднаяПанель);
	НоваяГруппа.Вид = ВидГруппыФормы.ГруппаКнопок;
	НоваяГруппа.Отображение = ОтображениеГруппыКнопок.Компактное;
	
	НоваяКнопка = Элементы.Добавить(СтрШаблон("%1СортироватьСписокПоВозрастанию", ИмяТЧ), Тип("КнопкаФормы"), НоваяГруппа);
	//НоваяКнопка.ИмяКоманды = СтрШаблон("%1СортироватьСписокПоВозрастанию", ИмяТЧ); 
    НоваяКнопка.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВКоманднойПанелиИВДополнительномПодменю;
	
	НоваяКнопка = Элементы.Добавить(СтрШаблон("%1СортироватьСписокПоУбыванию", ИмяТЧ), Тип("КнопкаФормы"), НоваяГруппа);
	//НоваяКнопка.ИмяКоманды = СтрШаблон("%1СортироватьСписокПоУбыванию", ИмяТЧ);   
	НоваяКнопка.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВКоманднойПанелиИВДополнительномПодменю;
	
	//ОбновитьДанныеТЧ
	НоваяКоманда = ЭтаФорма.Команды.Добавить("СЭ_ОбновитьДанныеТЧ");
	НоваяКоманда.Действие = "СЭ_ОбновитьДанныеТЧ";
	//НоваяКоманда.Подсказка = "Обновить данные ТЧ по данным регистра, добавленные новые вручную строки не удаляются, но положение может изменится";
	НоваяКоманда.Подсказка = "Обновить";

	НовыйЭлемент = Элементы.Добавить("СЭ_ОбновитьДанныеТЧ", Тип("КнопкаФормы"), НоваяТаблица.КоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = "СЭ_ОбновитьДанныеТЧ";
	НовыйЭлемент.Заголовок  = "Обновить";
	НовыйЭлемент.Отображение = ОтображениеКнопки.Картинка;
	НовыйЭлемент.Картинка = БиблиотекаКартинок.Обновить;
	
	//Подбор
	НоваяКоманда = ЭтаФорма.Команды.Добавить("СЭ_ПодборЗУН");
	НоваяКоманда.Действие = "СЭ_ПодборЗУН";
	
	НовыйЭлемент = Элементы.Добавить("СЭ_ПодборЗУН", Тип("КнопкаФормы"), НоваяТаблица.КоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = "СЭ_ПодборЗУН";
	НовыйЭлемент.Заголовок  = "Подбор";
	
	//Копировать по данным другой ШП
	НоваяКоманда = ЭтаФорма.Команды.Добавить("СЭ_КопироватьПоДаннымДругойШП");
	НоваяКоманда.Действие = "СЭ_КопироватьПоДаннымДругойШП";
	
	НовыйЭлемент = Элементы.Добавить("СЭ_КопироватьПоДаннымДругойШП", Тип("КнопкаФормы"), НоваяТаблица.КоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = "СЭ_КопироватьПоДаннымДругойШП";
	НовыйЭлемент.Заголовок  = "Скопировать из";
	//Команды----
	
	//СЭ+ Евгений новая вводная, все колонки Только просмотр и заполнять будут только из карточек ЗУН
	Элементы.СЭ_ПодборЗУН.Видимость = Ложь;
	Элементы.СЭ_КопироватьПоДаннымДругойШП.Видимость = Ложь;
	//СЭ- Евгений новая вводная, все колонки Только просмотр и заполнять будут только из карточек ЗУН
	
	//СЭ- Евгений [16177]
	
	//СЭ+ Евгений [17113]
	ИмяТЧ = "СЭ_ПланРазвития";
	
	ТаблицаКолонок = Новый ТаблицаЗначений;
	ТаблицаКолонок.Колонки.Добавить("КвалификацияЗУН", Новый ОписаниеТипов("СправочникСсылка.СЭ_КвалификацииЗУН"), "Квалификации ЗУН");
	ТаблицаКолонок.Колонки.Добавить("РучнойВвод", Новый ОписаниеТипов("Булево"));
	
	СЭ_СоздатьРеквизитыТаблицы(ТаблицаКолонок, ИмяТЧ);
	
	НовСтраница = Элементы.Добавить("СЭ_СтраницаПланРазвития", Тип("ГруппаФормы"), Элементы.СтраницыФормы);
	НовСтраница.Вид = ВидГруппыФормы.Страница;
	НовСтраница.Заголовок = "План развития";
	
	НоваяТаблица = Элементы.Добавить(ИмяТЧ, Тип("ТаблицаФормы"), НовСтраница);
	НоваяТаблица.ПутьКДанным = ИмяТЧ;
	НоваяТаблица.Отображение = ОтображениеТаблицы.Список;
	НоваяТаблица.Заголовок = "План развития";
    НоваяТаблица.УстановитьДействие("ПриНачалеРедактирования", "СЭ_ПланРазвитияНачалеРедактирования");

	Для каждого Колонка из ТаблицаКолонок.Колонки Цикл
		
		Если Колонка.Имя = "РучнойВвод" Тогда
			Продолжить;
		КонецЕсли;
	
		НоваяКолонка = Элементы.Добавить(СтрШаблон("%1_%2", ИмяТЧ, Колонка.Имя), Тип("ПолеФормы"), НоваяТаблица);
		НоваяКолонка.Вид 			= ВидПоляФормы.ПолеВвода;
		НоваяКолонка.ПутьКДанным 	= СтрШаблон("%1.%2", ИмяТЧ, Колонка.Имя);
		НоваяКолонка.Заголовок 		= Колонка.Заголовок;
				
	КонецЦикла;
	//СозданиеТЧ----
	//СЭ- Евгений [17113]
	
КонецПроцедуры

//СЭ+ Евгений [16177] создаём динамически заполняемую таблицу формы, похожую как в карточке ЗУН
&НаКлиенте
Процедура СЭ_СвязанныеЗУНПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.Порядок = Неопределено;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СЭ_СвязанныеЗУНВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(, Элемент.ТекущиеДанные.ЗУН);
КонецПроцедуры

&НаСервере
Процедура СЭ_СоздатьРеквизитыТаблицы(ТаблицаКолонок, ИмяТЧНаФорме)

	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяТЧНаФорме, Новый ОписаниеТипов("ТаблицаЗначений")));
	Для каждого Колонка из ТаблицаКолонок.Колонки Цикл
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, ИмяТЧНаФорме));
	КонецЦикла;
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты); 	

КонецПроцедуры

&НаСервере
Процедура СЭ_ДобавитьКолонкуВТЧПоЗУН(ИмяТаблицыНаФорме, ИмяРеквизитаЗУН, ЗаголовокКолонки)
	
	НоваяТаблица = Элементы[ИмяТаблицыНаФорме];
	
	НоваяКолонка = Элементы.Добавить(СтрШаблон("%1_ЗУН_%2", ИмяТаблицыНаФорме, ИмяРеквизитаЗУН), Тип("ПолеФормы"), НоваяТаблица);
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	НоваяКолонка.ПутьКДанным = СтрШаблон("%1.ЗУН.%2", ИмяТаблицыНаФорме, ИмяРеквизитаЗУН);
	НоваяКолонка.Заголовок = ЗаголовокКолонки;
	НоваяКолонка.ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаСервере
Процедура СЭ_ОбновитьДанныеТаблицНаСервере()
	
	//СЭ_СвязанныеЗУН +++
	ИмяТЧ = "СЭ_СвязанныеЗУН";
	
	//СЭ+ Евгений [17199] было принято решение скрыть вкладку мол больше не нужна, но не удалять вдруг снова понадобится
	Если Элементы[ИмяТЧ].Видимость Тогда
	//СЭ- Евгений [17199] было принято решение скрыть вкладку мол больше не нужна, но не удалять вдруг снова понадобится
			
		ТЗ_ДанныхНаФорме = ЭтаФорма[ИмяТЧ].Выгрузить();
		
		Запрос = Новый Запрос();
		Запрос.Текст = СЭ_ПолучитьЗапросКРегиструДляТЧ();
		Запрос.УстановитьПараметр("ШтатнаяПозиция", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		ЭтаФорма[ИмяТЧ].Загрузить(РезультатЗапроса);	
		
		//Если были добавлены позиции руками то их не теряем
		Для каждого СтрокаТЗ Из ТЗ_ДанныхНаФорме Цикл
			Если СтрокаТЗ.РучнойВВод Тогда
				
				ИмяКлючевогоПоля = "ЗУН";
				
				//Если мы добавили позиции руками, записали а потом обновляем, то то что было ручным перестало быть ручным
				Отбор = Новый Структура;
				Отбор.Вставить(ИмяКлючевогоПоля, СтрокаТЗ[ИмяКлючевогоПоля]); 
				
				СтрокиПоиска = ЭтаФорма[ИмяТЧ].НайтиСтроки(Отбор);
				Если СтрокиПоиска.Количество() > 0 Тогда
					Продолжить;
				КонецЕсли;
				
				НовСтрока = ЭтаФорма[ИмяТЧ].Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТЗ);
				
			КонецЕсли;
		КонецЦикла;
		
		ЭтаФорма[ИмяТЧ].Сортировать("Порядок ВОЗР");
		
	КонецЕсли;
	//СЭ_СвязанныеЗУН ---
	
	//СЭ+ Евгений [17113] ПланРазвития +++
	ИмяТЧ = "СЭ_ПланРазвития";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СЭ_ПланРазвития.КвалификацияЗУН КАК КвалификацияЗУН
		|ИЗ
		|	РегистрСведений.СЭ_ПланРазвития КАК СЭ_ПланРазвития
		|ГДЕ
		|	СЭ_ПланРазвития.ШтатнаяПозиция = &ШтатнаяПозиция
		|
		|УПОРЯДОЧИТЬ ПО
		|	СЭ_ПланРазвития.КвалификацияЗУН.НомерДляСортировки";
	
	Запрос.УстановитьПараметр("ШтатнаяПозиция", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
	ЭтаФорма[ИмяТЧ].Загрузить(РезультатЗапроса);
	//СЭ- Евгений [17113] ПланРазвития ---
	
КонецПроцедуры

&НаСервере
Функция СЭ_ПолучитьЗапросКРегиструДляТЧ()
	
	ТекстЗапрос = "ВЫБРАТЬ
	              |	Регистр.ЗУН КАК ЗУН,
	              |	Регистр.Порядок КАК Порядок,
	              |	Регистр.УровеньСотрудника КАК УровеньСотрудника
	              |ИЗ
	              |	РегистрСведений.СЭ_СвязанныеСКвалификациейЗУН КАК Регистр
	              |ГДЕ
	              |	Регистр.КвалификацияЗУН.СоответствиеШтатныхПозиций.ШтатнаяПозиция = &ШтатнаяПозиция
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	Регистр.Порядок";
	
		
	Возврат ТекстЗапрос;
	
КонецФункции 

&НаКлиенте
Процедура СЭ_ОбновитьДанныеТЧ(Команда)
	
	СЭ_ОбновитьДанныеТаблицНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СЭ_ПодборЗУН(Команда)
	
	ОткрытьФорму("Справочник.СЭ_ЗУН.ФормаВыбора", СЭ_ПолучитьПараметрыФормыВыбора(), ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Функция СЭ_ПолучитьПараметрыФормыВыбора()

	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("РежимВыбора"		, Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
    ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.ГруппыИЭлементы);

    Возврат ПараметрыФормы;
	
КонецФункции

&НаКлиенте
Процедура СЭ_ОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.СЭ_ЗУН.ФормаВыбора" Тогда
		СЭ_ОбщаяПроцедураОбработкиПодбора(ВыбранноеЗначение);
	КонецЕсли;
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.ШтатноеРасписание.ФормаВыбора"
		ИЛИ ИсточникВыбора.ИмяФормы = "Справочник.ШтатноеРасписание.Форма.ФормаСписка"
		Тогда
		Если ВыбранноеЗначение <> Неопределено Тогда
			СЭ_КопироватьПоДаннымДругогоНаСервере(ВыбранноеЗначение);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура СЭ_ОбщаяПроцедураОбработкиПодбора(ВыбранноеЗначение)
	
	ИмяТЧ = "СЭ_СвязанныеЗУН"; 
	ИмяРеквизита = "ЗУН";
	
	МассивГрупп 	= Новый Массив;
	МассивЭлементов = Новый Массив;
	Для каждого СтрокаВыбора Из ВыбранноеЗначение Цикл
		Если СтрокаВыбора.ЭтоГруппа Тогда
			МассивГрупп.Добавить(СтрокаВыбора);	
		Иначе
			МассивЭлементов.Добавить(СтрокаВыбора);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Справочник.Ссылка
		|ПОМЕСТИТЬ СписокЭлементов
		|ИЗ
		|	Справочник.СЭ_ЗУН КАК Справочник
		|ГДЕ
		|	Справочник.Ссылка В(&МассивЭлементов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокЭлементов.Ссылка КАК Ссылка
		|ИЗ
		|	СписокЭлементов КАК СписокЭлементов
		|
		|СГРУППИРОВАТЬ ПО
		|	СписокЭлементов.Ссылка";
		
	//На случай если когда нибудь будет принято решение сделать справочник иерархическим
	Если МассивГрупп.Количество() > 0 Тогда
		
		ТекстПоискаГрупп = 
		"ВЫБРАТЬ	
		|	Справочник.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ СписокЭлементов
		|ИЗ
		|	Справочник.СЭ_ЗУН КАК Справочник
		|ГДЕ
		|	Справочник.Родитель В ИЕРАРХИИ (&МассивГрупп)
		|	И Справочник.ЭтоГруппа = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПОМЕСТИТЬ СписокЭлементов", "");
		Запрос.Текст = ТекстПоискаГрупп + Запрос.Текст;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивЭлементов", МассивЭлементов);
	Запрос.УстановитьПараметр("МассивГрупп", МассивГрупп);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Отбор = Новый Структура(ИмяРеквизита, Выборка.Ссылка);
		СтрокиПоиска = ЭтаФорма[ИмяТЧ].НайтиСтроки(Отбор);
		Если СтрокиПоиска.Количество() = 0 Тогда
			НовСтрока = ЭтаФорма[ИмяТЧ].Добавить();
			НовСтрока[ИмяРеквизита]  = Выборка.Ссылка;
			НовСтрока.РучнойВВод	= Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Модифицированность = Истина;
	

КонецПроцедуры

&НаКлиенте
Процедура СЭ_КопироватьПоДаннымДругойШП(Команда)

	СЭ_КопироватьПоДаннымДругогоНаКлиенте("СЭ_СвязанныеЗУН");

КонецПроцедуры

&НаКлиенте
Процедура СЭ_КопироватьПоДаннымДругогоНаКлиенте(ИмяТЧ)
	
	Если ЭтаФорма[ИмяТЧ].Количество() > 0 Тогда
		Оп = Новый ОписаниеОповещения("СЭ_КопироватьПоДаннымДругогоНаКлиентеЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оп, "Данные в таблице будут перезаполнены. Продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		СЭ_КопироватьПоДаннымДругогоНаКлиентеВыполнение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СЭ_КопироватьПоДаннымДругогоНаКлиентеЗавершение(Результат, ДопПараметры)  Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		СЭ_КопироватьПоДаннымДругогоНаКлиентеВыполнение();	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СЭ_КопироватьПоДаннымДругогоНаКлиентеВыполнение()
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("РежимВыбора"		, Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	
	ОткрытьФорму("Справочник.ШтатноеРасписание.ФормаВыбора", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура СЭ_КопироватьПоДаннымДругогоНаСервере(ВыбранноеЗначение)

	ИмяТЧ = "СЭ_СвязанныеЗУН";
	
	Запрос = Новый Запрос();
	Запрос.Текст = СЭ_ПолучитьЗапросКРегиструДляТЧ();
	Запрос.УстановитьПараметр("ШтатнаяПозиция", ВыбранноеЗначение);
	
	ЭтаФорма[ИмяТЧ].Загрузить(Запрос.Выполнить().Выгрузить());
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
&После("ПриЗаписиНаСервере")
Процедура СЭ_ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СЭ_СохранитьСвязанныеЗУН(ТекущийОбъект, Отказ);
	
	//СЭ+ Евгений [17113]
	СЭ_СохранитьПланРазвития(ТекущийОбъект, Отказ);
	//СЭ- Евгений [17113]
	
КонецПроцедуры 

&НаСервере
Процедура СЭ_СохранитьСвязанныеЗУН(ТекущийОбъект, Отказ)
	
	ИмяТЧ = "СЭ_СвязанныеЗУН";
	
	//СЭ+ Евгений [17199] было принято решение скрыть вкладку мол больше не нужна, но не удалять вдруг снова понадобится
	Если Элементы[ИмяТЧ].Видимость Тогда
	//СЭ- Евгений [17199] было принято решение скрыть вкладку мол больше не нужна, но не удалять вдруг снова понадобится
		
		ИмяРегистра = "СЭ_СвязанныеСКвалификациейЗУН";
	
		НачатьТранзакцию();
		
		//ВНИМАНИЕ!!! Изменена структура регистра, если потребуется вернуть механизм надо изменить алгоритм записи в регистр+++++++
		//Попытка
		//		
		//	НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей(); 	
		//	НаборЗаписей.Отбор.КвалификацияЗУН.Установить(ТекущийОбъект.Ссылка); 

		//	Для Каждого СтрокаТЧ Из ЭтаФорма[ИмяТЧ] Цикл  		
		//		НоваяЗапись = НаборЗаписей.Добавить();  		
		//		НоваяЗапись.КвалификацияЗУН = ТекущийОбъект.Ссылка; 
		//		ЗаполнитьЗначенияСвойств(НоваяЗапись,СтрокаТЧ);
		//		
		//		СтрокаТЧ.РучнойВВод = Ложь;
		//	КонецЦикла; 
		//	
		//	НаборЗаписей.Записать();	
		//	
		//	ЗафиксироватьТранзакцию();
		//	
		//Исключение
		//	
		//	Отказ = Истина;
		//	
		//	Сообщение = Новый СообщениеПользователю;
		//	Сообщение.Текст = СтрШаблон("При записи данных из таблицы ""%1"" произошла ошибка: %2", Элементы[ИмяТЧ].Заголовок, ОписаниеОшибки());
		//	Сообщение.Сообщить();  
		//	
		//	ОтменитьТранзакцию();
		//	
		//КонецПопытки;
		//ВНИМАНИЕ!!! Изменена структура регистра, если потребуется вернуть механизм надо изменить алгоритм записи в регистр-------
		
	КонецЕсли;
	
КонецПроцедуры
//СЭ- Евгений [16177] 

//СЭ+ Евгений [17113]
&НаКлиенте
Процедура СЭ_ПланРазвитияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.РучнойВвод = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СЭ_СохранитьПланРазвития(ТекущийОбъект, Отказ)
	
	ИмяТЧ = "СЭ_ПланРазвития"; 
	ИмяРегистра = "СЭ_ПланРазвития";
	
	НачатьТранзакцию();
	
	Попытка
			
		НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей(); 	
		НаборЗаписей.Отбор.ШтатнаяПозиция.Установить(ТекущийОбъект.Ссылка); 

		Для Каждого СтрокаТЧ Из ЭтаФорма[ИмяТЧ] Цикл  		
			НоваяЗапись = НаборЗаписей.Добавить();  		
			НоваяЗапись.ШтатнаяПозиция = ТекущийОбъект.Ссылка; 
			ЗаполнитьЗначенияСвойств(НоваяЗапись,СтрокаТЧ);
			
			СтрокаТЧ.РучнойВВод = Ложь;
		КонецЦикла; 
		
		НаборЗаписей.Записать();	
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("При записи данных из таблицы ""%1"" произошла ошибка: %2", Элементы[ИмяТЧ].Заголовок, ОписаниеОшибки());
		Сообщение.Сообщить();  
		
		ОтменитьТранзакцию();
		
	КонецПопытки;
	
КонецПроцедуры
//СЭ- Евгений [17113]
