
&НаСервере
&После("ПриСозданииНаСервере")
Процедура СЭ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СЭ_СоздатьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Процедура СЭ_СоздатьЭлементыФормы()

	//СЭ+ Евгений [16498]
	НовГруппа 							= Элементы.Добавить("СЭ_ГруппаМолодойСпециалист", Тип("ГруппаФормы"), ЭтаФорма);
	НовГруппа.Вид 						= ВидГруппыФормы.ОбычнаяГруппа;
	НовГруппа.Отображение 				= ОтображениеОбычнойГруппы.Нет;
	НовГруппа.ОтображатьЗаголовок 		= Ложь;
	НовГруппа.Группировка 				= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;

	нЭлемент = Элементы.Вставить("СЭ_МолодойСпециалист", Тип("ПолеФормы"), НовГруппа); 
	нЭлемент.Вид = ВидПоляФормы.ПолеФлажка; 
	нЭлемент.ПутьКДанным = "Объект.СЭ_МолодойСпециалист";
	нЭлемент.УстановитьДействие("ПриИзменении", "СЭ_МолодойСпециалистПриИзменении");
	
	нЭлемент = Элементы.Вставить("СЭ_ДатаНачалаСтатуса", Тип("ПолеФормы"), НовГруппа); 
	нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	нЭлемент.ПутьКДанным = "Объект.СЭ_ДатаНачалаСтатуса";
	нЭлемент.АвтоОтметкаНезаполненного = ЛОЖЬ; 
	
	нЭлемент = Элементы.Вставить("СЭ_ДатаОкончанияСтатуса", Тип("ПолеФормы"), НовГруппа); 
	нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	нЭлемент.ПутьКДанным = "Объект.СЭ_ДатаОкончанияСтатуса";
	нЭлемент.АвтоОтметкаНезаполненного = ЛОЖЬ;
	
	СЭ_УстановитьЗависимостиМолодогоСпециалиста();
	//СЭ- Евгений [16498]

КонецПроцедуры

//СЭ+ Евгений [16498]
&НаКлиенте
Процедура СЭ_МолодойСпециалистПриИзменении(Элемент)
	
	СЭ_УстановитьЗависимостиМолодогоСпециалиста();		

КонецПроцедуры 

&НаСервере
Процедура СЭ_УстановитьЗависимостиМолодогоСпециалиста()
	
	Если Объект.ВидОбразования = ПредопределенноеЗначение("Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеРБ") Тогда
		Элементы.СЭ_МолодойСпециалист.ТолькоПросмотр = Ложь;
	Иначе
		Объект.СЭ_МолодойСпециалист = Ложь;	
		Элементы.СЭ_МолодойСпециалист.ТолькоПросмотр = Истина;			
	КонецЕсли;
		
	Если НЕ Объект.СЭ_МолодойСпециалист Тогда
		Объект.СЭ_ДатаНачалаСтатуса 	= Неопределено;
		Объект.СЭ_ДатаОкончанияСтатуса 	= Неопределено;
	КонецЕсли;

	Элементы.СЭ_ДатаНачалаСтатуса.ТолькоПросмотр	= НЕ Объект.СЭ_МолодойСпециалист; 
	Элементы.СЭ_ДатаОкончанияСтатуса.ТолькоПросмотр = НЕ Объект.СЭ_МолодойСпециалист;
	
КонецПроцедуры


&НаКлиенте
&После("ВидОбразованияПриИзменении")
Процедура СЭ_ВидОбразованияПриИзменении(Элемент)
	
	СЭ_УстановитьЗависимостиМолодогоСпециалиста();
	
КонецПроцедуры
//СЭ- Евгений [16498]