
#Область ОбработчикиСобытийФормы

&НаСервере
&После("ПриСозданииНаСервере")
Процедура СЭ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СЭ+ Немкович [15628]
	СЭ_ДополнитьФормуЭлементамиПрограммно();
	// СЭ- Немкович
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СЭ+ Немкович [15628]
&НаСервере
Процедура СЭ_ДополнитьФормуЭлементамиПрограммно()
	
	Если Элементы.Найти("СЭ_ДолжностьПУ2") = неопределено тогда
		НовыйЭлемент = Элементы.Вставить("СЭ_ДолжностьПУ2", Тип("ПолеФормы"), Элементы.ПраваяКолонка, Элементы.ГруппаГрейд);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.РастягиватьПоГоризонтали = ложь;
		НовыйЭлемент.ПутьКДанным = "Объект.СЭ_ДолжностьПУ2";
	КонецЕсли;
	
	Если Элементы.Найти("СЭ_Подразделение") = неопределено тогда
		НовыйЭлемент = Элементы.Вставить("СЭ_Подразделение", Тип("ПолеФормы"), Элементы.ПраваяКолонка, Элементы.ГруппаГрейд);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.РастягиватьПоГоризонтали = ложь;
		НовыйЭлемент.ПутьКДанным = "Объект.СЭ_Подразделение";
	КонецЕсли;
	
	Если Элементы.Найти("СЭ_РазрядКатегория") = неопределено тогда
		НовыйЭлемент = Элементы.Вставить("СЭ_РазрядКатегория", Тип("ПолеФормы"), Элементы.ГруппаКатегории_Локализация, Элементы.ЯвляетсяРуководителемОрганизации);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.РастягиватьПоГоризонтали = ложь;
		НовыйЭлемент.ПутьКДанным = "Объект.СЭ_РазрядКатегория";
	КонецЕсли;
	
КонецПроцедуры
// СЭ- Немкович

#КонецОбласти
