
#Область ОбработчикиСобытийФормы
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СЭ_ДатаПриИзмененииПосле(Элемент)
	
	// СЭ+ Немкович [16037]
	СЭ_УстановитьЗаголовкиИнформационныхПолей();
	// СЭ- Немкович
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСотрудники

&НаКлиенте
Процедура СЭ_СотрудникиВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// СЭ+ Немкович [16037]
	НеТиповоеПользованиеДокументом = Объект.СЭ_НеТиповойВариантПроведения;
	ТекущиеДанныеСтроки = Элементы.Сотрудники.ДанныеСтроки(ВыбраннаяСтрока);
	
	Если НеТиповоеПользованиеДокументом тогда
		
		ЭлементИнформацииНахожденияВОтпуске = Элементы.СотрудникиСЭ_РасширеннаяИнформацияНахождениеВОтпуске;
		ЭлементИнформацииОстаткиОтпуска 	= Элементы.СотрудникиСЭ_РасширеннаяИнформацияОстаткиОтпуска;
		
		Если Поле = ЭлементИнформацииНахожденияВОтпуске
			или Поле = ЭлементИнформацииОстаткиОтпуска тогда
			
			КонтекстИнформации = ?(
				Поле = ЭлементИнформацииНахожденияВОтпуске, 
				"НахождениеВОтпуске", ?(
					Поле = ЭлементИнформацииОстаткиОтпуска,
					"ОстаткиОтпуска", ""));
			
			ТекущийСотрудник = ТекущиеДанныеСтроки.Сотрудник;
			Если ЗначениеЗаполнено(ТекущийСотрудник) тогда
				СЭ_ПолучитьРасширеннуюИнформациюПоКонтексту(КонтекстИнформации, ТекущийСотрудник, ?(Объект.Дата = Дата(1,1,1), ТекущаяДата(), Объект.Дата));	
			Иначе
				Сообщить("Не указан сотрудник в текущей строке. Проверьте заполнение и повторите действие.");	
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	// СЭ- Немкович
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
&Перед("ИнициализироватьФорму")
Процедура СЭ_ИнициализироватьФорму()
	
	// СЭ+ Немкович [16037]
	СЭ_ДобавитьРеквизитыФормыПрограммно();
	СЭ_ДополнитьФормуПрограммно();
	СЭ_УстановитьЗаголовкиИнформационныхПолей();
	// СЭ- Немкович
	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ЗаполнитьВторичныеДанныеСотрудниковВФорме")
Процедура СЭ_ЗаполнитьВторичныеДанныеСотрудниковВФорме(Строки)
	МассивСотрудников = Новый Массив;
	Для каждого Строка Из Строки Цикл
		Если НЕ ЗначениеЗаполнено(Строка.Сотрудник) Тогда
			Продолжить;
		КонецЕсли;
		МассивСотрудников.Добавить(Строка.Сотрудник);	
	КонецЦикла;
	
#Удаление
	КадровыеДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(Истина, МассивСотрудников, "КраткосрочныйТрудовойДоговор");
#КонецУдаления
#Вставка
	// СЭ+ Немкович [16037]
	КадровыеДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(Истина, МассивСотрудников, "КраткосрочныйТрудовойДоговор,ТекущаяДолжностьПоШтатномуРасписанию");
	ОстаткиОтпусковСотрудников = Документы.ГрафикОтпусков.СЭ_ОстаткиОтпускаПоСотрудникам(МассивСотрудников, КонецГода(?(Объект.Дата = Дата(1,1,1), ТекущаяДатаСеанса(), Объект.Дата)));
	ПериодыНахожденияВОтпускеСотрудников = Документы.ГрафикОтпусков.СЭ_ПериодыНахожденияВОтпускеПоСотрудникам(МассивСотрудников, Объект.Дата);
	// СЭ- Немкович
#КонецВставки
	Отбор = Новый Структура("Сотрудник");
	Для каждого Строка Из Строки Цикл  
		Если НЕ ЗначениеЗаполнено(Строка.Сотрудник) Тогда
			Продолжить;
		КонецЕсли;
		Отбор.Сотрудник  = Строка.Сотрудник;
		Строка.КраткосрочныйТрудовойДоговорСотрудника = Ложь;
		КадровыеДанныеСотрудника = КадровыеДанныеСотрудников.НайтиСтроки(Отбор);
		Если КадровыеДанныеСотрудника.Количество() > 0 Тогда
			Строка.КраткосрочныйТрудовойДоговорСотрудника = КадровыеДанныеСотрудника[0].КраткосрочныйТрудовойДоговор;
#Вставка
			// СЭ+ Немкович [16037]
			Если Строка.Свойство("СЭ_ДолжностьПоШтатномуРасписанию") тогда
				Строка.СЭ_ДолжностьПоШтатномуРасписанию = КадровыеДанныеСотрудника[0].ТекущаяДолжностьПоШтатномуРасписанию; 
			КонецЕсли;
			// СЭ- Немкович
#КонецВставки
		КонецЕсли;
#Вставка
		// СЭ+ Немкович [16037]
		Если Строка.Свойство("СЭ_ИнформацияОстаткиОтпуска") тогда
			ОстаткиОтпускаСотрудника = ОстаткиОтпусковСотрудников.НайтиСтроки(Отбор);
			Если ОстаткиОтпускаСотрудника.Количество() > 0 Тогда
				Строка.СЭ_ИнформацияОстаткиОтпуска = СтрШаблон("Остаток %1 к/дн (за %2 - %3)", 
					ОстаткиОтпускаСотрудника[0].ОстатокДней,
					Формат(ОстаткиОтпускаСотрудника[0].РабочийГодНачало, "ЧГ=0"),
					Формат(ОстаткиОтпускаСотрудника[0].РабочийГодОкончание, "ЧГ=0")); 
			Иначе
				Строка.СЭ_ИнформацияОстаткиОтпуска = "<Данные об остатках отсутствуют>";
			КонецЕсли;
		КонецЕсли;
		
		Если Строка.Свойство("СЭ_ИнформацияНахождениеВОтпуске") тогда
			ПериодыНахожденияВОтпускеСотрудника = ПериодыНахожденияВОтпускеСотрудников.НайтиСтроки(Отбор);
			Если ПериодыНахожденияВОтпускеСотрудника.Количество() > 0 Тогда
				Строка.СЭ_ИнформацияНахождениеВОтпуске = СтрШаблон("%1 - %2", 
					Формат(ПериодыНахожденияВОтпускеСотрудника[0].ДатаНачала, "ДФ=dd.MM"),
					Формат(ПериодыНахожденияВОтпускеСотрудника[0].ДатаОкончания, "ДФ=dd.MM")); 
			Иначе
				Строка.СЭ_ИнформацияНахождениеВОтпуске = "<Данные по периодам отпуска отсутствуют>";
			КонецЕсли;
		КонецЕсли;
		// СЭ- Немкович
#КонецВставки

	КонецЦикла;
КонецПроцедуры

// СЭ+ Немкович [16037]
&НаСервере
Процедура СЭ_ДобавитьРеквизитыФормыПрограммно()
	
	// ╔═══════════════════════════════════════ WARNING ═════════════════════════════════════════╗
	// ║ Проверки перед добавлением реквизитов выполняем по наличию элементов формы, поскольку,  ║
	// ║ в случае, если они есть, - к ним прокинуты пути к реквизитам. Данное действие           ║
	// ║ выполняется для того, чтобы обойти исключительных ситуаций при инициализации формы -    ║
	// ║ оно вызывается каждый раз при чтении и один раз при создании на сервере, когда          ║
	// ║ документ первоначально создается.                                                       ║
	// ╚═════════════════════════════════════════════════════════════════════════════════════════╝
	
	НеТиповоеПользованиеДокументом = Объект.СЭ_НеТиповойВариантПроведения;
	
	УстановитьПривилегированныйРежим(Истина);
	ШтатноеРасписаниеИспользуется = ПолучитьФункциональнуюОпцию("ИспользоватьШтатноеРасписание");
	УстановитьПривилегированныйРежим(Ложь);
	
	// Добавление новых реквизитов формы
	ДобавляемыеРеквизиты = новый Массив();
	
	Если ШтатноеРасписаниеИспользуется
		и Элементы.Найти("СЭ_ДолжностьПоШтатномуРасписанию") = неопределено тогда
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("СЭ_ДолжностьПоШтатномуРасписанию", новый ОписаниеТипов("СправочникСсылка.ШтатноеРасписание"), "Объект.Сотрудники", "Должность"));
	КонецЕсли;
	
	// Заглушки с текстом для расширенной подсказки
	Если НеТиповоеПользованиеДокументом тогда
		
		Если Элементы.Найти("СотрудникиСЭ_ГруппаНахождениеВОтпуске") = неопределено тогда
			ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("СЭ_ИнформацияНахождениеВОтпуске", 			новый ОписаниеТипов("Строка"), "Объект.Сотрудники", "Периоды нахождения в отпуске в текущем году"));
			ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("СЭ_РасширеннаяИнформацияНахождениеВОтпуске", новый ОписаниеТипов("Строка"), "Объект.Сотрудники", "Расширенная информация"));
		КонецЕсли;
		
		Если Элементы.Найти("СотрудникиСЭ_ГруппаОстаткиОтпуска") = неопределено тогда
			ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("СЭ_ИнформацияОстаткиОтпуска", 				новый ОписаниеТипов("Строка"), "Объект.Сотрудники", "Остатки неиспользованного отпуска на конец прошедшего года"));
			ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("СЭ_РасширеннаяИнформацияОстаткиОтпуска", 	новый ОписаниеТипов("Строка"), "Объект.Сотрудники", "Расширенная информация"));
		КонецЕсли;
		
	КонецЕсли;
	
	// Удаление существующих реквизитов формы
	УдаляемыеРеквизиты 	 = новый Массив();
	
	Если ДобавляемыеРеквизиты.Количество() > 0 или УдаляемыеРеквизиты.Количество() > 0 тогда
		ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты, УдаляемыеРеквизиты);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СЭ_ДополнитьФормуПрограммно()
	
	НеТиповоеПользованиеДокументом = Объект.СЭ_НеТиповойВариантПроведения;
	
	УстановитьПривилегированныйРежим(Истина);
	ШтатноеРасписаниеИспользуется = ПолучитьФункциональнуюОпцию("ИспользоватьШтатноеРасписание");
	УстановитьПривилегированныйРежим(Ложь);
	
	// Добавление/удаление элементов формы
	Если ШтатноеРасписаниеИспользуется 
		и Элементы.Найти("СЭ_ДолжностьПоШтатномуРасписанию") = неопределено тогда
		
		НовыйЭлемент 					= Элементы.Добавить("СЭ_ДолжностьПоШтатномуРасписанию", Тип("ПолеФормы"), Элементы.Сотрудники);
		НовыйЭлемент.Заголовок 			= "Должность";
		НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеНадписи;
		НовыйЭлемент.ПутьКДанным 		= "Объект.Сотрудники.СЭ_ДолжностьПоШтатномуРасписанию";
		
	КонецЕсли;
	
	// Если не типовой вариант проведения документа - добавляем элементы согласно ТЗ по тикету 16037,
	// в ином случае - добавление новых элементов не требуется. Помимо добавления новых элементов -
	// скрываем ненужные. Сделано для обратной совместимости.
	Если НеТиповоеПользованиеДокументом тогда
		
		Если Элементы.Найти("СотрудникиСЭ_ГруппаНахождениеВОтпуске") = неопределено тогда
			
			НоваяГруппаКолонок 					= Элементы.Добавить("СотрудникиСЭ_ГруппаНахождениеВОтпуске", Тип("ГруппаФормы"), Элементы.Сотрудники);
			НоваяГруппаКолонок.Заголовок 		= "";
			НоваяГруппаКолонок.Группировка 		= ГруппировкаКолонок.Вертикальная;
			НоваяГруппаКолонок.ОтображатьВШапке = ложь;
		
			НовыйЭлемент 					= Элементы.Добавить("СотрудникиСЭ_ИнформацияНахождениеВОтпуске", Тип("ПолеФормы"), НоваяГруппаКолонок);
			НовыйЭлемент.Заголовок 			= "Периоды нахождения в отпуске в текущем году";
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным 		= "Объект.Сотрудники.СЭ_ИнформацияНахождениеВОтпуске";
			НовыйЭлемент.ГоризонтальноеПоложение 		= ГоризонтальноеПоложениеЭлемента.Центр;
			НовыйЭлемент.ГоризонтальноеПоложениеВШапке 	= ГоризонтальноеПоложениеЭлемента.Центр;
			
			НовыйЭлемент 					= Элементы.Добавить("СотрудникиСЭ_РасширеннаяИнформацияНахождениеВОтпуске", Тип("ПолеФормы"), НоваяГруппаКолонок);
			НовыйЭлемент.Заголовок 			= "";
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеНадписи;
			НовыйЭлемент.ГиперссылкаЯчейки 	= истина;
			НовыйЭлемент.Гиперссылка 		= истина;
			НовыйЭлемент.ОтображатьВШапке 	= ложь;
			НовыйЭлемент.ПутьКДанным 		= "Объект.Сотрудники.СЭ_РасширеннаяИнформацияНахождениеВОтпуске";
			
			ЭлементУсловногоОформления 		= УсловноеОформление.Элементы.Добавить();
			ПолеЭлемента 					= ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ПолеЭлемента.Поле 				= Новый ПолеКомпоновкиДанных("СотрудникиСЭ_РасширеннаяИнформацияНахождениеВОтпуске");
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст"					, "Расширенная информация");
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста" 				, Новый Цвет(28, 85, 174));
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ГоризонтальноеПоложение"	, ГоризонтальноеПоложение.Центр);
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ВертикальноеПоложение"	, ВертикальноеПоложение.Центр);
			
		КонецЕсли;
		
		Если Элементы.Найти("СотрудникиСЭ_ГруппаОстаткиОтпуска") = неопределено тогда
		
			НоваяГруппаКолонок 					= Элементы.Добавить("СотрудникиСЭ_ГруппаОстаткиОтпуска", Тип("ГруппаФормы"), Элементы.Сотрудники);
			НоваяГруппаКолонок.Заголовок 		= "";
			НоваяГруппаКолонок.Группировка 		= ГруппировкаКолонок.Вертикальная;
			НоваяГруппаКолонок.ОтображатьВШапке = ложь;
			
			НовыйЭлемент 					= Элементы.Добавить("СотрудникиСЭ_ИнформацияОстаткиОтпуска", Тип("ПолеФормы"), НоваяГруппаКолонок);
			НовыйЭлемент.Заголовок 			= "Остатки неиспользованного отпуска на конец прошедшего года";
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным 		= "Объект.Сотрудники.СЭ_ИнформацияОстаткиОтпуска";
			НовыйЭлемент.ГоризонтальноеПоложение 		= ГоризонтальноеПоложениеЭлемента.Центр;
			НовыйЭлемент.ГоризонтальноеПоложениеВШапке 	= ГоризонтальноеПоложениеЭлемента.Центр;
			
			НовыйЭлемент 					= Элементы.Добавить("СотрудникиСЭ_РасширеннаяИнформацияОстаткиОтпуска", Тип("ПолеФормы"), НоваяГруппаКолонок);
			НовыйЭлемент.Заголовок 			= "";
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеНадписи;
			НовыйЭлемент.ГиперссылкаЯчейки 	= истина;
			НовыйЭлемент.Гиперссылка 		= истина;
			НовыйЭлемент.ОтображатьВШапке 	= ложь;
			НовыйЭлемент.ПутьКДанным 		= "Объект.Сотрудники.СЭ_РасширеннаяИнформацияОстаткиОтпуска";
			
			ЭлементУсловногоОформления 		= УсловноеОформление.Элементы.Добавить();
			ПолеЭлемента 					= ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ПолеЭлемента.Поле 				= Новый ПолеКомпоновкиДанных("СотрудникиСЭ_РасширеннаяИнформацияОстаткиОтпуска");
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст"					, "Расширенная информация");
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста" 				, Новый Цвет(28, 85, 174));
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ГоризонтальноеПоложение"	, ГоризонтальноеПоложение.Центр);
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ВертикальноеПоложение"	, ВертикальноеПоложение.Центр);
			
		КонецЕсли;
		
		Если Элементы.Найти("СотрудникиСЭ_ПланируемыйОтпуск") = неопределено тогда
			
			НовыйЭлемент 					= Элементы.Добавить("СотрудникиСЭ_ПланируемыйОтпуск", Тип("ПолеФормы"), Элементы.Сотрудники);
			НовыйЭлемент.Заголовок 			= "Планируемый отпуск";
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным 		= "Объект.Сотрудники.СЭ_ПланируемыйОтпуск";
			
		КонецЕсли;
		
		СкрываемыеЭлементыСтрокой = "СотрудникиДатаНачала,СотрудникиДатаОкончания,СотрудникиГруппаВидОтпускаПериод,СотрудникиКоличествоДней,СотрудникиФактическийОтпуск";
		МассивСкрываемыхЭлементов = СтрРазделить(СкрываемыеЭлементыСтрокой, ",", ложь);
		Для каждого ТекущийСкрываемыйЭлемент из МассивСкрываемыхЭлементов цикл
			Элементы[ТекущийСкрываемыйЭлемент].Доступность = ложь;
			Элементы[ТекущийСкрываемыйЭлемент].Видимость = ложь;
		КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура СЭ_УстановитьЗаголовкиИнформационныхПолей()
	
	ГодОстатков = ?(ЗначениеЗаполнено(Объект.Дата), Год(Объект.Дата), Год(ТекущаяДатаСеанса()));
	
	Если Элементы.Найти("СотрудникиСЭ_ИнформацияНахождениеВОтпуске") <> неопределено тогда
		Элементы["СотрудникиСЭ_ИнформацияНахождениеВОтпуске"].Заголовок = СтрШаблон("Периоды нахождения в отпуске в %1 году", Формат(ГодОстатков, "ЧГ=0"));	
	КонецЕсли;
	
	Если Элементы.Найти("СотрудникиСЭ_ИнформацияОстаткиОтпуска") <> неопределено тогда
		Элементы["СотрудникиСЭ_ИнформацияОстаткиОтпуска"].Заголовок = СтрШаблон("Остатки неиспользованного отпуска на конец %1 года", Формат(ГодОстатков + 1, "ЧГ=0"));	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СЭ_ПолучитьРасширеннуюИнформациюПоКонтексту(КонтекстИнформации, ТекущийСотрудник, ДатаСобытия)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КонтекстИнформации", КонтекстИнформации);
	ПараметрыФормы.Вставить("Сотрудник", 		  ТекущийСотрудник);
	ПараметрыФормы.Вставить("ДатаСобытия", 		  КонецГода(ДатаСобытия));
	
	ОткрытьФорму(
		"Документ.ГрафикОтпусков.Форма.СЭ_РасширеннаяИнформацияПоОтпускам", 
		ПараметрыФормы, 
		ЭтаФорма,,,, 
		Новый ОписаниеОповещения(), 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
// СЭ- Немкович

#КонецОбласти