#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

// СЭ+ Немкович [16037]
&НаСервере
Функция СЭ_ОстаткиОтпускаПоСотрудникам(Сотрудники, ДатаСобытия, ОграничениеПоДатеСобытия = истина, ПорядокСортировки = "УБЫВ") Экспорт
	
	Если ДатаСобытия = Дата(1,1,1) тогда
		ДатаСобытия = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ГОД(ФактическиеОтпуска.Период) КАК ПериодОтпуска,
	|	ФактическиеОтпуска.Сотрудник КАК Сотрудник,
	|	СУММА(ВЫРАЗИТЬ(ФактическиеОтпуска.Количество КАК ЧИСЛО(5, 0))) КАК КоличествоДней
	|ПОМЕСТИТЬ ВТФактическиеОтпуска
	|ИЗ
	|	РегистрНакопления.ФактическиеОтпуска КАК ФактическиеОтпуска
	|ГДЕ
	|	ФактическиеОтпуска.Сотрудник В(&Сотрудники)
	|
	|СГРУППИРОВАТЬ ПО
	|	ФактическиеОтпуска.Сотрудник,
	|	ГОД(ФактическиеОтпуска.Период)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаработанныеПраваНаОтпуска.Сотрудник КАК Сотрудник,
	|	ГОД(НАЧАЛОПЕРИОДА(ЗаработанныеПраваНаОтпуска.Период, ГОД)) КАК РабочийГодНачало,
	|	ГОД(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ЗаработанныеПраваНаОтпуска.Период, ГОД), СЕКУНДА, 1)) КАК РабочийГодОкончание,
	|	СУММА(ВЫРАЗИТЬ(ЗаработанныеПраваНаОтпуска.КоличествоДнейЗаПериод КАК ЧИСЛО(5, 0))) КАК ОстатокДней
	|ПОМЕСТИТЬ ВТОстатокОтпуска
	|ИЗ
	|	РегистрСведений.ЗаработанныеПраваНаОтпуска КАК ЗаработанныеПраваНаОтпуска
	|ГДЕ
	|	ЗаработанныеПраваНаОтпуска.Сотрудник В(&Сотрудники)
	|	И ЗаработанныеПраваНаОтпуска.Период <= КОНЕЦПЕРИОДА(&ДатаСобытия, ГОД)" + ?(ОграничениеПоДатеСобытия, "
	|	И ЗаработанныеПраваНаОтпуска.Период МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаСобытия, ГОД) И КОНЕЦПЕРИОДА(&ДатаСобытия, ГОД)", "") + "
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаработанныеПраваНаОтпуска.Сотрудник,
	|	ГОД(НАЧАЛОПЕРИОДА(ЗаработанныеПраваНаОтпуска.Период, ГОД)),
	|	ГОД(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ЗаработанныеПраваНаОтпуска.Период, ГОД), СЕКУНДА, 1))
	|;
	|	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстатокОтпуска.Сотрудник КАК Сотрудник,
	|	ОстатокОтпуска.РабочийГодНачало КАК РабочийГодНачало,
	|	ОстатокОтпуска.РабочийГодОкончание КАК РабочийГодОкончание,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ФактическиеОтпуска.КоличествоДней, 0) = 0
	|			ТОГДА ОстатокОтпуска.ОстатокДней - ФактическиеОтпуска.КоличествоДней
	|		ИНАЧЕ ОстатокОтпуска.ОстатокДней
	|	КОНЕЦ КАК ОстатокДней
	|ИЗ
	|	ВТОстатокОтпуска КАК ОстатокОтпуска
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФактическиеОтпуска КАК ФактическиеОтпуска
	|		ПО ОстатокОтпуска.Сотрудник = ФактическиеОтпуска.Сотрудник
	|			И ОстатокОтпуска.РабочийГодНачало = ФактическиеОтпуска.ПериодОтпуска
	|
	|УПОРЯДОЧИТЬ ПО
	|	РабочийГодНачало " + ПорядокСортировки;
	Запрос = новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
	Запрос.УстановитьПараметр("ДатаСобытия", ДатаСобытия);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция СЭ_ПериодыНахожденияВОтпускеПоСотрудникам(Сотрудники, ДатаСобытия, ОграничениеПоДатеСобытия = истина, ПорядокСортировки = "УБЫВ") Экспорт
	
	Если ДатаСобытия = Дата(1,1,1) тогда
		ДатаСобытия = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ФактическиеОтпуска.Сотрудник КАК Сотрудник,
	|	ФактическиеОтпуска.ДатаНачала КАК ДатаНачала,
	|	ФактическиеОтпуска.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	РегистрНакопления.ФактическиеОтпуска КАК ФактическиеОтпуска
	|ГДЕ
	|	ФактическиеОтпуска.Сотрудник В(&Сотрудники)
	|	И ФактическиеОтпуска.ДатаНачала <= КОНЕЦПЕРИОДА(&ДатаСобытия, ГОД)" + ?(ОграничениеПоДатеСобытия, "
	|	И ФактическиеОтпуска.ДатаНачала МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаСобытия, ГОД) И КОНЕЦПЕРИОДА(&ДатаСобытия, ГОД)", "") + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаНачала " + ПорядокСортировки;
	
	Запрос = новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
	Запрос.УстановитьПараметр("ДатаСобытия", ДатаСобытия);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
// СЭ- Немкович
	
#КонецОбласти

#КонецЕсли