
#Область ОбработчикиСобытий

&ИзменениеИКонтроль("ОбработкаПроверкиЗаполнения")
Процедура СЭ_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
#Вставка
	// СЭ+ Немкович [16037]
	Если СЭ_НеТиповойВариантПроведения тогда
		УдаляемыеИзПроверкиРеквизитыСтрокой = "Сотрудники.ВидОтпуска,Сотрудники.ДатаНачала,Сотрудники.ДатаОкончания";
		МассивУдаляемыхИзПроверкиРеквизитов = СтрРазделить(УдаляемыеИзПроверкиРеквизитыСтрокой, ",", Ложь);
		Для каждого ТекущийПроверяемыйРеквизит из МассивУдаляемыхИзПроверкиРеквизитов цикл
			ИндексУдаляемогоИзПроверкиРеквизита = ПроверяемыеРеквизиты.Найти(ТекущийПроверяемыйРеквизит);
			Если ИндексУдаляемогоИзПроверкиРеквизита <> неопределено тогда
				ПроверяемыеРеквизиты.Удалить(ИндексУдаляемогоИзПроверкиРеквизита);
			КонецЕсли;
		КонецЦикла;
		
	Иначе
	// СЭ- Немкович
#КонецВставки
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОтпускаСотрудников", Сотрудники.Выгрузить());

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтпускаСотрудниковСотрудники.Сотрудник,
	|	ОтпускаСотрудниковСотрудники.ВидОтпуска,
	|	ОтпускаСотрудниковСотрудники.НомерСтроки,
	|	ОтпускаСотрудниковСотрудники.ДатаНачала,
	|	ОтпускаСотрудниковСотрудники.ДатаОкончания,
	|	ОтпускаСотрудниковСотрудники.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск,
	|	ОтпускаСотрудниковСотрудники.КонецПериодаЗаКоторыйПредоставляетсяОтпуск
	|ПОМЕСТИТЬ ВТОтпускаСотрудников
	|ИЗ
	|	&ОтпускаСотрудников КАК ОтпускаСотрудниковСотрудники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтпускаСотрудников.Сотрудник,
	|	ОтпускаСотрудников.НомерСтроки
	|ПОМЕСТИТЬ ВТСтрокиСНекорректноЗаполненнымПериодомПредоставленияОтпуска
	|ИЗ
	|	ВТОтпускаСотрудников КАК ОтпускаСотрудников
	|ГДЕ
	|	ВЫРАЗИТЬ(ОтпускаСотрудников.ВидОтпуска КАК Справочник.ВидыОтпусков).ОтпускЯвляетсяЕжегодным
	|	И (ОтпускаСотрудников.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ ОтпускаСотрудников.КонецПериодаЗаКоторыйПредоставляетсяОтпуск = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ ОтпускаСотрудников.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск >= ОтпускаСотрудников.КонецПериодаЗаКоторыйПредоставляетсяОтпуск)
	|	И ОтпускаСотрудников.ДатаНачала <= ОтпускаСотрудников.ДатаОкончания
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтпускаСотрудников.Сотрудник,
	|	ОтпускаСотрудников.НомерСтроки
	|ИЗ
	|	ВТОтпускаСотрудников КАК ОтпускаСотрудников
	|ГДЕ
	|	ОтпускаСотрудников.ДатаНачала > ОтпускаСотрудников.ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтпускаСотрудников.Сотрудник,
	|	МАКСИМУМ(ОтпускаСотрудниковДругие.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ ВТПересекаютсяПериодыОтпусков
	|ИЗ
	|	ВТОтпускаСотрудников КАК ОтпускаСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтпускаСотрудников КАК ОтпускаСотрудниковДругие
	|		ПО ОтпускаСотрудников.Сотрудник = ОтпускаСотрудниковДругие.Сотрудник
	|			И ОтпускаСотрудников.НомерСтроки <> ОтпускаСотрудниковДругие.НомерСтроки
	|			И ОтпускаСотрудников.ДатаОкончания >= ОтпускаСотрудниковДругие.ДатаНачала
	|			И ОтпускаСотрудников.ДатаОкончания <= ОтпускаСотрудниковДругие.ДатаОкончания
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтпускаСотрудников.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПересекаютсяПериодыОтпусков.Сотрудник,
	|	ПересекаютсяПериодыОтпусков.НомерСтроки КАК НомерСтроки,
	|	ОтпускаСотрудников.ВидОтпуска КАК ВидОтпуска,
	|	ИСТИНА КАК ПересекаютсяПериоды,
	|	ЛОЖЬ КАК НекорректныйПериодПредоставления
	|ПОМЕСТИТЬ ВТСводный
	|ИЗ
	|	ВТПересекаютсяПериодыОтпусков КАК ПересекаютсяПериодыОтпусков
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтпускаСотрудников КАК ОтпускаСотрудников
	|		ПО ПересекаютсяПериодыОтпусков.НомерСтроки = ОтпускаСотрудников.НомерСтроки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтрокиСНекорректноЗаполненнымПериодомПредоставленияОтпуска.Сотрудник,
	|	СтрокиСНекорректноЗаполненнымПериодомПредоставленияОтпуска.НомерСтроки,
	|	ОтпускаСотрудников.ВидОтпуска,
	|	ЛОЖЬ,
	|	ИСТИНА
	|ИЗ
	|	ВТСтрокиСНекорректноЗаполненнымПериодомПредоставленияОтпуска КАК СтрокиСНекорректноЗаполненнымПериодомПредоставленияОтпуска
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтпускаСотрудников КАК ОтпускаСотрудников
	|		ПО СтрокиСНекорректноЗаполненнымПериодомПредоставленияОтпуска.НомерСтроки = ОтпускаСотрудников.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сводный.Сотрудник,
	|	Сводный.НомерСтроки КАК НомерСтроки,
	|	Сводный.ВидОтпуска,
	|	МАКСИМУМ(Сводный.ПересекаютсяПериоды) КАК ПересекаютсяПериоды,
	|	МАКСИМУМ(Сводный.НекорректныйПериодПредоставления) КАК НекорректныйПериодПредоставления
	|ИЗ
	|	ВТСводный КАК Сводный
	|
	|СГРУППИРОВАТЬ ПО
	|	Сводный.Сотрудник,
	|	Сводный.НомерСтроки,
	|	Сводный.ВидОтпуска
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";

	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда

		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл

			ТекстСообщения = "";

			Если Выборка.НекорректныйПериодПредоставления Тогда
				ТекстСообщения = ?(ПустаяСтрока(ТекстСообщения), "", ТекстСообщения +", ") +
				НСтр("ru='некорректно задан период предоставления отпуска'");
			КонецЕсли; 

			Если Выборка.ПересекаютсяПериоды Тогда
				ТекстСообщения = ?(ПустаяСтрока(ТекстСообщения), "", ТекстСообщения +", ") +
				НСтр("ru='пересекается период нахождения в отпуске'");
			КонецЕсли; 

			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='По сотруднику %1:'"),
			Выборка.Сотрудник)
			+ " " + ТекстСообщения;

			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,
			,
			"Сотрудники[" + (Выборка.НомерСтроки - 1) + "].Сотрудник",
			"Объект",
			Отказ);

		КонецЦикла;

	КонецЕсли; 

	Документы.ГрафикОтпусков.ПроверитьРаботающих(ЭтотОбъект, Отказ);
	
#Вставка
	// СЭ+ Немкович [16037]
	КонецЕсли;
	// СЭ- Немкович
#КонецВставки

КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура СЭ_ОбработкаПроведения(Отказ, РежимПроведения)
#Удаление
	ОтменитьЗапланированныеОтпуска();
	ЗарегистрироватьЗапланированныеОтпуска();
#КонецУдаления
#Вставка
	// СЭ+ Немкович [16037]
	Если не СЭ_НеТиповойВариантПроведения тогда
		ОтменитьЗапланированныеОтпуска();
		ЗарегистрироватьЗапланированныеОтпуска();
	КонецЕсли;
	// СЭ- Немкович
#КонецВставки
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаУдаленияПроведения")
Процедура СЭ_ОбработкаУдаленияПроведения(Отказ)
#Удаление
	ОтменитьЗапланированныеОтпуска();
#КонецУдаления
#Вставка
	// СЭ+ Немкович [16037]
	Если не СЭ_НеТиповойВариантПроведения тогда
		ОтменитьЗапланированныеОтпуска();
	КонецЕсли;
	// СЭ- Немкович
#КонецВставки
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
