
//&ИзменениеИКонтроль("ПриОпределенииКомандПодключенныхКОбъекту")
//Процедура СЭ_ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды)

//	МетаданныеФормы = Метаданные.ОбщиеФормы.СвязанныеДокументы;
//	Если Не ПравоДоступа("Просмотр", МетаданныеФормы) Тогда
//		Возврат;
//	КонецЕсли;

//	ТипПараметраКоманды = ТипПараметраКоманды(Источники);
//	Если ТипПараметраКоманды = Неопределено Тогда
//		Возврат;
//	КонецЕсли;

//	Команда = Команды.Добавить();
//	Команда.Представление      = НСтр("ru = 'Связанные документы';
//	|en = 'Related documents'");
//#Удаление
//	Команда.Вид                = "Отчеты";
//#КонецУдаления
//#Вставка
//	// СЭ+ Немкович [16385]
//	Команда.Вид                = "СвязанныеДокументы";
//	// СЭ- Немкович
//#КонецВставки
//	Команда.МножественныйВыбор = Ложь;
//	Команда.ИмяПараметраФормы  = "ОбъектОтбора";
//	Команда.ИмяФормы           = МетаданныеФормы.ПолноеИмя();
//	Команда.Важность           = "СмТакже";
//	Команда.ТипПараметра       = ТипПараметраКоманды;
//	Команда.СочетаниеКлавиш    = Новый СочетаниеКлавиш(Клавиша.S, Ложь, Истина, Истина);
//	Команда.Картинка           = БиблиотекаКартинок.СтруктураПодчиненности;

//КонецПроцедуры

&ИзменениеИКонтроль("ПриОпределенииВидовПодключаемыхКоманд")
Процедура СЭ_ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд)
	
#Удаление
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВариантыОтчетов") Тогда
		Возврат;
	КонецЕсли;
#КонецУдаления

	Вид = ВидыПодключаемыхКоманд.Добавить();
#Удаление
	Вид.Имя         = "Отчеты";
#КонецУдаления
#Вставка
	// СЭ+ Немкович [16385]
	Вид.Имя         = "СвязанныеДокументы";
	// СЭ- Немкович
#КонецВставки
	Вид.ИмяПодменю  = "ПодменюОтчеты";
	Вид.Заголовок   = НСтр("ru = 'Отчеты';
	|en = 'Reports'");
	Вид.Порядок     = 50;
	Вид.Картинка    = БиблиотекаКартинок.Отчет;
	Вид.Отображение = ОтображениеКнопки.КартинкаИТекст;

КонецПроцедуры

&ИзменениеИКонтроль("ПриОпределенииКомандПодключенныхКОбъекту")
Процедура СЭ_ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды)

	МетаданныеФормы = Метаданные.ОбщиеФормы.СвязанныеДокументы;
	Если Не ПравоДоступа("Просмотр", МетаданныеФормы) Тогда
		Возврат;
	КонецЕсли;

	ТипПараметраКоманды = ТипПараметраКоманды(Источники);
	Если ТипПараметраКоманды = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Команда = Команды.Добавить();
	Команда.Представление      = НСтр("ru = 'Связанные документы';
	|en = 'Related documents'");
	#Удаление
	Команда.Вид                = "Отчеты";
	#КонецУдаления
	#Вставка
	// СЭ+ Немкович [16385]
	Команда.Вид                = "СвязанныеДокументы";
	// СЭ- Немкович
	#КонецВставки
	Команда.МножественныйВыбор = Ложь;
	Команда.ИмяПараметраФормы  = "ОбъектОтбора";
	Команда.ИмяФормы           = МетаданныеФормы.ПолноеИмя();
	Команда.Важность           = "СмТакже";
	Команда.ТипПараметра       = ТипПараметраКоманды;
	Команда.СочетаниеКлавиш    = Новый СочетаниеКлавиш(Клавиша.S, Ложь, Истина, Истина);
	Команда.Картинка           = БиблиотекаКартинок.СтруктураПодчиненности;
	Команда.Порядок = 100;

КонецПроцедуры
