 
 //+СЭ Пилипчук 0016039
&НаСервере
&Перед("ПриПолученииДанныхНаСервере")
Процедура СЭ_ПриПолученииДанныхНаСервере(ТекущийОбъект)
	//СЭ Пилипчук 0016187
	Элементы.СрочныйДоговор.Заголовок = "Продление контракта, договора";
	//СЭ Пилипчук 0016187	
	СЭ_РаботаСФормамиСервер.СЭ_СоздатьРеквизитыСерияИНомерПоСерииВкадровыхДокументах(Элементы, "ГруппаНомерДатаПриказаОПриеме", ТекущийОбъект.Ссылка); 
	
КонецПроцедуры   

&НаКлиенте
Процедура СЭ_ДатаПриИзмененииПосле(Элемент)
	СЭ_ДатаПриИзмененииПослеНаСервере();
КонецПроцедуры


&НаСервере
Процедура СЭ_ДатаПриИзмененииПослеНаСервере()
	//СЭ Пилипчук 0016039	
	СЭ_ОбщегоНазначенияВызовСервераПривилегированный.ВыдатьСообщениеОчисткиСерииИНомераПриИзмененииДаты(Объект); 	
	//СЭ Пилипчук 0016039
КонецПроцедуры
 //-СЭ Пилипчук 0016039 
