#Область обработчикиСобытийФормы

&НаКлиенте
Процедура СЭ_ПриОткрытииПосле(Отказ)
	
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ("Текст EDT");
	Сообщение.Сообщить();
	
	
	Сообщение2 = Новый СообщениеПользователю();
	Сообщение2.Текст = ("Тест EDT2");
	Сообщение2.Сообщить();
	
	
	Сообщение3 = Новый СообщениеПользователю();
	Сообщение3.Текст = ("Тест EDT3");
	Сообщение3.Сообщить();
	
	
	Сообщение4 = Новый СообщениеПользователю();
	Сообщение4.Текст = ("Тест EDT4");
	Сообщение4.Сообщить();
	
	
	

КонецПроцедуры

#КонецОбласти