	 
Процедура СЭ_СоздатьРеквизитыСерияИНомерПоСерииВкадровыхДокументах(Элементы, ЭлементГруппа, Источник) Экспорт
	
	ВидимостьПолей = Ложь; 
	
	ИмяМетаданные = Метаданные.НайтиПоТипу(ТипЗнч(Источник)).ПолноеИмя();	
	ВидимостьПолей = СЭ_ОбщегоНазначенияВызовСервераПривилегированный.ПрисутствиеДокументаВСправочникеСерийныеКадровыеДокументы(ИмяМетаданные);
	
	Если Элементы.Найти("СЭ_НомерПоСерии") = Неопределено Тогда
		
		НовыйЭлемент = Элементы.Вставить("СЭ_НомерПоСерии", Тип("ПолеФормы"), Элементы[ЭлементГруппа]);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.СЭ_НомерПоСерии"; 
        НовыйЭлемент.Заголовок = "№ по серии";
		//СЭ Ульяна 0016481
		//НовыйЭлемент.ТолькоПросмотр = Истина;
		//СЭ Ульяна 0016481
		НовыйЭлемент.Видимость = ВидимостьПолей; 
		НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Истина;
		НовыйЭлемент.Ширина = 5;
		
	КонецЕсли;

	Если Элементы.Найти("СЭ_Серия") = Неопределено Тогда
		
		НовыйЭлемент = Элементы.Вставить("СЭ_Серия", Тип("ПолеФормы"), Элементы[ЭлементГруппа]);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.СЭ_Серия";
		НовыйЭлемент.ТолькоПросмотр = Истина;
		НовыйЭлемент.Видимость = ВидимостьПолей;
		НовыйЭлемент.Заголовок = "Серия";
		НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Истина;
		НовыйЭлемент.Ширина = 2; 
		
	КонецЕсли;
	
	
КонецПроцедуры 

//СЭ Ульяна 0016035

Процедура СЭ_СоздатьРеквизитыФормы(Элементы) Экспорт
	

	СЭ_ГруппаДополнительногоСоглашения 					   = Элементы.Вставить("СЭ_ГруппаДополнительногоСоглашения", Тип("ГруппаФормы"), Элементы.ДоговорКонтракт, Элементы.ГруппаПоступлениеНаСлужбу);
	СЭ_ГруппаДополнительногоСоглашения.Вид 				   = ВидГруппыФормы.ОбычнаяГруппа;
	СЭ_ГруппаДополнительногоСоглашения.Отображение 		   = ОтображениеОбычнойГруппы.Нет;
	СЭ_ГруппаДополнительногоСоглашения.ОтображатьЗаголовок = Ложь;
	СЭ_ГруппаДополнительногоСоглашения.Группировка 		   = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	СЭ_ГруппаДополнительногоСоглашения.Поведение 		   = ПоведениеОбычнойГруппы.Обычное;
    
	СЭ_ТипДополнительногоСоглашения					       = Элементы.Добавить("СЭ_ТипДополнительногоСоглашения", Тип("ПолеФормы"), СЭ_ГруппаДополнительногоСоглашения);
	СЭ_ТипДополнительногоСоглашения.Вид			           = ВидПоляФормы.ПолеВвода;
	СЭ_ТипДополнительногоСоглашения.ПутьКДанным	           = "Объект.СЭ_ТипДополнительногоСоглашения";
		
	СЭ_НомерДопСоглашения						    	   = Элементы.Добавить("СЭ_НомерДопСоглашения", Тип("ПолеФормы"), СЭ_ГруппаДополнительногоСоглашения);
	СЭ_НомерДопСоглашения.Вид					    	   = ВидПоляФормы.ПолеВвода;
	СЭ_НомерДопСоглашения.ПутьКДанным			    	   = "Объект.СЭ_НомерДопСоглашения";
	//СЭ_НомерДопСоглашения.Заголовок				    	  = "Номер доп. соглашения";
	СЭ_НомерДопСоглашения.МаксимальнаяШирина 		       =  5;
	СЭ_НомерДопСоглашения.РастягиватьПоГоризонтали         = Ложь;

	СЭ_ДатаДопСоглашения	             				   = Элементы.Добавить("СЭ_ДатаДопСоглашения", Тип("ПолеФормы"), СЭ_ГруппаДополнительногоСоглашения);
	СЭ_ДатаДопСоглашения.Вид	             			   = ВидПоляФормы.ПолеВвода;
	СЭ_ДатаДопСоглашения.ПутьКДанным             		   = "Объект.СЭ_ДатаДопСоглашения";
	//СЭ_ДатаДопСоглашения.Заголовок           			  = "Дата доп. соглашения";
	
	СЭ_ДобавитьИзменитьДопСоглашение					   = Элементы.Вставить("СЭ_ДобавитьИзменитьДопСоглашение", Тип("ПолеФормы"), Элементы.ДоговорКонтракт, Элементы.СЭ_ГруппаДополнительногоСоглашения);
	СЭ_ДобавитьИзменитьДопСоглашение.Вид				   = ВидПоляФормы.ПолеФлажка;
	СЭ_ДобавитьИзменитьДопСоглашение.ПутьКДанным		   = "Объект.СЭ_ДобавитьИзменитьДопСоглашение";
	СЭ_ДобавитьИзменитьДопСоглашение.ПоложениеЗаголовка    = ПоложениеЗаголовкаЭлементаФормы.Право;
    СЭ_ДобавитьИзменитьДопСоглашение.УстановитьДействие("ПриИзменении","СЭ_ДобавитьИзменитьДопСоглашениеПриИзменении");

КонецПроцедуры

//СЭ Ульяна 0016035