
&НаСервере
Процедура СЭ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//СЭ Ульяна 0016487
	Эл = Элементы.Добавить("Наличие", Тип("ПолеФормы"), Элементы.СписокРасширенныйПоискНоменклатура);
	//Эл.Заголовок = "НДФЛ к перечислению";
    Эл.ПутьКДанным = "СписокНоменклатура.Наличие";
	
	Эл = Элементы.Добавить("Резерв", Тип("ПолеФормы"), Элементы.СписокРасширенныйПоискНоменклатура);
	//Эл.Заголовок = "НДФЛ к перечислению";
    Эл.ПутьКДанным = "СписокНоменклатура.Резерв";
    //СЭ Ульяна 0016487

КонецПроцедуры
