
&НаСервере
&После("ПриСозданииНаСервере")
Процедура СЭ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//СЭ+ Евгений [16920] если надо установить отбор на тип помимо номенклатуры и на виды номенклатуры
	Если Параметры.Свойство("СЭ_ОтборыНаВидыНоменклатурыПоТипу") Тогда
		СЭ_УстановитьОтборыНаСписокВидовНоменклатуры(Параметры.СЭ_ОтборыНаВидыНоменклатурыПоТипу);	
	КонецЕсли;
	//СЭ- Евгений [16920]
	
КонецПроцедуры

//СЭ+ Евгений [16920]
&НаСервере
Процедура СЭ_УстановитьОтборыНаСписокВидовНоменклатуры(СЭ_ОтборыНаВидыНоменклатурыПоТипу)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ВидыНоменклатуры, "ТипНоменклатуры", СЭ_ОтборыНаВидыНоменклатурыПоТипу, ВидСравненияКомпоновкиДанных.ВСписке,, Истина);	
	
	//ограничиваем список выбора
	НовыйМассив = Новый Массив;
	НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипНоменклатуры", СЭ_ОтборыНаВидыНоменклатурыПоТипу);
	НовыйМассив.Добавить(НовыйПараметр);
	
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	
	Элементы.ВидНоменклатуры.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры
//СЭ- Евгений [16920]