
&ИзменениеИКонтроль("ДанныеДляПроведения")
Функция СЭ_ДанныеДляПроведения(ДокументСсылка)

	ДанныеДляПроведения = Новый Структура; 

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка,
	|	Сотрудники.Ссылка.Организация КАК Организация,
	|	Сотрудники.Сотрудник,
	|	Сотрудники.ФизическоеЛицо,
	|	Сотрудники.ДатаНачала,
	|	Сотрудники.ДатаОкончания,
	|	Сотрудники.ОбособленноеПодразделение,
	|	Сотрудники.ИзменитьПодразделениеИДолжность,
	|	Сотрудники.ИзменитьГрафикРаботы,
	|	Сотрудники.ИзменитьНачисления,
	|	Сотрудники.ИзменитьЕжегодныеОтпуска,
	|	Сотрудники.ИзменитьАванс,
	|	Сотрудники.ИзменитьЛьготы,
	|	Сотрудники.ИзменитьСведенияОДоговореКонтракте,
	|	Сотрудники.Ссылка.НачисленияУтверждены КАК НачисленияУтверждены,
	|	Сотрудники.Подразделение,
	|	Сотрудники.Должность,
	|	Сотрудники.ДолжностьПоШтатномуРасписанию,
	|	Сотрудники.ВидЗанятости,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Перемещение) КАК ВидСобытия,
	|	Сотрудники.КоличествоСтавок,
	|	Сотрудники.ГрафикРаботы,
	|	Сотрудники.СпособРасчетаАванса,
	|	Сотрудники.Аванс,
	|	Сотрудники.ПричинаПеревода,
	|	Сотрудники.ОснованиеПеревода,
	|	Сотрудники.Ссылка.Руководитель КАК Руководитель,
	|	Сотрудники.Ссылка.ДолжностьРуководителя КАК ДолжностьРуководителя,
	|	Сотрудники.СпособОтраженияЗарплатыВБухучете,
	|	Сотрудники.ОтношениеКЕНВД,
	|	Сотрудники.СтатьяФинансирования,
	|	Сотрудники.ПорядокРасчетаСтоимостиЕдиницыВремени,
	|	Сотрудники.СовокупнаяТарифнаяСтавка,
	|	Сотрудники.ВидТарифнойСтавки,
	|	Сотрудники.РазрядКатегория,
	|	Сотрудники.СменаВидаДоговора,
	|	Сотрудники.Ссылка.ВидДоговора КАК ВидДоговора,
	|	Сотрудники.ТрудовойДоговорНомер,
	|	Сотрудники.ТрудовойДоговорДата,
	|	Сотрудники.ВидТрудовогоДоговора,
	|	Сотрудники.СрочныйДоговор,
	|	Сотрудники.ДатаЗавершенияТрудовогоДоговора,
	|	Сотрудники.ОснованиеСрочногоДоговора,
	|	Сотрудники.СрокЗаключенияДоговора,
	|	Сотрудники.Ссылка.ОснованиеПредставителяНанимателя КАК ОснованиеПредставителяНанимателя,
	|	Сотрудники.СпособПоступленияНаСлужбу,
	|	Сотрудники.ПоступлениеНаСлужбуВпервые,
	|	Сотрудники.ВидАктаГосоргана,
	|	Сотрудники.ОборудованиеРабочегоМеста,
	|	Сотрудники.ИныеУсловияДоговора,
	|	Сотрудники.Грейд,     
		#Вставка
	//СЭ Ульяна 0016035
	|	Сотрудники.СЭ_ДатаДопСоглашения КАК СЭ_ДатаДопСоглашения,
	|	Сотрудники.СЭ_НомерДопСоглашения КАК СЭ_НомерДопСоглашения,
	|	Сотрудники.СЭ_ТипДополнительногоСоглашения КАК СЭ_ТипДополнительногоСоглашения,
	//СЭ Ульяна 0016035
	#КонецВставки

	|	Сотрудники.НаПериодПереводаСохранятьЛьготныйСтажПФР,
	|	Сотрудники.ВидСтажаПФР,
	|	Сотрудники.Территория,
	|	Сотрудники.ТарифныйОклад,
	|	Сотрудники.ДолжностнойОклад,
	// 4D:ERP для Беларуси, Алла, 11.01.2025 20:15:41 
	// Формирование пачки ПУ-2, №42417
	// {
	|	Сотрудники.Ссылка.НеВключатьВПУ2 КАК НеВключатьВПУ2
	// }
	// 4D
	|ПОМЕСТИТЬ ВТСотрудники
	|ИЗ
	|	Документ.КадровыйПеревод КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка = &Ссылка";

	Если ТипЗнч(ДокументСсылка) <> Тип("ДокументСсылка.КадровыйПеревод")  Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.КадровыйПеревод", "Документ.КадровыйПереводСписком.Сотрудники");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сотрудники.Сотрудник,",
		"Сотрудники.Сотрудник КАК Сотрудник, Сотрудники.ИдентификаторСтрокиСотрудника КАК ИдентификаторСтрокиСотрудника,");

	КонецЕсли;

	Запрос.Выполнить();

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.ДатаНачала КАК ДатаСобытия,
	|	ВЫБОР
	|		КОГДА Сотрудники.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДОБАВИТЬКДАТЕ(Сотрудники.ДатаОкончания, ДЕНЬ, 1)
	|		ИНАЧЕ Сотрудники.ДатаОкончания
	|	КОНЕЦ КАК ДействуетДо,
	|	Сотрудники.Сотрудник,
	|	Сотрудники.Аванс,
	|	Сотрудники.ДолжностьПоШтатномуРасписанию КАК Позиция,
	|	Сотрудники.Подразделение,
	|	Сотрудники.Должность,
	|	Сотрудники.КоличествоСтавок,
	|	Сотрудники.ВидСобытия,
	|	Сотрудники.ГрафикРаботы,
	|	Сотрудники.СпособРасчетаАванса,
	|	Сотрудники.ВидЗанятости,
	|	Сотрудники.ВидДоговора,
	|	Сотрудники.ФизическоеЛицо,
	// 4D:ERP для Беларуси, Алла, 11.01.2025 20:15:41 
	// Формирование пачки ПУ-2, №42417
	// {
	|	Сотрудники.НеВключатьВПУ2
	// }
	// 4D
	|ИЗ
	|	ВТСотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ИзменитьПодразделениеИДолжность";

	// Таблица для формирования кадровых движений.
	КадровыеДвижения = Запрос.Выполнить().Выгрузить();
	ДанныеДляПроведения.Вставить("КадровыеДвижения", КадровыеДвижения);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.ДатаНачала КАК ДатаСобытия,
	|	ВЫБОР
	|		КОГДА Сотрудники.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДОБАВИТЬКДАТЕ(Сотрудники.ДатаОкончания, ДЕНЬ, 1)
	|		ИНАЧЕ Сотрудники.ДатаОкончания
	|	КОНЕЦ КАК ДействуетДо,
	|	Сотрудники.Сотрудник,
	|	Сотрудники.ГрафикРаботы,
	|	Сотрудники.ВидСобытия
	|ИЗ
	|	ВТСотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ИзменитьГрафикРаботы";

	//Таблица для формирования истории графиков.
	ГрафикРаботыСотрудников = Запрос.Выполнить().Выгрузить();
	ДанныеДляПроведения.Вставить("ГрафикРаботыСотрудников", ГрафикРаботыСотрудников);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.ДатаНачала КАК ДатаСобытия,
	|	ВЫБОР
	|		КОГДА Сотрудники.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДОБАВИТЬКДАТЕ(Сотрудники.ДатаОкончания, ДЕНЬ, 1)
	|		ИНАЧЕ Сотрудники.ДатаОкончания
	|	КОНЕЦ КАК ДействуетДо,
	|	Сотрудники.Сотрудник,
	|	Сотрудники.ВидСобытия,
	|	Сотрудники.Аванс,
	|	Сотрудники.СпособРасчетаАванса, 
	| 	ВЫРАЗИТЬ(Сотрудники.Сотрудник КАК Справочник.Сотрудники).ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	Сотрудники.ФизическоеЛицо
	|ИЗ
	|	ВТСотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ИзменитьАванс
	|	И Сотрудники.НачисленияУтверждены";

	// Таблица для формирования движений авансов.
	ПлановыеВыплаты = Запрос.Выполнить().Выгрузить();
	ДанныеДляПроведения.Вставить("ПлановыеВыплаты", ПлановыеВыплаты);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.ДатаНачала КАК ДатаСобытия,
	|	ВЫБОР
	|		КОГДА Сотрудники.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДОБАВИТЬКДАТЕ(Сотрудники.ДатаОкончания, ДЕНЬ, 1)
	|		ИНАЧЕ Сотрудники.ДатаОкончания
	|	КОНЕЦ КАК ДействуетДо,
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	Начисления.Начисление,
	|	ВЫБОР
	|		КОГДА Начисления.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСНачислениямиИУдержаниями.Отменить)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Используется,
	|	Начисления.Размер,
	|	Сотрудники.ФизическоеЛицо
	|ИЗ
	|	Документ.КадровыйПеревод.Начисления КАК Начисления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
	|		ПО Начисления.Ссылка = Сотрудники.Ссылка
	|			И (Сотрудники.ИзменитьНачисления)
	|ГДЕ
	|	Начисления.Ссылка = &Ссылка
	|	И Начисления.Ссылка.НачисленияУтверждены
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Сотрудники.ДатаНачала,
	|	ВЫБОР
	|		КОГДА Сотрудники.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДОБАВИТЬКДАТЕ(Сотрудники.ДатаОкончания, ДЕНЬ, 1)
	|		ИНАЧЕ Сотрудники.ДатаОкончания
	|	КОНЕЦ,
	|	Сотрудники.Сотрудник,
	|	Льготы.Льгота,
	|	ВЫБОР
	|		КОГДА Льготы.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСНачислениямиИУдержаниями.Отменить)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	Льготы.Размер,
	|	Сотрудники.ФизическоеЛицо
	|ИЗ
	|	Документ.КадровыйПеревод.Льготы КАК Льготы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
	|		ПО Льготы.Ссылка = Сотрудники.Ссылка
	|			И (Сотрудники.ИзменитьЛьготы)
	|ГДЕ
	|	Льготы.Ссылка = &Ссылка";

	Если ТипЗнч(ДокументСсылка) <> Тип("ДокументСсылка.КадровыйПеревод")  Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.КадровыйПеревод", "Документ.КадровыйПереводСписком");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПО Начисления.Ссылка = Сотрудники.Ссылка", "ПО Начисления.Ссылка = Сотрудники.Ссылка И Начисления.ИдентификаторСтрокиСотрудника = Сотрудники.ИдентификаторСтрокиСотрудника");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Начисления.НомерСтроки <> КадровыйПереводНачисленияНеОтмененные.НомерСтроки", "И Начисления.НомерСтроки <> КадровыйПереводНачисленияНеОтмененные.НомерСтроки И Начисления.ИдентификаторСтрокиСотрудника = КадровыйПереводНачисленияНеОтмененные.ИдентификаторСтрокиСотрудника");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПО Льготы.Ссылка = Сотрудники.Ссылка", "ПО Льготы.Ссылка = Сотрудники.Ссылка И Льготы.ИдентификаторСтрокиСотрудника = Сотрудники.ИдентификаторСтрокиСотрудника");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Льготы.НомерСтроки <> КадровыйПереводЛьготыНеОтмененные.НомерСтроки", "И Льготы.НомерСтроки <> КадровыйПереводЛьготыНеОтмененные.НомерСтроки И Льготы.ИдентификаторСтрокиСотрудника = КадровыйПереводЛьготыНеОтмененные.ИдентификаторСтрокиСотрудника");
	КонецЕсли;

	// Таблица для формирования плановых начислений.
	ПлановыеНачисления = Запрос.Выполнить().Выгрузить();
	ДанныеДляПроведения.Вставить("ПлановыеНачисления", ПлановыеНачисления);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.ДатаНачала КАК ДатаСобытия,
	|	ВЫБОР
	|		КОГДА Сотрудники.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДОБАВИТЬКДАТЕ(Сотрудники.ДатаОкончания, ДЕНЬ, 1)
	|		ИНАЧЕ Сотрудники.ДатаОкончания
	|	КОНЕЦ КАК ДействуетДо,
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.ФизическоеЛицо,
	|	Сотрудники.Организация,
	|	Показатели.Показатель,
	|	Показатели.Значение,
	|	Начисления.Действие,
	|	Сотрудники.ОбособленноеПодразделение
	|ПОМЕСТИТЬ ВТПоказатели
	|ИЗ
	|	ВТСотрудники КАК Сотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КадровыйПеревод.Показатели КАК Показатели
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КадровыйПеревод.Начисления КАК Начисления
	|			ПО Показатели.Ссылка = Начисления.Ссылка
	|				И Показатели.ИдентификаторСтрокиВидаРасчета = Начисления.ИдентификаторСтрокиВидаРасчета
	// 4D:ERP для Беларуси, Алла, 23.02.2026 15:02:01  
	// Актуализация ФОТ в РС "Текущая тарифная ставка сотрудников" при кадровом переводе, №46001
	// {
	//|				И (Начисления.Действие <> ЗНАЧЕНИЕ(Перечисление.ДействияСНачислениямиИУдержаниями.Отменить))
	// }
	// 4D
	|		ПО Сотрудники.Ссылка = Показатели.Ссылка
	|ГДЕ
	|	Сотрудники.Ссылка = &Ссылка
	|	И Сотрудники.НачисленияУтверждены
	|	И (Сотрудники.ИзменитьНачисления
	|			ИЛИ Сотрудники.Организация <> Сотрудники.ОбособленноеПодразделение)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Сотрудники.ДатаНачала,
	|	ВЫБОР
	|		КОГДА Сотрудники.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДОБАВИТЬКДАТЕ(Сотрудники.ДатаОкончания, ДЕНЬ, 1)
	|		ИНАЧЕ Сотрудники.ДатаОкончания
	|	КОНЕЦ,
	|	Сотрудники.Сотрудник,
	|	Сотрудники.ФизическоеЛицо,
	|	Сотрудники.Организация,
	|	Показатели.Показатель,
	|	Показатели.Значение,
	// 4D:ERP для Беларуси, Алла, 23.02.2026 15:02:01  
	// Актуализация ФОТ в РС "Текущая тарифная ставка сотрудников" при кадровом переводе, №46001
	// {
	|	Показатели.Действие,
	// }
	// 4D
	|	Сотрудники.ОбособленноеПодразделение
	|ИЗ
	|	Документ.КадровыйПеревод.Показатели КАК Показатели
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
	|		ПО Показатели.Ссылка = Сотрудники.Ссылка
	|			И (Показатели.ИдентификаторСтрокиВидаРасчета = 0)
	|			И (Сотрудники.НачисленияУтверждены)
	|			И (Сотрудники.ИзменитьНачисления
	|				ИЛИ Сотрудники.Организация <> Сотрудники.ОбособленноеПодразделение)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Сотрудники.ДатаНачала,
	|	ВЫБОР
	|		КОГДА Сотрудники.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДОБАВИТЬКДАТЕ(Сотрудники.ДатаОкончания, ДЕНЬ, 1)
	|		ИНАЧЕ Сотрудники.ДатаОкончания
	|	КОНЕЦ,
	|	Сотрудники.Сотрудник,
	|	Сотрудники.ФизическоеЛицо,
	|	Сотрудники.Организация,
	|	Показатели.Показатель,
	|	Показатели.Значение,
	|	Льготы.Действие,
	|	Сотрудники.ОбособленноеПодразделение
	|ИЗ
	|	Документ.КадровыйПеревод.Показатели КАК Показатели
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КадровыйПеревод.Льготы КАК Льготы
	|		ПО Показатели.Ссылка = Льготы.Ссылка
	|			И (Показатели.Ссылка = &Ссылка)
	|			И Показатели.ИдентификаторСтрокиВидаРасчета = Льготы.ИдентификаторСтрокиВидаРасчета
	|			И (Льготы.Действие <> ЗНАЧЕНИЕ(Перечисление.ДействияСНачислениямиИУдержаниями.Отменить))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
	|		ПО Показатели.Ссылка = Сотрудники.Ссылка
	|			И (Сотрудники.ИзменитьЛьготы
	|				ИЛИ Сотрудники.Организация <> Сотрудники.ОбособленноеПодразделение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Показатели.ДатаСобытия,
	|	Показатели.ДействуетДо,
	|	Показатели.Сотрудник,
	|	Показатели.ФизическоеЛицо,
	|	Показатели.Организация,
	|	Показатели.Показатель,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Показатели.Организация <> Показатели.ОбособленноеПодразделение
	|				ТОГДА 0
	// 4D:ERP для Беларуси, Алла, 23.02.2026 15:02:01  
	// Актуализация ФОТ в РС "Текущая тарифная ставка сотрудников" при кадровом переводе, №46001
	// {
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Показатели.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСНачислениямиИУдержаниями.Отменить)
	|						ТОГДА 0
	|					ИНАЧЕ Показатели.Значение
	|				КОНЕЦ
	// }
	// 4D
	|		КОНЕЦ) КАК Значение,
	|	NULL КАК Действие
	|ИЗ
	|	ВТПоказатели КАК Показатели
	|
	|СГРУППИРОВАТЬ ПО
	|	Показатели.ДатаСобытия,
	|	Показатели.ДействуетДо,
	|	Показатели.Сотрудник,
	|	Показатели.ФизическоеЛицо,
	|	Показатели.Организация,
	|	Показатели.Показатель
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Показатели.ДатаСобытия,
	|	Показатели.ДействуетДо,
	|	Показатели.Сотрудник,
	|	Показатели.ФизическоеЛицо,
	|	Показатели.ОбособленноеПодразделение,
	|	Показатели.Показатель,
	// 4D:ERP для Беларуси, Алла, 23.02.2026 15:02:01  
	// Актуализация ФОТ в РС "Текущая тарифная ставка сотрудников" при кадровом переводе, №46001
	// {
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Показатели.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСНачислениямиИУдержаниями.Отменить)
	|				ТОГДА 0
	|			ИНАЧЕ Показатели.Значение
	|		КОНЕЦ),
	// }
	// 4D
	|	Показатели.Действие
	|ИЗ
	|	ВТПоказатели КАК Показатели
	|ГДЕ
	|	Показатели.Организация <> Показатели.ОбособленноеПодразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	Показатели.ДатаСобытия,
	|	Показатели.ДействуетДо,
	|	Показатели.Сотрудник,
	|	Показатели.ФизическоеЛицо,
	|	Показатели.ОбособленноеПодразделение,
	|	Показатели.Показатель,
	|	Показатели.Действие";

	Если ТипЗнч(ДокументСсылка) <> Тип("ДокументСсылка.КадровыйПеревод")  Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.КадровыйПеревод", "Документ.КадровыйПереводСписком");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сотрудники.Сотрудник,", "Сотрудники.Сотрудник, Сотрудники.ИдентификаторСтрокиСотрудника,");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сотрудники.Сотрудник КАК Сотрудник,", "Сотрудники.Сотрудник КАК Сотрудник, Сотрудники.ИдентификаторСтрокиСотрудника КАК ИдентификаторСтрокиСотрудника,");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Показатели.Сотрудник,", "Показатели.Сотрудник, Показатели.ИдентификаторСтрокиСотрудника,");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Показатели.Сотрудник КАК Сотрудник,", "Показатели.Сотрудник КАК Сотрудник, Показатели.ИдентификаторСтрокиСотрудника КАК ИдентификаторСтрокиСотрудника,");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПО Начисления.Ссылка = Сотрудники.Ссылка", "ПО Начисления.Ссылка = Сотрудники.Ссылка И Начисления.ИдентификаторСтрокиСотрудника = Сотрудники.ИдентификаторСтрокиСотрудника");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПО Льготы.Ссылка = Сотрудники.Ссылка", "ПО Льготы.Ссылка = Сотрудники.Ссылка И Льготы.ИдентификаторСтрокиСотрудника = Сотрудники.ИдентификаторСтрокиСотрудника");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПО Показатели.Ссылка = Начисления.Ссылка", "ПО Показатели.Ссылка = Начисления.Ссылка И Показатели.ИдентификаторСтрокиСотрудника = Начисления.ИдентификаторСтрокиСотрудника");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПО Показатели.Ссылка = Льготы.Ссылка", "ПО Показатели.Ссылка = Льготы.Ссылка И Показатели.ИдентификаторСтрокиСотрудника = Льготы.ИдентификаторСтрокиСотрудника");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПО Показатели.Ссылка = Сотрудники.Ссылка", "ПО Показатели.Ссылка = Сотрудники.Ссылка И Показатели.ИдентификаторСтрокиСотрудника = Сотрудники.ИдентификаторСтрокиСотрудника");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПО Сотрудники.Ссылка = Показатели.Ссылка", "ПО Сотрудники.Ссылка = Показатели.Ссылка И Сотрудники.ИдентификаторСтрокиСотрудника = Показатели.ИдентификаторСтрокиСотрудника");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПО Показатели.Ссылка = ПоказателиНачислений.Ссылка", "ПО Показатели.Ссылка = ПоказателиНачислений.Ссылка И Показатели.ИдентификаторСтрокиСотрудника = ПоказателиНачислений.ИдентификаторСтрокиСотрудника");
	КонецЕсли;

	// Таблица для формирования значений показателей.
	ЗначенияПоказателей = Запрос.Выполнить().Выгрузить();
	ДанныеДляПроведения.Вставить("ЗначенияПоказателей", ЗначенияПоказателей);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.ДатаНачала КАК ДатаСобытия,
	|	Сотрудники.Сотрудник,
	|	ЕжегодныеОтпуска.ВидЕжегодногоОтпуска,
	|	ВЫБОР
	|		КОГДА ЕжегодныеОтпуска.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСЕжегоднымиОтпусками.Отменить)
	|			ТОГДА 0
	|		ИНАЧЕ ЕжегодныеОтпуска.КоличествоДнейВГод
	|	КОНЕЦ КАК КоличествоДнейВГод
	|ИЗ
	|	Документ.КадровыйПеревод.ЕжегодныеОтпуска КАК ЕжегодныеОтпуска
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
	|		ПО ЕжегодныеОтпуска.Ссылка = Сотрудники.Ссылка
	|			И (Сотрудники.ИзменитьЕжегодныеОтпуска)
	|ГДЕ
	|	ЕжегодныеОтпуска.Ссылка = &Ссылка";

	Если ТипЗнч(ДокументСсылка) <> Тип("ДокументСсылка.КадровыйПеревод")  Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.КадровыйПеревод", "Документ.КадровыйПереводСписком");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПО ЕжегодныеОтпуска.Ссылка = Сотрудники.Ссылка", "ПО ЕжегодныеОтпуска.Ссылка = Сотрудники.Ссылка И ЕжегодныеОтпуска.ИдентификаторСтрокиСотрудника = Сотрудники.ИдентификаторСтрокиСотрудника");

	КонецЕсли;	

	// Таблица для формирования положенных видов ежегодных отпусков.
	ПоложенныеЕжегодныеОтпуска = Запрос.Выполнить().Выгрузить();
	ДанныеДляПроведения.Вставить("ЕжегодныеОтпуска", ПоложенныеЕжегодныеОтпуска);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.ДатаНачала КАК ДатаСобытия,
	|	Сотрудники.Организация КАК Организация,
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Показатели.Показатель КАК Показатель,
	|	ВЫБОР
	|		КОГДА Сотрудники.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДОБАВИТЬКДАТЕ(Сотрудники.ДатаОкончания, ДЕНЬ, 1)
	|		ИНАЧЕ Сотрудники.ДатаОкончания
	|	КОНЕЦ КАК ДействуетДо,
	|	ВЫБОР
	|		КОГДА Показатели.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСНачислениямиИУдержаниями.Отменить)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Применение
	|ИЗ
	|	Документ.КадровыйПеревод.Показатели КАК Показатели
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
	|		ПО Показатели.Ссылка = Сотрудники.Ссылка
	|			И (Сотрудники.НачисленияУтверждены)
	|			И (Сотрудники.ИзменитьНачисления
	|				ИЛИ Сотрудники.ИзменитьЛьготы)
	|ГДЕ
	|	Показатели.Ссылка = &Ссылка
	|	И Показатели.ИдентификаторСтрокиВидаРасчета = 0";

	Если ТипЗнч(ДокументСсылка) <> Тип("ДокументСсылка.КадровыйПеревод")  Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.КадровыйПеревод", "Документ.КадровыйПереводСписком");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПО Показатели.Ссылка = ПоказателиНачислений.Ссылка", "ПО Показатели.Ссылка = ПоказателиНачислений.Ссылка И Показатели.ИдентификаторСтрокиСотрудника = ПоказателиНачислений.ИдентификаторСтрокиСотрудника");
	КонецЕсли;	

	// Таблица для формирования применения дополнительных показателей.
	ПрименениеДополнительныхПоказателей = Запрос.Выполнить().Выгрузить();
	ДанныеДляПроведения.Вставить("ПрименениеДополнительныхПоказателей", ПрименениеДополнительныхПоказателей);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.ДатаНачала КАК ДатаСобытия,
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Сотрудники.ПорядокРасчетаСтоимостиЕдиницыВремени КАК ПорядокРасчета,
	|	ВЫБОР
	|		КОГДА Сотрудники.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДОБАВИТЬКДАТЕ(Сотрудники.ДатаОкончания, ДЕНЬ, 1)
	|		ИНАЧЕ Сотрудники.ДатаОкончания
	|	КОНЕЦ КАК ДействуетДо
	|ИЗ
	|	ВТСотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.НачисленияУтверждены
	|	И (Сотрудники.ИзменитьНачисления
	|			ИЛИ Сотрудники.ИзменитьЛьготы)";

	// Таблица для формирования значений порядка пересчета тарифной ставки.
	ПорядокПересчетаТарифнойСтавки = Запрос.Выполнить().Выгрузить();
	ДанныеДляПроведения.Вставить("ПорядокПересчетаТарифнойСтавки", ПорядокПересчетаТарифнойСтавки);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.ДатаНачала КАК ДатаСобытия,
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Сотрудники.СовокупнаяТарифнаяСтавка КАК Значение,
	|	Сотрудники.ТарифныйОклад КАК ТарифныйОклад,
	|	Сотрудники.ДолжностнойОклад КАК ДолжностнойОклад,
	|	ВЫБОР
	|		КОГДА Сотрудники.СовокупнаяТарифнаяСтавка = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыТарифныхСтавок.ПустаяСсылка)
	|		ИНАЧЕ Сотрудники.ВидТарифнойСтавки
	|	КОНЕЦ КАК ВидТарифнойСтавки,
	|	ВЫБОР
	|		КОГДА Сотрудники.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДОБАВИТЬКДАТЕ(Сотрудники.ДатаОкончания, ДЕНЬ, 1)
	|		ИНАЧЕ Сотрудники.ДатаОкончания
	|	КОНЕЦ КАК ДействуетДо
	|ИЗ
	|	ВТСотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.НачисленияУтверждены
	|	И (Сотрудники.ИзменитьНачисления
	|			ИЛИ Сотрудники.ИзменитьЛьготы)";

	// Таблица для формирования значений совокупной тарифной ставки.
	ДанныеСовокупныхТарифныхСтавок = Запрос.Выполнить().Выгрузить();
	ДанныеДляПроведения.Вставить("ДанныеСовокупныхТарифныхСтавок", ДанныеСовокупныхТарифныхСтавок);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.ДатаНачала КАК ДатаСобытия,
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.РазрядКатегория КАК РазрядКатегория,
	|	ВЫБОР
	|		КОГДА Сотрудники.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДОБАВИТЬКДАТЕ(Сотрудники.ДатаОкончания, ДЕНЬ, 1)
	|		ИНАЧЕ Сотрудники.ДатаОкончания
	|	КОНЕЦ КАК ДействуетДо
	|ИЗ
	|	ВТСотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ИзменитьПодразделениеИДолжность";

	// Таблица для формирования значений разряда сотрудника.
	РазрядыКатегорииСотрудников = Запрос.Выполнить().Выгрузить();
	ДанныеДляПроведения.Вставить("РазрядыКатегорииСотрудников", РазрядыКатегорииСотрудников);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.ДатаНачала КАК ДатаСобытия,
	|	Сотрудники.Сотрудник КАК Сотрудник
	|ИЗ
	|	ВТСотрудники КАК Сотрудники";

	// Таблица для формирования времени регистрации документа.
	СотрудникиДаты = Запрос.Выполнить().Выгрузить();
	ДанныеДляПроведения.Вставить("СотрудникиДаты", СотрудникиДаты);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.ДатаНачала КАК Период,
	|	Сотрудники.ДатаНачала,
	|	Сотрудники.Сотрудник,
	|	Сотрудники.ФизическоеЛицо,
	|	Сотрудники.Организация,
	|	Сотрудники.ДатаЗавершенияТрудовогоДоговора КАК ДатаОкончания,
	|	Сотрудники.ТрудовойДоговорНомер КАК НомерДоговораКонтракта,
	|	Сотрудники.ТрудовойДоговорДата КАК ДатаДоговораКонтракта,
	|	Сотрудники.ВидТрудовогоДоговора КАК ВидТрудовогоДоговора,
	|	Сотрудники.Руководитель КАК ПредставительНанимателя,
	|	Сотрудники.ДолжностьРуководителя КАК ДолжностьПредставителяНанимателя,
	|	Сотрудники.ОснованиеПредставителяНанимателя,
	|	Сотрудники.ВидАктаГосоргана,
	|	Сотрудники.ПоступлениеНаСлужбуВпервые,
	|	Сотрудники.СпособПоступленияНаСлужбу,
	|	Сотрудники.СрочныйДоговор,
	|	Сотрудники.СрокЗаключенияДоговора,
	|	Сотрудники.ОснованиеСрочногоДоговора,
	|	Сотрудники.ОборудованиеРабочегоМеста,
	|	Сотрудники.ИныеУсловияДоговора
	|ИЗ
	|	ВТСотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ИзменитьСведенияОДоговореКонтракте = ИСТИНА";

	// Таблица для формирования описаний договоров сотрудников.
	СведенияОКонтрактахДоговорах = Запрос.Выполнить().Выгрузить();
	ДанныеДляПроведения.Вставить("СведенияОКонтрактахДоговорахСоСменойВидаДоговора", СведенияОКонтрактахДоговорах);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Сотрудники.СменаВидаДоговора
	|				И НЕ Сотрудники.ТрудовойДоговорДата = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Сотрудники.ТрудовойДоговорДата
	|		ИНАЧЕ Сотрудники.ДатаНачала
	|	КОНЕЦ КАК Период,
	|	Сотрудники.ДатаНачала,
	|	Сотрудники.Сотрудник,
	|	Сотрудники.ФизическоеЛицо,
	|	Сотрудники.Организация,
	|	Сотрудники.ДатаЗавершенияТрудовогоДоговора КАК ДатаОкончания,
	|	Сотрудники.ТрудовойДоговорНомер КАК НомерДоговораКонтракта,
	|	Сотрудники.ТрудовойДоговорДата КАК ДатаДоговораКонтракта,
	|	Сотрудники.ВидТрудовогоДоговора КАК ВидТрудовогоДоговора,
	|	Сотрудники.Руководитель КАК ПредставительНанимателя,
	|	Сотрудники.ДолжностьРуководителя КАК ДолжностьПредставителяНанимателя,
	|	Сотрудники.ОснованиеПредставителяНанимателя,
	|	Сотрудники.ВидАктаГосоргана,
	|	Сотрудники.ПоступлениеНаСлужбуВпервые,
	|	Сотрудники.СпособПоступленияНаСлужбу,
	|	Сотрудники.СрочныйДоговор,
	|	Сотрудники.СрокЗаключенияДоговора,
	|	Сотрудники.ОснованиеСрочногоДоговора,
	|	Сотрудники.ОборудованиеРабочегоМеста,
	|	Сотрудники.ИныеУсловияДоговора  
	 #Вставка
	//СЭ Ульяна 0016035
	|   ,
	|	Сотрудники.СЭ_ДатаДопСоглашения КАК СЭ_ДатаДопСоглашения,
	|	Сотрудники.СЭ_НомерДопСоглашения КАК СЭ_НомерДопСоглашения,
	|	Сотрудники.СЭ_ТипДополнительногоСоглашения КАК СЭ_ТипДополнительногоСоглашения
	//СЭ Ульяна 0016035
	#КонецВставки

	|ИЗ
	|	ВТСотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ИзменитьСведенияОДоговореКонтракте = ИСТИНА";

	// Таблица для формирования описаний договоров сотрудников.
	СведенияОКонтрактахДоговорах = Запрос.Выполнить().Выгрузить();
	ДанныеДляПроведения.Вставить("СведенияОКонтрактахДоговорах", СведенияОКонтрактахДоговорах);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.ДатаНачала КАК Период,
	|	Сотрудники.Сотрудник,
	|	ВЫРАЗИТЬ(Сотрудники.Сотрудник КАК Справочник.Сотрудники).ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	Сотрудники.ФизическоеЛицо,
	|	Сотрудники.Территория,
	|	ВЫБОР
	|		КОГДА Сотрудники.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДОБАВИТЬКДАТЕ(Сотрудники.ДатаОкончания, ДЕНЬ, 1)
	|		ИНАЧЕ Сотрудники.ДатаОкончания
	|	КОНЕЦ КАК ДействуетДо
	|ИЗ
	|	ВТСотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ИзменитьПодразделениеИДолжность";

	// Набор сведений для проведения по территориям сотрудников
	СведенияОКонтрактахДоговорах = Запрос.Выполнить().Выгрузить();
	ДанныеДляПроведения.Вставить("ТерриторииСотрудников", СведенияОКонтрактахДоговорах);

	// Данные для регистрации в учета стажа ПФР
	//ДанныеДляРегистрацииВУчете = ДанныеДляРегистрацииВУчетаСтажаПФР(
	//	ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументСсылка), ТипЗнч(ДокументСсылка) <> Тип("ДокументСсылка.КадровыйПеревод"));
	//
	//ДанныеДляПроведения.Вставить("ДанныеДляРегистрацииВУчетаСтажаПФР", ДанныеДляРегистрацииВУчете[ДокументСсылка]);

	// 4D:ERP для Беларуси, Алла, 22.05.2024 15:47:00 
	// Доработка в связи с изменением формы ПУ-3 с 01.01.2024, №38993
	// {
	//Данные для регистрации в учета стажа 
	ДанныеДляРегистрацииВУчете = ДанныеДляРегистрацииВУчетаСтажаФСЗН(
	ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументСсылка), ТипЗнч(ДокументСсылка) <> Тип("ДокументСсылка.КадровыйПеревод"));

	ДанныеДляПроведения.Вставить("ДанныеДляРегистрацииВУчетаСтажаФСЗН", ДанныеДляРегистрацииВУчете[ДокументСсылка]);
	// }
	// 4D

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.Грейды") Тогда 

		Модуль = ОбщегоНазначения.ОбщийМодуль("Грейды");
		Если ТипЗнч(ДокументСсылка) <> Тип("ДокументСсылка.КадровыйПеревод") Тогда
			ДанныеГрейдовСотрудников = Модуль.ДанныеДляПроведенияСписочногоКадровогоПриказа(ДокументСсылка, "КадровыйПереводСписком", "ДатаНачала", "ДатаОкончания");
		Иначе
			ДанныеГрейдовСотрудников = Модуль.ДанныеДляПроведенияГрейдыСотрудников(ДокументСсылка, "ДатаНачала", "ДатаОкончания");
		КонецЕсли;
		ДанныеДляПроведения.Вставить("ДанныеГрейдовСотрудников", ДанныеГрейдовСотрудников);

	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.КадровыйРезерв") Тогда 
		Модуль = ОбщегоНазначения.ОбщийМодуль("КадровыйРезерв");
		ДанныеКадровогоРезерва = Модуль.ДанныеКадровогоПереводаДляКадровогоРезерва(ДокументСсылка);
		ДанныеДляПроведения.Вставить("ДанныеКадровогоРезерва", ДанныеКадровогоРезерва);
	КонецЕсли;

	Возврат ДанныеДляПроведения;

КонецФункции

//&ИзменениеИКонтроль("ДанныеДляПроведения")
//Функция СЭ_ДанныеДляПроведения(ДокументСсылка)

//	ДанныеДляПроведения = Новый Структура; 

//	Запрос = Новый Запрос;
//	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

//	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);

//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	Сотрудники.Ссылка,
//	|	Сотрудники.Ссылка.Организация КАК Организация,
//	|	Сотрудники.Сотрудник,
//	|	Сотрудники.ФизическоеЛицо,
//	|	Сотрудники.ДатаНачала,
//	|	Сотрудники.ДатаОкончания,
//	|	Сотрудники.ОбособленноеПодразделение,
//	|	Сотрудники.ИзменитьПодразделениеИДолжность,
//	|	Сотрудники.ИзменитьГрафикРаботы,
//	|	Сотрудники.ИзменитьНачисления,
//	|	Сотрудники.ИзменитьЕжегодныеОтпуска,
//	|	Сотрудники.ИзменитьАванс,
//	|	Сотрудники.ИзменитьЛьготы,
//	|	Сотрудники.ИзменитьСведенияОДоговореКонтракте,
//	|	Сотрудники.Ссылка.НачисленияУтверждены КАК НачисленияУтверждены,
//	|	Сотрудники.Подразделение,
//	|	Сотрудники.Должность,
//	|	Сотрудники.ДолжностьПоШтатномуРасписанию,
//	|	Сотрудники.ВидЗанятости,
//	|	ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Перемещение) КАК ВидСобытия,
//	|	Сотрудники.КоличествоСтавок,
//	|	Сотрудники.ГрафикРаботы,
//	|	Сотрудники.СпособРасчетаАванса,
//	|	Сотрудники.Аванс,
//	|	Сотрудники.ПричинаПеревода,
//	|	Сотрудники.ОснованиеПеревода,
//	|	Сотрудники.Ссылка.Руководитель КАК Руководитель,
//	|	Сотрудники.Ссылка.ДолжностьРуководителя КАК ДолжностьРуководителя,
//	|	Сотрудники.СпособОтраженияЗарплатыВБухучете,
//	|	Сотрудники.ОтношениеКЕНВД,
//	|	Сотрудники.СтатьяФинансирования,
//	|	Сотрудники.ПорядокРасчетаСтоимостиЕдиницыВремени,
//	|	Сотрудники.СовокупнаяТарифнаяСтавка,
//	|	Сотрудники.ВидТарифнойСтавки,
//	|	Сотрудники.РазрядКатегория,
//	|	Сотрудники.СменаВидаДоговора,
//	|	Сотрудники.Ссылка.ВидДоговора КАК ВидДоговора,
//	|	Сотрудники.ТрудовойДоговорНомер,
//	|	Сотрудники.ТрудовойДоговорДата,
//	|	Сотрудники.ВидТрудовогоДоговора,
//	|	Сотрудники.СрочныйДоговор,
//	|	Сотрудники.ДатаЗавершенияТрудовогоДоговора,
//	|	Сотрудники.ОснованиеСрочногоДоговора,
//	|	Сотрудники.СрокЗаключенияДоговора,
//	|	Сотрудники.Ссылка.ОснованиеПредставителяНанимателя КАК ОснованиеПредставителяНанимателя,
//	|	Сотрудники.СпособПоступленияНаСлужбу,
//	|	Сотрудники.ПоступлениеНаСлужбуВпервые,
//	|	Сотрудники.ВидАктаГосоргана,
//	|	Сотрудники.ОборудованиеРабочегоМеста,
//	|	Сотрудники.ИныеУсловияДоговора,
//	|	Сотрудники.Грейд,  
//	#Вставка
//	//СЭ Ульяна 0016035
//	|	Сотрудники.СЭ_ДатаДопСоглашения КАК СЭ_ДатаДопСоглашения,
//	|	Сотрудники.СЭ_НомерДопСоглашения КАК СЭ_НомерДопСоглашения,
//	|	Сотрудники.СЭ_ТипДополнительногоСоглашения КАК СЭ_ТипДополнительногоСоглашения,
//	//СЭ Ульяна 0016035
//	#КонецВставки
//	|	Сотрудники.НаПериодПереводаСохранятьЛьготныйСтажПФР,
//	|	Сотрудники.ВидСтажаПФР,
//	|	Сотрудники.Территория,
//	|	Сотрудники.ТарифныйОклад,
//	|	Сотрудники.ДолжностнойОклад,
//	// 4D:ERP для Беларуси, Алла, 11.01.2025 20:15:41 
//	// Формирование пачки ПУ-2, №42417
//	// {
//	|	Сотрудники.Ссылка.НеВключатьВПУ2 КАК НеВключатьВПУ2
//	// }
//	// 4D
//	|ПОМЕСТИТЬ ВТСотрудники
//	|ИЗ
//	|	Документ.КадровыйПеревод КАК Сотрудники
//	|ГДЕ
//	|	Сотрудники.Ссылка = &Ссылка";

//	Если ТипЗнч(ДокументСсылка) <> Тип("ДокументСсылка.КадровыйПеревод")  Тогда
//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.КадровыйПеревод", "Документ.КадровыйПереводСписком.Сотрудники");
//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сотрудники.Сотрудник,",
//		"Сотрудники.Сотрудник КАК Сотрудник, Сотрудники.ИдентификаторСтрокиСотрудника КАК ИдентификаторСтрокиСотрудника,");

//	КонецЕсли;

//	Запрос.Выполнить();

//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	Сотрудники.ДатаНачала КАК ДатаСобытия,
//	|	ВЫБОР
//	|		КОГДА Сотрудники.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ДОБАВИТЬКДАТЕ(Сотрудники.ДатаОкончания, ДЕНЬ, 1)
//	|		ИНАЧЕ Сотрудники.ДатаОкончания
//	|	КОНЕЦ КАК ДействуетДо,
//	|	Сотрудники.Сотрудник,
//	|	Сотрудники.Аванс,
//	|	Сотрудники.ДолжностьПоШтатномуРасписанию КАК Позиция,
//	|	Сотрудники.Подразделение,
//	|	Сотрудники.Должность,
//	|	Сотрудники.КоличествоСтавок,
//	|	Сотрудники.ВидСобытия,
//	|	Сотрудники.ГрафикРаботы,
//	|	Сотрудники.СпособРасчетаАванса,
//	|	Сотрудники.ВидЗанятости,
//	|	Сотрудники.ВидДоговора,
//	|	Сотрудники.ФизическоеЛицо,
//	// 4D:ERP для Беларуси, Алла, 11.01.2025 20:15:41 
//	// Формирование пачки ПУ-2, №42417
//	// {
//	|	Сотрудники.НеВключатьВПУ2
//	// }
//	// 4D
//	|ИЗ
//	|	ВТСотрудники КАК Сотрудники
//	|ГДЕ
//	|	Сотрудники.ИзменитьПодразделениеИДолжность";

//	// Таблица для формирования кадровых движений.
//	КадровыеДвижения = Запрос.Выполнить().Выгрузить();
//	ДанныеДляПроведения.Вставить("КадровыеДвижения", КадровыеДвижения);

//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	Сотрудники.ДатаНачала КАК ДатаСобытия,
//	|	ВЫБОР
//	|		КОГДА Сотрудники.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ДОБАВИТЬКДАТЕ(Сотрудники.ДатаОкончания, ДЕНЬ, 1)
//	|		ИНАЧЕ Сотрудники.ДатаОкончания
//	|	КОНЕЦ КАК ДействуетДо,
//	|	Сотрудники.Сотрудник,
//	|	Сотрудники.ГрафикРаботы,
//	|	Сотрудники.ВидСобытия
//	|ИЗ
//	|	ВТСотрудники КАК Сотрудники
//	|ГДЕ
//	|	Сотрудники.ИзменитьГрафикРаботы";

//	//Таблица для формирования истории графиков.
//	ГрафикРаботыСотрудников = Запрос.Выполнить().Выгрузить();
//	ДанныеДляПроведения.Вставить("ГрафикРаботыСотрудников", ГрафикРаботыСотрудников);

//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	Сотрудники.ДатаНачала КАК ДатаСобытия,
//	|	ВЫБОР
//	|		КОГДА Сотрудники.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ДОБАВИТЬКДАТЕ(Сотрудники.ДатаОкончания, ДЕНЬ, 1)
//	|		ИНАЧЕ Сотрудники.ДатаОкончания
//	|	КОНЕЦ КАК ДействуетДо,
//	|	Сотрудники.Сотрудник,
//	|	Сотрудники.ВидСобытия,
//	|	Сотрудники.Аванс,
//	|	Сотрудники.СпособРасчетаАванса, 
//	| 	ВЫРАЗИТЬ(Сотрудники.Сотрудник КАК Справочник.Сотрудники).ГоловнаяОрганизация КАК ГоловнаяОрганизация,
//	|	Сотрудники.ФизическоеЛицо
//	|ИЗ
//	|	ВТСотрудники КАК Сотрудники
//	|ГДЕ
//	|	Сотрудники.ИзменитьАванс
//	|	И Сотрудники.НачисленияУтверждены";

//	// Таблица для формирования движений авансов.
//	ПлановыеВыплаты = Запрос.Выполнить().Выгрузить();
//	ДанныеДляПроведения.Вставить("ПлановыеВыплаты", ПлановыеВыплаты);

//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	Сотрудники.ДатаНачала КАК ДатаСобытия,
//	|	ВЫБОР
//	|		КОГДА Сотрудники.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ДОБАВИТЬКДАТЕ(Сотрудники.ДатаОкончания, ДЕНЬ, 1)
//	|		ИНАЧЕ Сотрудники.ДатаОкончания
//	|	КОНЕЦ КАК ДействуетДо,
//	|	Сотрудники.Сотрудник КАК Сотрудник,
//	|	Начисления.Начисление,
//	|	ВЫБОР
//	|		КОГДА Начисления.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСНачислениямиИУдержаниями.Отменить)
//	|			ТОГДА ЛОЖЬ
//	|		ИНАЧЕ ИСТИНА
//	|	КОНЕЦ КАК Используется,
//	|	Начисления.Размер,
//	|	Сотрудники.ФизическоеЛицо
//	|ИЗ
//	|	Документ.КадровыйПеревод.Начисления КАК Начисления
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
//	|		ПО Начисления.Ссылка = Сотрудники.Ссылка
//	|			И (Сотрудники.ИзменитьНачисления)
//	|ГДЕ
//	|	Начисления.Ссылка = &Ссылка
//	|	И Начисления.Ссылка.НачисленияУтверждены
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	Сотрудники.ДатаНачала,
//	|	ВЫБОР
//	|		КОГДА Сотрудники.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ДОБАВИТЬКДАТЕ(Сотрудники.ДатаОкончания, ДЕНЬ, 1)
//	|		ИНАЧЕ Сотрудники.ДатаОкончания
//	|	КОНЕЦ,
//	|	Сотрудники.Сотрудник,
//	|	Льготы.Льгота,
//	|	ВЫБОР
//	|		КОГДА Льготы.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСНачислениямиИУдержаниями.Отменить)
//	|			ТОГДА ЛОЖЬ
//	|		ИНАЧЕ ИСТИНА
//	|	КОНЕЦ,
//	|	Льготы.Размер,
//	|	Сотрудники.ФизическоеЛицо
//	|ИЗ
//	|	Документ.КадровыйПеревод.Льготы КАК Льготы
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
//	|		ПО Льготы.Ссылка = Сотрудники.Ссылка
//	|			И (Сотрудники.ИзменитьЛьготы)
//	|ГДЕ
//	|	Льготы.Ссылка = &Ссылка";

//	Если ТипЗнч(ДокументСсылка) <> Тип("ДокументСсылка.КадровыйПеревод")  Тогда
//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.КадровыйПеревод", "Документ.КадровыйПереводСписком");
//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПО Начисления.Ссылка = Сотрудники.Ссылка", "ПО Начисления.Ссылка = Сотрудники.Ссылка И Начисления.ИдентификаторСтрокиСотрудника = Сотрудники.ИдентификаторСтрокиСотрудника");
//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Начисления.НомерСтроки <> КадровыйПереводНачисленияНеОтмененные.НомерСтроки", "И Начисления.НомерСтроки <> КадровыйПереводНачисленияНеОтмененные.НомерСтроки И Начисления.ИдентификаторСтрокиСотрудника = КадровыйПереводНачисленияНеОтмененные.ИдентификаторСтрокиСотрудника");
//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПО Льготы.Ссылка = Сотрудники.Ссылка", "ПО Льготы.Ссылка = Сотрудники.Ссылка И Льготы.ИдентификаторСтрокиСотрудника = Сотрудники.ИдентификаторСтрокиСотрудника");
//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Льготы.НомерСтроки <> КадровыйПереводЛьготыНеОтмененные.НомерСтроки", "И Льготы.НомерСтроки <> КадровыйПереводЛьготыНеОтмененные.НомерСтроки И Льготы.ИдентификаторСтрокиСотрудника = КадровыйПереводЛьготыНеОтмененные.ИдентификаторСтрокиСотрудника");
//	КонецЕсли;

//	// Таблица для формирования плановых начислений.
//	ПлановыеНачисления = Запрос.Выполнить().Выгрузить();
//	ДанныеДляПроведения.Вставить("ПлановыеНачисления", ПлановыеНачисления);

//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	Сотрудники.ДатаНачала КАК ДатаСобытия,
//	|	ВЫБОР
//	|		КОГДА Сотрудники.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ДОБАВИТЬКДАТЕ(Сотрудники.ДатаОкончания, ДЕНЬ, 1)
//	|		ИНАЧЕ Сотрудники.ДатаОкончания
//	|	КОНЕЦ КАК ДействуетДо,
//	|	Сотрудники.Сотрудник КАК Сотрудник,
//	|	Сотрудники.ФизическоеЛицо,
//	|	Сотрудники.Организация,
//	|	Показатели.Показатель,
//	|	Показатели.Значение,
//	|	Начисления.Действие,
//	|	Сотрудники.ОбособленноеПодразделение
//	|ПОМЕСТИТЬ ВТПоказатели
//	|ИЗ
//	|	ВТСотрудники КАК Сотрудники
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КадровыйПеревод.Показатели КАК Показатели
//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КадровыйПеревод.Начисления КАК Начисления
//	|			ПО Показатели.Ссылка = Начисления.Ссылка
//	|				И Показатели.ИдентификаторСтрокиВидаРасчета = Начисления.ИдентификаторСтрокиВидаРасчета
//	|				И (Начисления.Действие <> ЗНАЧЕНИЕ(Перечисление.ДействияСНачислениямиИУдержаниями.Отменить))
//	|		ПО Сотрудники.Ссылка = Показатели.Ссылка
//	|ГДЕ
//	|	Сотрудники.Ссылка = &Ссылка
//	|	И Сотрудники.НачисленияУтверждены
//	|	И (Сотрудники.ИзменитьНачисления
//	|			ИЛИ Сотрудники.Организация <> Сотрудники.ОбособленноеПодразделение)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	Сотрудники.ДатаНачала,
//	|	ВЫБОР
//	|		КОГДА Сотрудники.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ДОБАВИТЬКДАТЕ(Сотрудники.ДатаОкончания, ДЕНЬ, 1)
//	|		ИНАЧЕ Сотрудники.ДатаОкончания
//	|	КОНЕЦ,
//	|	Сотрудники.Сотрудник,
//	|	Сотрудники.ФизическоеЛицо,
//	|	Сотрудники.Организация,
//	|	Показатели.Показатель,
//	|	Показатели.Значение,
//	|	ЗНАЧЕНИЕ(Перечисление.ДействияСНачислениямиИУдержаниями.ПустаяСсылка),
//	|	Сотрудники.ОбособленноеПодразделение
//	|ИЗ
//	|	Документ.КадровыйПеревод.Показатели КАК Показатели
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
//	|		ПО Показатели.Ссылка = Сотрудники.Ссылка
//	|			И (Показатели.ИдентификаторСтрокиВидаРасчета = 0)
//	|			И (Сотрудники.НачисленияУтверждены)
//	|			И (Сотрудники.ИзменитьНачисления
//	|				ИЛИ Сотрудники.Организация <> Сотрудники.ОбособленноеПодразделение)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	Сотрудники.ДатаНачала,
//	|	ВЫБОР
//	|		КОГДА Сотрудники.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ДОБАВИТЬКДАТЕ(Сотрудники.ДатаОкончания, ДЕНЬ, 1)
//	|		ИНАЧЕ Сотрудники.ДатаОкончания
//	|	КОНЕЦ,
//	|	Сотрудники.Сотрудник,
//	|	Сотрудники.ФизическоеЛицо,
//	|	Сотрудники.Организация,
//	|	Показатели.Показатель,
//	|	Показатели.Значение,
//	|	Льготы.Действие,
//	|	Сотрудники.ОбособленноеПодразделение
//	|ИЗ
//	|	Документ.КадровыйПеревод.Показатели КАК Показатели
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КадровыйПеревод.Льготы КАК Льготы
//	|		ПО Показатели.Ссылка = Льготы.Ссылка
//	|			И (Показатели.Ссылка = &Ссылка)
//	|			И Показатели.ИдентификаторСтрокиВидаРасчета = Льготы.ИдентификаторСтрокиВидаРасчета
//	|			И (Льготы.Действие <> ЗНАЧЕНИЕ(Перечисление.ДействияСНачислениямиИУдержаниями.Отменить))
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
//	|		ПО Показатели.Ссылка = Сотрудники.Ссылка
//	|			И (Сотрудники.ИзменитьЛьготы
//	|				ИЛИ Сотрудники.Организация <> Сотрудники.ОбособленноеПодразделение)
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	Показатели.ДатаСобытия,
//	|	Показатели.ДействуетДо,
//	|	Показатели.Сотрудник,
//	|	Показатели.ФизическоеЛицо,
//	|	Показатели.Организация,
//	|	Показатели.Показатель,
//	|	МАКСИМУМ(ВЫБОР
//	|			КОГДА Показатели.Организация <> Показатели.ОбособленноеПодразделение
//	|				ТОГДА 0
//	|			ИНАЧЕ Показатели.Значение
//	|		КОНЕЦ) КАК Значение,
//	|	NULL КАК Действие
//	|ИЗ
//	|	ВТПоказатели КАК Показатели
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	Показатели.ДатаСобытия,
//	|	Показатели.ДействуетДо,
//	|	Показатели.Сотрудник,
//	|	Показатели.ФизическоеЛицо,
//	|	Показатели.Организация,
//	|	Показатели.Показатель
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	Показатели.ДатаСобытия,
//	|	Показатели.ДействуетДо,
//	|	Показатели.Сотрудник,
//	|	Показатели.ФизическоеЛицо,
//	|	Показатели.ОбособленноеПодразделение,
//	|	Показатели.Показатель,
//	|	МАКСИМУМ(Показатели.Значение),
//	|	Показатели.Действие
//	|ИЗ
//	|	ВТПоказатели КАК Показатели
//	|ГДЕ
//	|	Показатели.Организация <> Показатели.ОбособленноеПодразделение
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	Показатели.ДатаСобытия,
//	|	Показатели.ДействуетДо,
//	|	Показатели.Сотрудник,
//	|	Показатели.ФизическоеЛицо,
//	|	Показатели.ОбособленноеПодразделение,
//	|	Показатели.Показатель,
//	|	Показатели.Действие";

//	Если ТипЗнч(ДокументСсылка) <> Тип("ДокументСсылка.КадровыйПеревод")  Тогда
//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.КадровыйПеревод", "Документ.КадровыйПереводСписком");
//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сотрудники.Сотрудник,", "Сотрудники.Сотрудник, Сотрудники.ИдентификаторСтрокиСотрудника,");
//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сотрудники.Сотрудник КАК Сотрудник,", "Сотрудники.Сотрудник КАК Сотрудник, Сотрудники.ИдентификаторСтрокиСотрудника КАК ИдентификаторСтрокиСотрудника,");
//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Показатели.Сотрудник,", "Показатели.Сотрудник, Показатели.ИдентификаторСтрокиСотрудника,");
//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Показатели.Сотрудник КАК Сотрудник,", "Показатели.Сотрудник КАК Сотрудник, Показатели.ИдентификаторСтрокиСотрудника КАК ИдентификаторСтрокиСотрудника,");
//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПО Начисления.Ссылка = Сотрудники.Ссылка", "ПО Начисления.Ссылка = Сотрудники.Ссылка И Начисления.ИдентификаторСтрокиСотрудника = Сотрудники.ИдентификаторСтрокиСотрудника");
//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПО Льготы.Ссылка = Сотрудники.Ссылка", "ПО Льготы.Ссылка = Сотрудники.Ссылка И Льготы.ИдентификаторСтрокиСотрудника = Сотрудники.ИдентификаторСтрокиСотрудника");
//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПО Показатели.Ссылка = Начисления.Ссылка", "ПО Показатели.Ссылка = Начисления.Ссылка И Показатели.ИдентификаторСтрокиСотрудника = Начисления.ИдентификаторСтрокиСотрудника");
//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПО Показатели.Ссылка = Льготы.Ссылка", "ПО Показатели.Ссылка = Льготы.Ссылка И Показатели.ИдентификаторСтрокиСотрудника = Льготы.ИдентификаторСтрокиСотрудника");
//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПО Показатели.Ссылка = Сотрудники.Ссылка", "ПО Показатели.Ссылка = Сотрудники.Ссылка И Показатели.ИдентификаторСтрокиСотрудника = Сотрудники.ИдентификаторСтрокиСотрудника");
//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПО Сотрудники.Ссылка = Показатели.Ссылка", "ПО Сотрудники.Ссылка = Показатели.Ссылка И Сотрудники.ИдентификаторСтрокиСотрудника = Показатели.ИдентификаторСтрокиСотрудника");
//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПО Показатели.Ссылка = ПоказателиНачислений.Ссылка", "ПО Показатели.Ссылка = ПоказателиНачислений.Ссылка И Показатели.ИдентификаторСтрокиСотрудника = ПоказателиНачислений.ИдентификаторСтрокиСотрудника");
//	КонецЕсли;

//	// Таблица для формирования значений показателей.
//	ЗначенияПоказателей = Запрос.Выполнить().Выгрузить();
//	ДанныеДляПроведения.Вставить("ЗначенияПоказателей", ЗначенияПоказателей);

//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	Сотрудники.ДатаНачала КАК ДатаСобытия,
//	|	Сотрудники.Сотрудник,
//	|	ЕжегодныеОтпуска.ВидЕжегодногоОтпуска,
//	|	ВЫБОР
//	|		КОГДА ЕжегодныеОтпуска.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСЕжегоднымиОтпусками.Отменить)
//	|			ТОГДА 0
//	|		ИНАЧЕ ЕжегодныеОтпуска.КоличествоДнейВГод
//	|	КОНЕЦ КАК КоличествоДнейВГод
//	|ИЗ
//	|	Документ.КадровыйПеревод.ЕжегодныеОтпуска КАК ЕжегодныеОтпуска
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
//	|		ПО ЕжегодныеОтпуска.Ссылка = Сотрудники.Ссылка
//	|			И (Сотрудники.ИзменитьЕжегодныеОтпуска)
//	|ГДЕ
//	|	ЕжегодныеОтпуска.Ссылка = &Ссылка";

//	Если ТипЗнч(ДокументСсылка) <> Тип("ДокументСсылка.КадровыйПеревод")  Тогда
//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.КадровыйПеревод", "Документ.КадровыйПереводСписком");
//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПО ЕжегодныеОтпуска.Ссылка = Сотрудники.Ссылка", "ПО ЕжегодныеОтпуска.Ссылка = Сотрудники.Ссылка И ЕжегодныеОтпуска.ИдентификаторСтрокиСотрудника = Сотрудники.ИдентификаторСтрокиСотрудника");

//	КонецЕсли;	

//	// Таблица для формирования положенных видов ежегодных отпусков.
//	ПоложенныеЕжегодныеОтпуска = Запрос.Выполнить().Выгрузить();
//	ДанныеДляПроведения.Вставить("ЕжегодныеОтпуска", ПоложенныеЕжегодныеОтпуска);

//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	Сотрудники.ДатаНачала КАК ДатаСобытия,
//	|	Сотрудники.Организация КАК Организация,
//	|	Сотрудники.Сотрудник КАК Сотрудник,
//	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
//	|	Показатели.Показатель КАК Показатель,
//	|	ВЫБОР
//	|		КОГДА Сотрудники.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ДОБАВИТЬКДАТЕ(Сотрудники.ДатаОкончания, ДЕНЬ, 1)
//	|		ИНАЧЕ Сотрудники.ДатаОкончания
//	|	КОНЕЦ КАК ДействуетДо,
//	|	ВЫБОР
//	|		КОГДА Показатели.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСНачислениямиИУдержаниями.Отменить)
//	|			ТОГДА ЛОЖЬ
//	|		ИНАЧЕ ИСТИНА
//	|	КОНЕЦ КАК Применение
//	|ИЗ
//	|	Документ.КадровыйПеревод.Показатели КАК Показатели
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
//	|		ПО Показатели.Ссылка = Сотрудники.Ссылка
//	|			И (Сотрудники.НачисленияУтверждены)
//	|			И (Сотрудники.ИзменитьНачисления
//	|				ИЛИ Сотрудники.ИзменитьЛьготы)
//	|ГДЕ
//	|	Показатели.Ссылка = &Ссылка
//	|	И Показатели.ИдентификаторСтрокиВидаРасчета = 0";

//	Если ТипЗнч(ДокументСсылка) <> Тип("ДокументСсылка.КадровыйПеревод")  Тогда
//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.КадровыйПеревод", "Документ.КадровыйПереводСписком");
//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПО Показатели.Ссылка = ПоказателиНачислений.Ссылка", "ПО Показатели.Ссылка = ПоказателиНачислений.Ссылка И Показатели.ИдентификаторСтрокиСотрудника = ПоказателиНачислений.ИдентификаторСтрокиСотрудника");
//	КонецЕсли;	

//	// Таблица для формирования применения дополнительных показателей.
//	ПрименениеДополнительныхПоказателей = Запрос.Выполнить().Выгрузить();
//	ДанныеДляПроведения.Вставить("ПрименениеДополнительныхПоказателей", ПрименениеДополнительныхПоказателей);

//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	Сотрудники.ДатаНачала КАК ДатаСобытия,
//	|	Сотрудники.Сотрудник КАК Сотрудник,
//	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
//	|	Сотрудники.ПорядокРасчетаСтоимостиЕдиницыВремени КАК ПорядокРасчета,
//	|	ВЫБОР
//	|		КОГДА Сотрудники.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ДОБАВИТЬКДАТЕ(Сотрудники.ДатаОкончания, ДЕНЬ, 1)
//	|		ИНАЧЕ Сотрудники.ДатаОкончания
//	|	КОНЕЦ КАК ДействуетДо
//	|ИЗ
//	|	ВТСотрудники КАК Сотрудники
//	|ГДЕ
//	|	Сотрудники.НачисленияУтверждены
//	|	И (Сотрудники.ИзменитьНачисления
//	|			ИЛИ Сотрудники.ИзменитьЛьготы)";

//	// Таблица для формирования значений порядка пересчета тарифной ставки.
//	ПорядокПересчетаТарифнойСтавки = Запрос.Выполнить().Выгрузить();
//	ДанныеДляПроведения.Вставить("ПорядокПересчетаТарифнойСтавки", ПорядокПересчетаТарифнойСтавки);

//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	Сотрудники.ДатаНачала КАК ДатаСобытия,
//	|	Сотрудники.Сотрудник КАК Сотрудник,
//	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
//	|	Сотрудники.СовокупнаяТарифнаяСтавка КАК Значение,
//	|	Сотрудники.ТарифныйОклад КАК ТарифныйОклад,
//	|	Сотрудники.ДолжностнойОклад КАК ДолжностнойОклад,
//	|	ВЫБОР
//	|		КОГДА Сотрудники.СовокупнаяТарифнаяСтавка = 0
//	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыТарифныхСтавок.ПустаяСсылка)
//	|		ИНАЧЕ Сотрудники.ВидТарифнойСтавки
//	|	КОНЕЦ КАК ВидТарифнойСтавки,
//	|	ВЫБОР
//	|		КОГДА Сотрудники.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ДОБАВИТЬКДАТЕ(Сотрудники.ДатаОкончания, ДЕНЬ, 1)
//	|		ИНАЧЕ Сотрудники.ДатаОкончания
//	|	КОНЕЦ КАК ДействуетДо
//	|ИЗ
//	|	ВТСотрудники КАК Сотрудники
//	|ГДЕ
//	|	Сотрудники.НачисленияУтверждены
//	|	И (Сотрудники.ИзменитьНачисления
//	|			ИЛИ Сотрудники.ИзменитьЛьготы)";

//	// Таблица для формирования значений совокупной тарифной ставки.
//	ДанныеСовокупныхТарифныхСтавок = Запрос.Выполнить().Выгрузить();
//	ДанныеДляПроведения.Вставить("ДанныеСовокупныхТарифныхСтавок", ДанныеСовокупныхТарифныхСтавок);

//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	Сотрудники.ДатаНачала КАК ДатаСобытия,
//	|	Сотрудники.Сотрудник КАК Сотрудник,
//	|	Сотрудники.РазрядКатегория КАК РазрядКатегория,
//	|	ВЫБОР
//	|		КОГДА Сотрудники.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ДОБАВИТЬКДАТЕ(Сотрудники.ДатаОкончания, ДЕНЬ, 1)
//	|		ИНАЧЕ Сотрудники.ДатаОкончания
//	|	КОНЕЦ КАК ДействуетДо
//	|ИЗ
//	|	ВТСотрудники КАК Сотрудники
//	|ГДЕ
//	|	Сотрудники.ИзменитьПодразделениеИДолжность";

//	// Таблица для формирования значений разряда сотрудника.
//	РазрядыКатегорииСотрудников = Запрос.Выполнить().Выгрузить();
//	ДанныеДляПроведения.Вставить("РазрядыКатегорииСотрудников", РазрядыКатегорииСотрудников);

//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	Сотрудники.ДатаНачала КАК ДатаСобытия,
//	|	Сотрудники.Сотрудник КАК Сотрудник
//	|ИЗ
//	|	ВТСотрудники КАК Сотрудники";

//	// Таблица для формирования времени регистрации документа.
//	СотрудникиДаты = Запрос.Выполнить().Выгрузить();
//	ДанныеДляПроведения.Вставить("СотрудникиДаты", СотрудникиДаты);

//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	Сотрудники.ДатаНачала КАК Период,
//	|	Сотрудники.ДатаНачала,
//	|	Сотрудники.Сотрудник,
//	|	Сотрудники.ФизическоеЛицо,
//	|	Сотрудники.Организация,
//	|	Сотрудники.ДатаЗавершенияТрудовогоДоговора КАК ДатаОкончания,
//	|	Сотрудники.ТрудовойДоговорНомер КАК НомерДоговораКонтракта,
//	|	Сотрудники.ТрудовойДоговорДата КАК ДатаДоговораКонтракта,
//	|	Сотрудники.ВидТрудовогоДоговора КАК ВидТрудовогоДоговора,
//	|	Сотрудники.Руководитель КАК ПредставительНанимателя,
//	|	Сотрудники.ДолжностьРуководителя КАК ДолжностьПредставителяНанимателя,
//	|	Сотрудники.ОснованиеПредставителяНанимателя,
//	|	Сотрудники.ВидАктаГосоргана,
//	|	Сотрудники.ПоступлениеНаСлужбуВпервые,
//	|	Сотрудники.СпособПоступленияНаСлужбу,
//	|	Сотрудники.СрочныйДоговор,
//	|	Сотрудники.СрокЗаключенияДоговора,
//	|	Сотрудники.ОснованиеСрочногоДоговора,
//	|	Сотрудники.ОборудованиеРабочегоМеста,
//	|	Сотрудники.ИныеУсловияДоговора
//	|ИЗ
//	|	ВТСотрудники КАК Сотрудники
//	|ГДЕ
//	|	Сотрудники.ИзменитьСведенияОДоговореКонтракте = ИСТИНА";

//	// Таблица для формирования описаний договоров сотрудников.
//	СведенияОКонтрактахДоговорах = Запрос.Выполнить().Выгрузить();
//	ДанныеДляПроведения.Вставить("СведенияОКонтрактахДоговорахСоСменойВидаДоговора", СведенияОКонтрактахДоговорах);

//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	ВЫБОР
//	|		КОГДА Сотрудники.СменаВидаДоговора
//	|				И НЕ Сотрудники.ТрудовойДоговорДата = ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА Сотрудники.ТрудовойДоговорДата
//	|		ИНАЧЕ Сотрудники.ДатаНачала
//	|	КОНЕЦ КАК Период,
//	|	Сотрудники.ДатаНачала,
//	|	Сотрудники.Сотрудник,
//	|	Сотрудники.ФизическоеЛицо,
//	|	Сотрудники.Организация,
//	|	Сотрудники.ДатаЗавершенияТрудовогоДоговора КАК ДатаОкончания,
//	|	Сотрудники.ТрудовойДоговорНомер КАК НомерДоговораКонтракта,
//	|	Сотрудники.ТрудовойДоговорДата КАК ДатаДоговораКонтракта,
//	|	Сотрудники.ВидТрудовогоДоговора КАК ВидТрудовогоДоговора,
//	|	Сотрудники.Руководитель КАК ПредставительНанимателя,
//	|	Сотрудники.ДолжностьРуководителя КАК ДолжностьПредставителяНанимателя,
//	|	Сотрудники.ОснованиеПредставителяНанимателя,
//	|	Сотрудники.ВидАктаГосоргана,
//	|	Сотрудники.ПоступлениеНаСлужбуВпервые,
//	|	Сотрудники.СпособПоступленияНаСлужбу,
//	|	Сотрудники.СрочныйДоговор,
//	|	Сотрудники.СрокЗаключенияДоговора,
//	|	Сотрудники.ОснованиеСрочногоДоговора,
//	|	Сотрудники.ОборудованиеРабочегоМеста,
//	|	Сотрудники.ИныеУсловияДоговора 
//	#Вставка
//	//СЭ Ульяна 0016035
//	|   ,
//	|	Сотрудники.СЭ_ДатаДопСоглашения КАК СЭ_ДатаДопСоглашения,
//	|	Сотрудники.СЭ_НомерДопСоглашения КАК СЭ_НомерДопСоглашения,
//	|	Сотрудники.СЭ_ТипДополнительногоСоглашения КАК СЭ_ТипДополнительногоСоглашения
//	//СЭ Ульяна 0016035
//	#КонецВставки
//	|ИЗ
//	|	ВТСотрудники КАК Сотрудники
//	|ГДЕ
//	|	Сотрудники.ИзменитьСведенияОДоговореКонтракте = ИСТИНА";

//	// Таблица для формирования описаний договоров сотрудников.
//	СведенияОКонтрактахДоговорах = Запрос.Выполнить().Выгрузить();
//	ДанныеДляПроведения.Вставить("СведенияОКонтрактахДоговорах", СведенияОКонтрактахДоговорах);

//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	Сотрудники.ДатаНачала КАК Период,
//	|	Сотрудники.Сотрудник,
//	|	ВЫРАЗИТЬ(Сотрудники.Сотрудник КАК Справочник.Сотрудники).ГоловнаяОрганизация КАК ГоловнаяОрганизация,
//	|	Сотрудники.ФизическоеЛицо,
//	|	Сотрудники.Территория,
//	|	ВЫБОР
//	|		КОГДА Сотрудники.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ДОБАВИТЬКДАТЕ(Сотрудники.ДатаОкончания, ДЕНЬ, 1)
//	|		ИНАЧЕ Сотрудники.ДатаОкончания
//	|	КОНЕЦ КАК ДействуетДо
//	|ИЗ
//	|	ВТСотрудники КАК Сотрудники
//	|ГДЕ
//	|	Сотрудники.ИзменитьПодразделениеИДолжность";

//	// Набор сведений для проведения по территориям сотрудников
//	СведенияОКонтрактахДоговорах = Запрос.Выполнить().Выгрузить();
//	ДанныеДляПроведения.Вставить("ТерриторииСотрудников", СведенияОКонтрактахДоговорах);

//	// Данные для регистрации в учета стажа ПФР
//	//ДанныеДляРегистрацииВУчете = ДанныеДляРегистрацииВУчетаСтажаПФР(
//	//	ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументСсылка), ТипЗнч(ДокументСсылка) <> Тип("ДокументСсылка.КадровыйПеревод"));
//	//
//	//ДанныеДляПроведения.Вставить("ДанныеДляРегистрацииВУчетаСтажаПФР", ДанныеДляРегистрацииВУчете[ДокументСсылка]);

//	// 4D:ERP для Беларуси, Алла, 22.05.2024 15:47:00 
//	// Доработка в связи с изменением формы ПУ-3 с 01.01.2024, №38993
//	// {
//	//Данные для регистрации в учета стажа 
//	ДанныеДляРегистрацииВУчете = ДанныеДляРегистрацииВУчетаСтажаФСЗН(
//	ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументСсылка), ТипЗнч(ДокументСсылка) <> Тип("ДокументСсылка.КадровыйПеревод"));

//	ДанныеДляПроведения.Вставить("ДанныеДляРегистрацииВУчетаСтажаФСЗН", ДанныеДляРегистрацииВУчете[ДокументСсылка]);
//	// }
//	// 4D

//	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.Грейды") Тогда 

//		Модуль = ОбщегоНазначения.ОбщийМодуль("Грейды");
//		Если ТипЗнч(ДокументСсылка) <> Тип("ДокументСсылка.КадровыйПеревод") Тогда
//			ДанныеГрейдовСотрудников = Модуль.ДанныеДляПроведенияСписочногоКадровогоПриказа(ДокументСсылка, "КадровыйПереводСписком", "ДатаНачала", "ДатаОкончания");
//		Иначе
//			ДанныеГрейдовСотрудников = Модуль.ДанныеДляПроведенияГрейдыСотрудников(ДокументСсылка, "ДатаНачала", "ДатаОкончания");
//		КонецЕсли;
//		ДанныеДляПроведения.Вставить("ДанныеГрейдовСотрудников", ДанныеГрейдовСотрудников);

//	КонецЕсли;

//	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.КадровыйРезерв") Тогда 
//		Модуль = ОбщегоНазначения.ОбщийМодуль("КадровыйРезерв");
//		ДанныеКадровогоРезерва = Модуль.ДанныеКадровогоПереводаДляКадровогоРезерва(ДокументСсылка);
//		ДанныеДляПроведения.Вставить("ДанныеКадровогоРезерва", ДанныеКадровогоРезерва);
//	КонецЕсли;

//	Возврат ДанныеДляПроведения;

//КонецФункции
