
&После("ПриКопировании")
Процедура СЭ_ПриКопировании(ОбъектКопирования)
	//+СЭ Пилипчук 0016039
	СЭ_Серия = Неопределено;
	СЭ_НомерПоСерии = Неопределено; 
	//-СЭ Пилипчук 0016039
КонецПроцедуры


&После("ОбработкаПроверкиЗаполнения")
Процедура СЭ_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//СЭ Ульяна 0016035
	
	Если ЗначениеЗаполнено(СЭ_ТипДополнительногоСоглашения)
		И НЕ ЗначениеЗаполнено(СЭ_НомерДопСоглашения)  Тогда 
		Отказ = Истина;
		ТекстСообщения = "Номер доп.соглашения пустой! Запись документа невозможна!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка, "Объект.СЭ_НомерДопСоглашения", , Отказ)
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(СЭ_ТипДополнительногоСоглашения)
		И НЕ ЗначениеЗаполнено(СЭ_ДатаДопСоглашения)  Тогда 
		Отказ = Истина;
		ТекстСообщения = "Дата доп.соглашения пустая! Запись документа невозможна!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка, "Объект.СЭ_ДатаДопСоглашения", , Отказ)
	КонецЕсли;
	//СЭ Ульяна 0016035

КонецПроцедуры

