	   
//СЭ+ Евгений [15951] Надо добавить новый объект чтобы вызывалась типовая процедура создания команд печати
&После("ОпределитьОбъектыСКомандамиПечати")
Процедура СЭ_ОпределитьОбъектыСКомандамиПечати(СписокОбъектов)
	
	#Область Справочники
	
	СписокОбъектов.Добавить(Справочники.СЭ_УровниСотрудников);	
	СписокОбъектов.Добавить(Справочники.СЭ_ОбластиЗУН);	
	СписокОбъектов.Добавить(Справочники.СЭ_ТипыЗУН);	
	СписокОбъектов.Добавить(Справочники.СЭ_СпособыПолученияЗУН);	
	СписокОбъектов.Добавить(Справочники.СЭ_ЗУН);	
	СписокОбъектов.Добавить(Справочники.СЭ_ФормыКонтроляЗУН);	
	СписокОбъектов.Добавить(Справочники.СЭ_СтатусыПодтвержденияЗУН);	
	СписокОбъектов.Добавить(Справочники.СЭ_СотрудникиЗУН);	
	
	СписокОбъектов.Добавить(Справочники.СЭ_ВидыРаботЗУН);
    СписокОбъектов.Добавить(Справочники.СЭ_КвалификацииЗУН);
    СписокОбъектов.Добавить(Справочники.СЭ_ТипыДоговора);
    СписокОбъектов.Добавить(Справочники.СЭ_ТипыОбслуживания);
    СписокОбъектов.Добавить(Справочники.СЭ_СтатусыЗапланированногоДействия);
    СписокОбъектов.Добавить(Справочники.СЭ_ПриложенияКДоговору);
    СписокОбъектов.Добавить(Справочники.СЭ_СтадииПодписанияДоговора);

	#КонецОбласти
	
	#Область Документы
	
	СписокОбъектов.Добавить(Документы.СЭ_ЗаявкаНаОбучениеЗУН);
	СписокОбъектов.Добавить(Документы.СЭ_ПланАттестацийСотрудников);
    СписокОбъектов.Добавить(Документы.СЭ_АттестацияСотрудников);
    СписокОбъектов.Добавить(Документы.СЭ_ЗапланированноеДействие);

	#КонецОбласти
	
КонецПроцедуры
//СЭ- Евгений [15951] Надо добавить новый объект чтобы вызывалась типовая процедура создания команд печати
