
&НаСервере
&После("ПриСозданииНаСервере")
Процедура СЭ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//СЭ+ Евгений [15069] Ошибка в запросе дин. списка, подробнее в 15046
	СЭ_ИзменитьЗапросСписка();
	//СЭ- Евгений [15069] Ошибка в запросе дин. списка, подробнее в 15046

КонецПроцедуры

//СЭ+ Евгений [15069] Ошибка в запросе дин. списка
&НаСервере
Процедура СЭ_ИзменитьЗапросСписка()

	ТекстЗапроса = Список.ТекстЗапроса;
	
	СтрокаПоиска = "	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ЗаполненностьРеквизитовОбъектов КАК ЗаполненностьРеквизитовОбъектов
					|	ПО (ЗаполненностьРеквизитовОбъектов.Объект = СправочникПартнеры.Ссылка)";
	
	СтрокаЗамены = "	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
					|			CRM_ЗаполненностьРеквизитовОбъектов.Объект КАК Объект,
					|			CRM_ЗаполненностьРеквизитовОбъектов.ПроцентЗаполненностиОбщий КАК ПроцентЗаполненностиОбщий,
					|			CRM_ЗаполненностьРеквизитовОбъектов.ТребуетсяПересчет КАК ТребуетсяПересчет
					|		ИЗ
					|			РегистрСведений.CRM_ЗаполненностьРеквизитовОбъектов КАК CRM_ЗаполненностьРеквизитовОбъектов
					|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
					|					CRM_ЗаполненностьРеквизитовОбъектов.Объект КАК Объект,
					|					МАКСИМУМ(CRM_ЗаполненностьРеквизитовОбъектов.ДатаРасчета) КАК ДатаРасчета
					|				ИЗ
					|					РегистрСведений.CRM_ЗаполненностьРеквизитовОбъектов КАК CRM_ЗаполненностьРеквизитовОбъектов
					|
					|				СГРУППИРОВАТЬ ПО
					|				CRM_ЗаполненностьРеквизитовОбъектов.Объект) КАК СЭ_ЗапросРеквизитовОбъектовПоМаксимальнойДате
					|			ПО CRM_ЗаполненностьРеквизитовОбъектов.Объект = СЭ_ЗапросРеквизитовОбъектовПоМаксимальнойДате.Объект
					|			И CRM_ЗаполненностьРеквизитовОбъектов.ДатаРасчета = СЭ_ЗапросРеквизитовОбъектовПоМаксимальнойДате.ДатаРасчета) КАК ЗаполненностьРеквизитовОбъектов
					|	ПО (ЗаполненностьРеквизитовОбъектов.Объект = СправочникПартнеры.Ссылка)";

	
	НовыйТекстЗапроса = СтрЗаменить(ТекстЗапроса, СтрокаПоиска, СтрокаЗамены);
	
	Список.ТекстЗапроса = НовыйТекстЗапроса;
	
КонецПроцедуры
//СЭ- Евгений [15069] Ошибка в запросе дин. списка