
&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура СЭ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ТолькоПросмотр = НЕ Пользователи.ЭтоПолноправныйПользователь();

	Если Параметры.Свойство("Данные") Тогда
		Если Параметры.Данные = "Клиенты" Тогда
			Заголовок = НСтр("ru='Настройка истории изменения данных клиентов';en='Setting history of customer data change'");
			Элементы.ГруппаИнтересы.Видимость = Ложь;
		ИначеЕсли Параметры.Данные = "Интересы" Тогда
			Заголовок = НСтр("ru='Настройка истории изменения данных интересов';
			|en='Configure the history of changing lead data'");
			Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
			Элементы.ГруппаКлиенты.Видимость = Ложь;
			Элементы.ГруппаКонтакты.Видимость = Ложь;
			Элементы.ГруппаПотенциальныеКлиенты.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;

	МассивПропуститьРеквизиты = Новый Массив();
	МассивПропуститьРеквизиты.Добавить("Код");
	МассивПропуститьРеквизиты.Добавить("Предопределенный");
	МассивПропуститьРеквизиты.Добавить("Ссылка");
	МассивПропуститьРеквизиты.Добавить("ЭтоГруппа");
	//МассивПропуститьРеквизиты.Добавить("ПометкаУдаления");
	МассивПропуститьРеквизиты.Добавить("ИмяПредопределенныхДанных");
	МассивПропуститьРеквизиты.Добавить("Проведен");
	МассивПропуститьРеквизиты.Добавить("Автор");
	МассивПропуститьРеквизиты.Добавить("ДокументОснование");
	МассивПропуститьРеквизиты.Добавить("Завершен");
	МассивПропуститьРеквизиты.Добавить("ПричинаОтказа");
	МассивПропуститьРеквизиты.Добавить("ДатаЗакрытия");
	МассивПропуститьРеквизиты.Добавить("ВероятностьСделки");
	МассивПропуститьРеквизиты.Добавить("Фотография");
	МассивПропуститьРеквизиты.Добавить("Идентификатор");
	МассивПропуститьРеквизиты.Добавить("ДатаРегистрации");
	МассивПропуститьРеквизиты.Добавить("НеОбновлятьФото");

	// Реквизиты справочника Партнеры.
	Для Каждого Реквизит Из Метаданные.Справочники.Партнеры.СтандартныеРеквизиты Цикл
		Если МассивПропуститьРеквизиты.Найти(Реквизит.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = ТаблицаРеквизиты.Добавить();
		НоваяСтрока.Имя = Реквизит.Имя;
		НоваяСтрока.Представление = Реквизит.Представление();
	КонецЦикла;
	Для Каждого Реквизит Из Метаданные.Справочники.Партнеры.Реквизиты Цикл
		Если МассивПропуститьРеквизиты.Найти(Реквизит.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = ТаблицаРеквизиты.Добавить();
		НоваяСтрока.Имя = Реквизит.Имя;
		НоваяСтрока.Представление = Реквизит.Синоним;
	КонецЦикла;

	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		НоваяСтрока = ТаблицаРеквизиты.Добавить();
		НоваяСтрока.Имя = "CRM_УровниДоступа";
		НоваяСтрока.Представление = НСтр("ru = 'Уровни доступа'");
	КонецЕсли;

	// Реквизиты справочника КонтактныеЛицаПартнеров.
	Для Каждого Реквизит Из Метаданные.Справочники.КонтактныеЛицаПартнеров.СтандартныеРеквизиты Цикл
		Если МассивПропуститьРеквизиты.Найти(Реквизит.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = ТаблицаРеквизитыКонтактногоЛица.Добавить();
		НоваяСтрока.Имя = Реквизит.Имя;
		НоваяСтрока.Представление = Реквизит.Представление();
	КонецЦикла;
	Для Каждого Реквизит Из Метаданные.Справочники.КонтактныеЛицаПартнеров.Реквизиты Цикл
		Если МассивПропуститьРеквизиты.Найти(Реквизит.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = ТаблицаРеквизитыКонтактногоЛица.Добавить();
		НоваяСтрока.Имя = Реквизит.Имя;
		НоваяСтрока.Представление = Реквизит.Синоним;
	КонецЦикла;

	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		НоваяСтрока = ТаблицаРеквизитыКонтактногоЛица.Добавить();
		НоваяСтрока.Имя = "CRM_УровниДоступа";
		НоваяСтрока.Представление = НСтр("ru = 'Уровни доступа'");
	КонецЕсли;

	// Реквизиты документа Интерес.
	Для Каждого Реквизит Из Метаданные.Документы.CRM_Интерес.СтандартныеРеквизиты Цикл
		Если МассивПропуститьРеквизиты.Найти(Реквизит.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = ТаблицаРеквизитыИнтерес.Добавить();
		НоваяСтрока.Имя = Реквизит.Имя;
		НоваяСтрока.Представление = Реквизит.Представление();
	КонецЦикла;
	Для Каждого Реквизит Из Метаданные.Документы.CRM_Интерес.Реквизиты Цикл
		Если МассивПропуститьРеквизиты.Найти(Реквизит.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = ТаблицаРеквизитыИнтерес.Добавить();
		НоваяСтрока.Имя = Реквизит.Имя;
		НоваяСтрока.Представление = Реквизит.Синоним;
	КонецЦикла;

	// Реквизиты справочника CRM_ПотенциальныеКлиенты.
	Для Каждого Реквизит Из Метаданные.Справочники.CRM_ПотенциальныеКлиенты.СтандартныеРеквизиты Цикл
		Если МассивПропуститьРеквизиты.Найти(Реквизит.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = ТаблицаРеквизитыПотенциальныйКлиент.Добавить();
		НоваяСтрока.Имя = Реквизит.Имя;
		НоваяСтрока.Представление = Реквизит.Представление();
	КонецЦикла;
	Для Каждого Реквизит Из Метаданные.Справочники.CRM_ПотенциальныеКлиенты.Реквизиты Цикл
		Если МассивПропуститьРеквизиты.Найти(Реквизит.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = ТаблицаРеквизитыПотенциальныйКлиент.Добавить();
		НоваяСтрока.Имя = Реквизит.Имя;
		НоваяСтрока.Представление = Реквизит.Синоним;
	КонецЦикла;

	Если ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения") Тогда
		// Дополнительные реквизиты справочника Партнеры.
		МассивРеквизитов = Новый Массив();
		Для Каждого СтрокаТаблицы Из УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Партнеры_Общие").ДополнительныеРеквизиты Цикл
			Если МассивРеквизитов.Найти(СтрокаТаблицы.Свойство) = Неопределено Тогда
				МассивРеквизитов.Добавить(СтрокаТаблицы.Свойство);
			КонецЕсли;
		КонецЦикла;                   
		#Удаление
		Для Каждого СтрокаТаблицы Из УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Партнеры_Компании_CRM").ДополнительныеРеквизиты Цикл
			Если МассивРеквизитов.Найти(СтрокаТаблицы.Свойство) = Неопределено Тогда
				МассивРеквизитов.Добавить(СтрокаТаблицы.Свойство);
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрокаТаблицы Из УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Партнеры_ЧастныеЛица_CRM").ДополнительныеРеквизиты Цикл
			Если МассивРеквизитов.Найти(СтрокаТаблицы.Свойство) = Неопределено Тогда
				МассивРеквизитов.Добавить(СтрокаТаблицы.Свойство);
			КонецЕсли;
		КонецЦикла;
		#КонецУдаления
		#Вставка 
		//СЭ+ Евгений [15477] исправляем ошибки ЦРМ на версии ЕРП 22
		Если УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Партнеры_Компании_CRM") <> Неопределено Тогда
			Для Каждого СтрокаТаблицы Из УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Партнеры_Компании_CRM").ДополнительныеРеквизиты Цикл
				Если МассивРеквизитов.Найти(СтрокаТаблицы.Свойство) = Неопределено Тогда
					МассивРеквизитов.Добавить(СтрокаТаблицы.Свойство);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Партнеры_ЧастныеЛица_CRM") <> Неопределено Тогда
			Для Каждого СтрокаТаблицы Из УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Партнеры_ЧастныеЛица_CRM").ДополнительныеРеквизиты Цикл
				Если МассивРеквизитов.Найти(СтрокаТаблицы.Свойство) = Неопределено Тогда
					МассивРеквизитов.Добавить(СтрокаТаблицы.Свойство);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		//СЭ- Евгений [15477] 
		#КонецВставки
		Для Каждого ДопРеквизитСсылка Из МассивРеквизитов Цикл
			НоваяСтрока = ТаблицаРеквизиты.Добавить();
			НоваяСтрока.Имя = ДопРеквизитСсылка;
			НоваяСтрока.Представление = Строка(ДопРеквизитСсылка);
		КонецЦикла;

		// Дополнительные реквизиты справочника КонтактныеЛицаПартнеров.
		МассивРеквизитов = Новый Массив();
		Для Каждого СтрокаТаблицы Из УправлениеСвойствами.НаборСвойствПоИмени("Справочник_КонтактныеЛицаПартнеров").ДополнительныеРеквизиты Цикл
			Если МассивРеквизитов.Найти(СтрокаТаблицы.Свойство) = Неопределено Тогда
				МассивРеквизитов.Добавить(СтрокаТаблицы.Свойство);
			КонецЕсли;
		КонецЦикла;
		Для Каждого ДопРеквизитСсылка Из МассивРеквизитов Цикл
			НоваяСтрока = ТаблицаРеквизитыКонтактногоЛица.Добавить();
			НоваяСтрока.Имя = ДопРеквизитСсылка;
			НоваяСтрока.Представление = Строка(ДопРеквизитСсылка);
		КонецЦикла;

		// Дополнительные реквизиты документа Интерес.
		МассивРеквизитов = Новый Массив();
		Для Каждого СтрокаТаблицы Из Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_CRM_Интерес.ДополнительныеРеквизиты Цикл
			Если МассивРеквизитов.Найти(СтрокаТаблицы.Свойство) = Неопределено Тогда
				МассивРеквизитов.Добавить(СтрокаТаблицы.Свойство);
			КонецЕсли;
		КонецЦикла;
		Для Каждого ДопРеквизитСсылка Из МассивРеквизитов Цикл
			НоваяСтрока = ТаблицаРеквизитыИнтерес.Добавить();
			НоваяСтрока.Имя = ДопРеквизитСсылка;
			НоваяСтрока.Представление = Строка(ДопРеквизитСсылка);
		КонецЦикла;

		// Дополнительные реквизиты справочника CRM_ПотенциальныеКлиенты.
		МассивРеквизитов = Новый Массив();
		Для Каждого СтрокаТаблицы Из Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_CRM_ПотенциальныеКлиенты.ДополнительныеРеквизиты Цикл
			Если МассивРеквизитов.Найти(СтрокаТаблицы.Свойство) = Неопределено Тогда
				МассивРеквизитов.Добавить(СтрокаТаблицы.Свойство);
			КонецЕсли;
		КонецЦикла;
		Для Каждого ДопРеквизитСсылка Из МассивРеквизитов Цикл
			НоваяСтрока = ТаблицаРеквизитыПотенциальныйКлиент.Добавить();
			НоваяСтрока.Имя = ДопРеквизитСсылка;
			НоваяСтрока.Представление = Строка(ДопРеквизитСсылка);
		КонецЦикла;

	КонецЕсли;

	// Контактная информация справочника Партнеры.
	МассивРодителей = Новый Массив();
	МассивРодителей.Добавить(Справочники.ВидыКонтактнойИнформации.СправочникПартнеры);
	МассивРодителей.Добавить(Справочники.ВидыКонтактнойИнформации.CRM_СправочникПартнерыЧастноеЛицо);
	МассивРодителей.Добавить(Справочники.ВидыКонтактнойИнформации.CRM_СправочникПартнерыКомпания);
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации
	|ГДЕ
	|	Родитель В (&МассивРодителей)
	|	И НЕ ПометкаУдаления
	|	И НЕ ЭтоГруппа
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|");
	Запрос.УстановитьПараметр("МассивРодителей", МассивРодителей);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаРеквизиты.Добавить();
		НоваяСтрока.Имя = Выборка.Ссылка;
		НоваяСтрока.Представление = Строка(Выборка.Ссылка);
	КонецЦикла;

	// Контактная информация справочника КонтактныеЛицаПартнеров.
	МассивРодителей = Новый Массив();
	МассивРодителей.Добавить(Справочники.ВидыКонтактнойИнформации.СправочникКонтактныеЛицаПартнеров);
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации
	|ГДЕ
	|	Родитель В (&МассивРодителей)
	|	И НЕ ПометкаУдаления
	|	И НЕ ЭтоГруппа
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|");
	Запрос.УстановитьПараметр("МассивРодителей", МассивРодителей);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаРеквизитыКонтактногоЛица.Добавить();
		НоваяСтрока.Имя = Выборка.Ссылка;
		НоваяСтрока.Представление = Строка(Выборка.Ссылка);
	КонецЦикла;

	// Контактная информация справочника CRM_ПотенциальныеКлиенты.
	МассивРодителей = Новый Массив();
	МассивРодителей.Добавить(Справочники.ВидыКонтактнойИнформации.СправочникCRM_ПотенциальныеКлиенты);
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации
	|ГДЕ
	|	Родитель В (&МассивРодителей)
	|	И НЕ ПометкаУдаления
	|	И НЕ ЭтоГруппа
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|");
	Запрос.УстановитьПараметр("МассивРодителей", МассивРодителей);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаРеквизитыПотенциальныйКлиент.Добавить();
		НоваяСтрока.Имя = Выборка.Ссылка;
		НоваяСтрока.Представление = Строка(Выборка.Ссылка);
	КонецЦикла;

	НоваяСтрока = ТаблицаРеквизиты.Добавить();
	НоваяСтрока.Имя = "Сегмент";
	НоваяСтрока.Представление = НСтр("ru='Сегмент клиента';en='Customer Segment'");

	бОтмеченРеквизитСегмент = Ложь;
	СтруктураНастройки = РегистрыСведений.CRM_НастройкаВерсионированияРеквизитовПартнеров.ПолучитьНастройку();
	Если ТипЗнч(СтруктураНастройки) = Тип("Структура")
		И ТипЗнч(СтруктураНастройки.СтруктураНастройки) = Тип("Структура") Тогда
		Если СтруктураНастройки.СтруктураНастройки.Свойство("Реквизиты")
			И ТипЗнч(СтруктураНастройки.СтруктураНастройки.Реквизиты) = Тип("Массив") Тогда
			Для Каждого СтрокаТаблицы Из ТаблицаРеквизиты Цикл
				Если СтруктураНастройки.СтруктураНастройки.Реквизиты.Найти(СтрокаТаблицы.Имя) <> Неопределено Тогда
					СтрокаТаблицы.Пометка = Истина;
					Если СтрокаТаблицы.Имя = "Сегмент" Тогда
						бОтмеченРеквизитСегмент = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если СтруктураНастройки.СтруктураНастройки.Свойство("РеквизитыКонтактногоЛица")
			И ТипЗнч(СтруктураНастройки.СтруктураНастройки.РеквизитыКонтактногоЛица) = Тип("Массив") Тогда
			Для Каждого СтрокаТаблицы Из ТаблицаРеквизитыКонтактногоЛица Цикл
				Если СтруктураНастройки.СтруктураНастройки.РеквизитыКонтактногоЛица.Найти(СтрокаТаблицы.Имя) <> Неопределено Тогда
					СтрокаТаблицы.Пометка = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если СтруктураНастройки.СтруктураНастройки.Свойство("РеквизитыИнтереса")
			И ТипЗнч(СтруктураНастройки.СтруктураНастройки.РеквизитыИнтереса) = Тип("Массив") Тогда
			Для Каждого СтрокаТаблицы Из ТаблицаРеквизитыИнтерес Цикл
				Если СтруктураНастройки.СтруктураНастройки.РеквизитыИнтереса.Найти(СтрокаТаблицы.Имя) <> Неопределено Тогда
					СтрокаТаблицы.Пометка = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если СтруктураНастройки.СтруктураНастройки.Свойство("РеквизитыПотенциальногоКлиента")
			И ТипЗнч(СтруктураНастройки.СтруктураНастройки.РеквизитыПотенциальногоКлиента) = Тип("Массив") Тогда
			Для Каждого СтрокаТаблицы Из ТаблицаРеквизитыПотенциальныйКлиент Цикл
				Если СтруктураНастройки.СтруктураНастройки.РеквизитыПотенциальногоКлиента.Найти(СтрокаТаблицы.Имя) <> Неопределено Тогда
					СтрокаТаблицы.Пометка = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	Элементы.ГруппаПотенциальныеКлиенты.Видимость = ПолучитьФункциональнуюОпцию("CRM_ИспользоватьПотенциальныхКлиентов");

КонецПроцедуры
