#Область ОбработчикиСобытийФормы

&НаСервере
Процедура СЭ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// СЭ+ Немкович [16001]
	Элементы.Комментарий.ПодсказкаВвода = "Код города/оператора вносим без 0. Номер телефона нужно вводить в поле Номер - без пробелов";
	
	Если СЭ_РеквизитыТелефонаПоВидуКИПроверяются() тогда
		
		Элементы.КодСтраны.Маска 	 = "9999";
		Элементы.КодГорода.Маска 	 = "99999";
		Элементы.НомерТелефона.Маска = "999999999999999";
		Элементы.Добавочный.Маска 	 = "99999999999999999999";
		
		КодСтраныЗаполнен = ЗначениеЗаполнено(КодСтраны);
		КодГородаЗаполнен = ЗначениеЗаполнено(КодГорода);
		
		ЕстьНезаполненныеРеквизиты = не КодСтраныЗаполнен или не КодГородаЗаполнен;
		СтационарныйТелефон = 
			(ЭтаФорма.ВидКонтактнойИнформации = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонПартнера") 
			или ЭтаФорма.ВидКонтактнойИнформации = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента")
			или ЭтаФорма.ВидКонтактнойИнформации = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица"));
		МобильныйТелефон 	= 
			ЭтаФорма.ВидКонтактнойИнформации = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица");
		
		Если Элементы.ГруппаПоляТелефона.Видимость и (СтационарныйТелефон или МобильныйТелефон) и ЕстьНезаполненныеРеквизиты тогда
			
			Если не КодСтраныЗаполнен тогда
				КодСтраны = "375";
			КонецЕсли;
			
			Если не КодГородаЗаполнен тогда
				КодГорода = ?(СтационарныйТелефон, "17", ?(МобильныйТелефон, "29", ""));
			КонецЕсли;
			
			Представление = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона(
				КодСтраны, 
				КодГорода, 
				НомерТелефона, 
				Добавочный, 
				"");
				
			Модифицированность = истина;
			
		КонецЕсли;
		
	КонецЕсли;
	// СЭ- Немкович
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СЭ_КодСтраныПриИзмененииПеред(Элемент)
	// СЭ+ Немкович [16001]
	Если СЭ_РеквизитыТелефонаПоВидуКИПроверяются() тогда
		КодСтраны = СЭ_ПроверитьИсправитьСтрокуПосимвольно(КодСтраны);
	КонецЕсли;
	// СЭ- Немкович
КонецПроцедуры

&НаКлиенте
Процедура СЭ_КодГородаПриИзмененииПеред(Элемент)
	// СЭ+ Немкович [16001]
	Если СЭ_РеквизитыТелефонаПоВидуКИПроверяются() тогда
		КодГорода = СЭ_ПроверитьИсправитьСтрокуПосимвольно(КодГорода);
	КонецЕсли;
	// СЭ- Немкович
КонецПроцедуры

&НаКлиенте
Процедура СЭ_НомерТелефонаПриИзмененииПеред(Элемент)
	// СЭ+ Немкович [16001]
	Если СЭ_РеквизитыТелефонаПоВидуКИПроверяются() тогда
		НомерТелефона = СЭ_ПроверитьИсправитьСтрокуПосимвольно(НомерТелефона);
	КонецЕсли;
	// СЭ- Немкович
КонецПроцедуры

&НаКлиенте
Процедура СЭ_ДобавочныйПриИзмененииПеред(Элемент)
	// СЭ+ Немкович [16001]
	Если СЭ_РеквизитыТелефонаПоВидуКИПроверяются() тогда
		Добавочный = СЭ_ПроверитьИсправитьСтрокуПосимвольно(Добавочный);
	КонецЕсли;
	// СЭ- Немкович
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СЭ+ Немкович [16001]
&НаСервере
Функция СЭ_РеквизитыТелефонаПоВидуКИПроверяются()
	
	МассивКПроверке = новый Массив;
	
	МассивКПроверке.Добавить(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонПартнера")); 
	МассивКПроверке.Добавить(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента"));
	МассивКПроверке.Добавить(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица")); 
	МассивКПроверке.Добавить(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица"));
	
	Возврат не МассивКПроверке.Найти(ЭтаФорма.ВидКонтактнойИнформации) = неопределено;
	
КонецФункции

&НаСервере
Функция СЭ_ПроверитьИсправитьСтрокуПосимвольно(ПереданнаяСтрока)
	
	ПереданнаяСтрока = СокрЛП(ПереданнаяСтрока);
	
	ФормируемаяСтрока = "";
	Для ПозицияСимвола = 1 по СтрДлина(ПереданнаяСтрока) цикл
		ПроверяемыйСимвол = Сред(ПереданнаяСтрока, ПозицияСимвола, 1);
		Если СЭ_СимволЯвляетсяЦифрой(ПроверяемыйСимвол) тогда
			ФормируемаяСтрока = ФормируемаяСтрока + ПроверяемыйСимвол; 
		КонецЕсли;
	КонецЦикла;
	
	Возврат ФормируемаяСтрока;
	
КонецФункции

&НаСервере
Функция СЭ_СимволЯвляетсяЦифрой(ПроверяемыйСимвол)
	Возврат ?(ПроверяемыйСимвол = "", Ложь, СтрНайти("0123456789", ПроверяемыйСимвол) > 0); 
КонецФункции
// СЭ- Немкович

#КонецОбласти