
&НаСервере
&ИзменениеИКонтроль("ОбновитьПояснениеОблачногоСервиса")
Процедура СЭ_ОбновитьПояснениеОблачногоСервиса()

	ВидимостьПояснения = Ложь;

	Если ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюФайлов") Тогда

		СведенияОСинхронизации = РаботаСФайламиСлужебный.СведенияОСинхронизации(ВладелецФайла.Ссылка);
		
		#Удаление
		Если СведенияОСинхронизации.Количество() > 0  Тогда
        #КонецУдаления
		
		#Вставка
		//СЭ+ Евгений [16853] Если файлов нет то типовая процедура возвращает Неопределено
		Если  СведенияОСинхронизации <> Неопределено И СведенияОСинхронизации.Количество() > 0 Тогда
		//СЭ- Евгений [16853]
		#КонецВставки
		
			ФайлыРедактируютсяВОблачномСервисе = Истина;
			УчетнаяЗапись = СведенияОСинхронизации.УчетнаяЗапись;
			ВидимостьПояснения = Истина;

			АдресПапкиВОблачномСервисе = РаботаСФайламиСлужебныйКлиентСервер.АдресВОблачномСервисе(
			СведенияОСинхронизации.Сервис, СведенияОСинхронизации.Href);

			Элементы.ДекорацияПояснение.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
			НСтр("ru = 'Работа с файлами ведется в облачном сервисе <a href=""%1"">%2</a>.'"),
			Строка(АдресПапкиВОблачномСервисе), Строка(СведенияОСинхронизации.УчетнаяЗаписьНаименование));

			Элементы.ДекорацияКартинкаСтатусСинхронизации.Видимость = НЕ СведенияОСинхронизации.Синхронизирован;
			Элементы.ДекорацияДатаСинхронизации.ОтображениеПодсказки = ?(СведенияОСинхронизации.Синхронизирован,
			ОтображениеПодсказки.Нет,
			ОтображениеПодсказки.Кнопка);

			Элементы.ДекорацияДатаСинхронизации.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
			НСтр("ru = 'Синхронизировано: <a href=""%1"">%2</a>'"),
			"OpenJournal", Формат(СведенияОСинхронизации.ДатаСинхронизации, "ДЛФ=DD"));

		КонецЕсли;

	КонецЕсли;

	Элементы.ГруппаПояснениеОблачногоСервиса.Видимость = ВидимостьПояснения;

КонецПроцедуры
