
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если не ЗначениеЗаполнено(Параметры.Сотрудник) тогда
		ОбщегоНазначения.СообщитьПользователю("Отображение расширенной информации невозможно.",,,, Отказ);
		Возврат;
	КонецЕсли;
	
	Сотрудник 	= Параметры.Сотрудник;
	ДатаСобытия = Параметры.ДатаСобытия;
	РежимРаботы = Параметры.КонтекстИнформации;
	
	ЭтаФорма.Заголовок = ПолучитьСтрокуЗаголовкаФормы(РежимРаботы);
	
	ДополнитьФормуПоРежимуРаботы(РежимРаботы);
	
	УстановитьВидимостьТаблицыРасширеннойИнформации(Истина);
	ПолучитьРасширеннуюИнформациюПоСотрудникам();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьСтрокуЗаголовкаФормы(РежимРаботы)
	Возврат ?(РежимРаботы = "НахождениеВОтпуске", "Периоды нахождения в отпуске в текущем году", 
		?(РежимРаботы = "ОстаткиОтпуска", "Остатки неиспользованного отпуска на конец прошедшего года", ""));
КонецФункции

&НаСервере
Процедура ДополнитьФормуПоРежимуРаботы(РежимРаботы)
	
	// Добавление новых реквизитов формы
	ДобавляемыеРеквизиты = новый Массив();	
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("РабочийГодНачало",  	 новый ОписаниеТипов("Число"), "РасширеннаяИнформация", "Период ""С"""));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("РабочийГодОкончание", новый ОписаниеТипов("Число"), "РасширеннаяИнформация", "Период ""По"""));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ОстатокДней",  		 новый ОписаниеТипов("Число"), "РасширеннаяИнформация", "Остаток"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ДатаНачала", 		 новый ОписаниеТипов("Дата"),  "РасширеннаяИнформация", "Дата начала"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ДатаОкончания", 		 новый ОписаниеТипов("Дата"),  "РасширеннаяИнформация", "Дата окончания"));
	
	// Удаление существующих реквизитов формы
	УдаляемыеРеквизиты 	 = новый Массив();
	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты, УдаляемыеРеквизиты);
	
	Если РежимРаботы = "НахождениеВОтпуске" тогда
		
		НоваяКолонка 						 = Элементы.Добавить("РасширеннаяИнформацияГод", Тип("ПолеФормы"), Элементы.РасширеннаяИнформация);
		НоваяКолонка.Вид 					 = ВидПоляФормы.ПолеНадписи;
		НоваяКолонка.Заголовок 				 = "Год";
		НоваяКолонка.ПутьКДанным 			 = "РасширеннаяИнформация.ДатаНачала";
		НоваяКолонка.Формат 				 = "ДФ=yyyy";
		
		НоваяКолонка 						 = Элементы.Добавить("РасширеннаяИнформацияДатаНачала", Тип("ПолеФормы"), Элементы.РасширеннаяИнформация);
		НоваяКолонка.Вид 					 = ВидПоляФормы.ПолеНадписи;
		НоваяКолонка.Заголовок 				 = "Дата начала";
		НоваяКолонка.ПутьКДанным 			 = "РасширеннаяИнформация.ДатаНачала";
		НоваяКолонка.Формат 				 = "ДФ=dd.MM";
		
		НоваяКолонка 						 = Элементы.Добавить("РасширеннаяИнформацияДатаОкончания", Тип("ПолеФормы"), Элементы.РасширеннаяИнформация);
		НоваяКолонка.Вид 					 = ВидПоляФормы.ПолеНадписи;
		НоваяКолонка.Заголовок 				 = "Дата окончания";
		НоваяКолонка.ПутьКДанным 			 = "РасширеннаяИнформация.ДатаОкончания";
		НоваяКолонка.Формат 				 = "ДФ=dd.MM";
		
	ИначеЕсли РежимРаботы = "ОстаткиОтпуска" тогда
		
		НоваяГруппаКолонок 					 = Элементы.Добавить("РасширеннаяИнформацияГруппаРабочийГод", Тип("ГруппаФормы"), Элементы.РасширеннаяИнформация);
		НоваяГруппаКолонок.Заголовок 		 = "Рабочий год";
		НоваяГруппаКолонок.ОтображатьВШапке  = истина;
        НоваяГруппаКолонок.Группировка 		 = ГруппировкаКолонок.Горизонтальная;
		
		НоваяКолонка 						 = Элементы.Добавить("РасширеннаяИнформацияРабочийГодНачало", Тип("ПолеФормы"), НоваяГруппаКолонок);
		НоваяКолонка.Вид 					 = ВидПоляФормы.ПолеНадписи;
		НоваяКолонка.Заголовок 				 = "Рабочий год (начало)";
		НоваяКолонка.ПутьКДанным 			 = "РасширеннаяИнформация.РабочийГодНачало";
		НоваяКолонка.Формат 				 = "ЧН=Отсутствует; ЧГ=0";
		НоваяКолонка.ОтображатьВШапке 		 = ложь;
		НоваяКолонка.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
		
		НоваяКолонка 						 = Элементы.Добавить("РасширеннаяИнформацияРабочийГодОкончание", Тип("ПолеФормы"), НоваяГруппаКолонок);
		НоваяКолонка.Вид 					 = ВидПоляФормы.ПолеНадписи;
		НоваяКолонка.Заголовок 				 = "Рабочий год (окончание)";
		НоваяКолонка.ПутьКДанным 			 = "РасширеннаяИнформация.РабочийГодОкончание";
		НоваяКолонка.Формат 				 = "ЧН=Отсутствует; ЧГ=0";
		НоваяКолонка.ОтображатьВШапке 		 = ложь;
		НоваяКолонка.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
		
		НоваяКолонка 						 = Элементы.Добавить("РасширеннаяИнформацияОстатокСтрокой", Тип("ПолеФормы"), Элементы.РасширеннаяИнформация);
		НоваяКолонка.Вид 					 = ВидПоляФормы.ПолеНадписи;
		НоваяКолонка.Заголовок 				 = "Остаток дней";
		НоваяКолонка.ПутьКДанным 			 = "РасширеннаяИнформация.ОстатокДней";
		НоваяКолонка.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьТаблицыРасширеннойИнформации(ЕстьДанныеПоСотруднику)
	
	Элементы.ГруппаРасширеннаяИнформация.Видимость = ЕстьДанныеПоСотруднику;
	Элементы.ГруппаДекорацияОтсутствиеДанных.Видимость = не ЕстьДанныеПоСотруднику;	
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьРасширеннуюИнформациюПоСотрудникам()
	
	Сотрудники = Новый Массив();
	Сотрудники.Добавить(Сотрудник);
	
	ТаблицаРезультат = новый ТаблицаЗначений;
	Если РежимРаботы = "НахождениеВОтпуске" тогда
		ТаблицаРезультат = Документы.ГрафикОтпусков.СЭ_ПериодыНахожденияВОтпускеПоСотрудникам(Сотрудники, ДатаСобытия, Ложь, "ВОЗР");		
	ИначеЕсли РежимРаботы = "ОстаткиОтпуска" тогда	
		ТаблицаРезультат = Документы.ГрафикОтпусков.СЭ_ОстаткиОтпускаПоСотрудникам(Сотрудники, ДатаСобытия, Ложь, "ВОЗР");	
	КонецЕсли;
	
	Если ТаблицаРезультат.Количество() <> 0 тогда
		РасширеннаяИнформация.Загрузить(ТаблицаРезультат);
	Иначе
		УстановитьВидимостьТаблицыРасширеннойИнформации(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
