
&ИзменениеИКонтроль("ПолучитьОрганизациюПоУмолчанию")
Функция СЭ_ПолучитьОрганизациюПоУмолчанию()
	
	#Вставка
	Организация_Драйв = СЭ_ОбщегоНазначенияВызовСервераПривилегированный.ПолучитьГлобальноеЗначение("Организация_Драйв");
	Если Организация_Драйв <> Неопределено И ЗначениеЗаполнено(Организация_Драйв) Тогда
		Возврат Организация_Драйв;
	Иначе          
		Организация_Драйв = Справочники.Организации.НайтиПоРеквизиту("ИНН", "100177569");
		Если Организация_Драйв <> Неопределено И ЗначениеЗаполнено(Организация_Драйв) Тогда
			СЭ_ОбщегоНазначенияВызовСервераПривилегированный.УстановитьГлобальноеЗначение("Организация_Драйв", Организация_Драйв, "Организация по умолчанию");
			Возврат Организация_Драйв;
		КонецЕсли;
	КонецЕсли;
	#КонецВставки
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	Организации.Ссылка КАК Организация
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	НЕ Организации.ПометкаУдаления
	|	И Организации.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОрганизацийПодразделений.Действует)
	|";

	Если Не Константы.ИспользоватьУправленческуюОрганизацию.Получить() Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	И Не Организации.Предопределенный";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.Количество() = 1 Тогда
		Организация = Выборка.Организация;
	Иначе
		Организация = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;

	Возврат Организация;

КонецФункции
