 
 //+СЭ Пилипчук 0016039
&НаСервере
&Перед("ПриПолученииДанныхНаСервере")
Процедура СЭ_ПриПолученииДанныхНаСервере()
	//СЭ Пилипчук 0016187
	Элементы.СрочныйДоговор.Заголовок = "Срок действия до";
	//СЭ Пилипчук 0016187
	
	СЭ_РаботаСФормамиСервер.СЭ_СоздатьРеквизитыСерияИНомерПоСерииВкадровыхДокументах(Элементы, "ДатаНомер", Объект.Ссылка); 
	
	//СЭ Ульяна 0016035 
	СЭ_РаботаСФормамиСервер.СЭ_СоздатьРеквизитыФормы(Элементы);
	Если Объект.СЭ_ДобавитьИзменитьДопСоглашение тогда
		Элементы.СЭ_ГруппаДополнительногоСоглашения.Видимость = Истина; 
	Иначе
		Элементы.СЭ_ГруппаДополнительногоСоглашения.Видимость = Ложь;    
	КонецЕсли;
	//СЭ Ульяна 0016035
	
КонецПроцедуры   

&НаКлиенте
Процедура СЭ_ДатаПриИзмененииПосле(Элемент)
	СЭ_ДатаПриИзмененииПослеНаСервере();
КонецПроцедуры


&НаСервере
Процедура СЭ_ДатаПриИзмененииПослеНаСервере()
	//СЭ Пилипчук 0016039	
	СЭ_ОбщегоНазначенияВызовСервераПривилегированный.ВыдатьСообщениеОчисткиСерииИНомераПриИзмененииДаты(Объект); 	
	//СЭ Пилипчук 0016039
КонецПроцедуры
 //-СЭ Пилипчук 0016039 
 
 
 //СЭ Ульяна 0016035 
 
 &НаКлиенте
 Процедура СЭ_ДобавитьИзменитьДопСоглашениеПриИзменении(Элемент)  
	 
	 Если Объект.СЭ_ДобавитьИзменитьДопСоглашение тогда
		Элементы.СЭ_ГруппаДополнительногоСоглашения.Видимость = Истина; 
	 Иначе
		Элементы.СЭ_ГруппаДополнительногоСоглашения.Видимость = Ложь;    
		Объект.СЭ_ТипДополнительногоСоглашения                = ПредопределенноеЗначение("Справочник.СЭ_ТипыДополнительныхСоглашений.ПустаяСсылка");
		Объект.СЭ_ДатаДопСоглашения                           = Дата(1,1,1);
		Объект.СЭ_НомерДопСоглашения                          = 0;
	 КонецЕсли;
	 
 КонецПроцедуры
 
 //СЭ Ульяна 0016035