   
//СЭ+ Евгений [15069] в новом релизе нету процедуры, чтоб не исправлять везде сделал в расширении, после обновления ЦРМ удалить модуль
Функция ЗначениеРеквизитаПоСтатистике(СсылкаНаДокументОбъект,
										ИмяОбъектаМетаданных,
										ИмяРеквизита,
										ЗначенияРеквизитовРодителей,
										ЧастотаИспользованияЗначения,
										РазмерВыборки) Экспорт

	Возврат ЗаполнениеОбъектовПоСтатистикеСлужебный.ЗначениеРеквизитаПоСтатистике(СсылкаНаДокументОбъект,
										ИмяОбъектаМетаданных,
										ИмяРеквизита,
										ЗначенияРеквизитовРодителей,
										ЧастотаИспользованияЗначения,
										РазмерВыборки);

КонецФункции
//СЭ- Евгений [15069] в новом релизе нету процедуры, чтоб не исправлять везде сделал в расширении, после обновления ЦРМ удалить модуль