
//СЭ+ Евгений [16920]
Процедура СЭ_ЗаписатьДатуВозвратаПриИзмененииСостоянияОригинала(ИмяСобытия, Источник) Экспорт

	Если ИмяСобытия = "Запись_РегистрСведенийСостоянияОригиналовПервичныхДокументов" И Источник <> Неопределено Тогда
		
		Если ТипЗнч(Источник) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			СЭ_ЗаписатьДатуВозвратаДоговора(Источник);
		ИначеЕсли ТипЗнч(Источник) = Тип("Массив") Тогда 
			Для каждого СтрокаМассива Из Источник Цикл
				СЭ_ЗаписатьДатуВозвратаДоговора(СтрокаМассива);	
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура СЭ_ЗаписатьДатуВозвратаДоговора(Источник)
	
	Если ТипЗнч(Источник) = Тип("СправочникСсылка.ДоговорыКонтрагентов") И ЗначениеЗаполнено(Источник) Тогда
		
		ДатаСостоянияОригинала = СЭ_ПолучитьДатуВозвратаИзРегистраСостоянияОригиналов(Источник, Источник.СЭ_ДатаВозвратаДоговора);
		Если ЗначениеЗаполнено(ДатаСостоянияОригинала) И НачалоДня(Источник.СЭ_ДатаВозвратаДоговора) <> НачалоДня(ДатаСостоянияОригинала) Тогда
			ДоговорОбъект = Источник.ПолучитьОбъект();
			ДоговорОбъект.СЭ_ДатаВозвратаДоговора = ДатаСостоянияОригинала;
			ДоговорОбъект.Записать(); 
		КонецЕслИ;
		
	КонецЕсли;	

КонецПроцедуры

//меняем дату тока если в регистре состояние оригинал получен
Функция СЭ_ПолучитьДатуВозвратаИзРегистраСостоянияОригиналов(ДоговорСсылка, ТекущаяДатаВозвратаДоговора) Экспорт
	
	Результат = ТекущаяДатаВозвратаДоговора;
	
	Если ЗначениеЗаполнено(ДоговорСсылка) Тогда
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	МАКСИМУМ(СостоянияОригиналовПервичныхДокументов.ДатаПоследнегоИзменения) КАК ДатаПоследнегоИзменения
			|ИЗ
			|	РегистрСведений.СостоянияОригиналовПервичныхДокументов КАК СостоянияОригиналовПервичныхДокументов
			|ГДЕ
			|	СостоянияОригиналовПервичныхДокументов.Владелец = &Владелец
			|	И СостоянияОригиналовПервичныхДокументов.Состояние = &Состояние";

		Запрос.УстановитьПараметр("Владелец", ДоговорСсылка);
        Запрос.УстановитьПараметр("Состояние", ПредопределенноеЗначение("Справочник.СостоянияОригиналовПервичныхДокументов.ОригиналПолучен"));

		РезультатЗапроса = Запрос.Выполнить();

		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ТипЗнч(Выборка.ДатаПоследнегоИзменения) = Тип("Дата") И ЗначениеЗаполнено(Выборка.ДатаПоследнегоИзменения) Тогда
				Результат = Выборка.ДатаПоследнегоИзменения;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции
//СЭ- Евгений [16920]