 
 //+СЭ Пилипчук 0016039
&НаСервере
&Перед("ПриПолученииДанныхНаСервере")
Процедура СЭ_ПриПолученииДанныхНаСервере(ТекущийОбъект)
	
	Если ТекущийОбъект = Неопределено Тогда
		ТекущийОбъект = Объект;
	КонецЕсли;

	СЭ_РаботаСФормамиСервер.СЭ_СоздатьРеквизитыСерияИНомерПоСерииВкадровыхДокументах(Элементы, "ДатаНомер", ТекущийОбъект.Ссылка); 
	
КонецПроцедуры   

&НаКлиенте
Процедура СЭ_ДатаПриИзмененииПосле(Элемент)
	СЭ_ДатаПриИзмененииПослеНаСервере();
КонецПроцедуры


&НаСервере
Процедура СЭ_ДатаПриИзмененииПослеНаСервере()
	//СЭ Пилипчук 0016039	
	СЭ_ОбщегоНазначенияВызовСервераПривилегированный.ВыдатьСообщениеОчисткиСерииИНомераПриИзмененииДаты(Объект); 	
	//СЭ Пилипчук 0016039
КонецПроцедуры
 //-СЭ Пилипчук 0016039 
