
&ИзменениеИКонтроль("УстановитьЗаголовкиЭлементовФормы")
Процедура СЭ_УстановитьЗаголовкиЭлементовФормы(Форма, ОписаниеФормы, ВидДоговора)
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, ОписаниеФормы["ИмяЭлементаСтраницаОплатаТруда"], 		"Заголовок", Нстр("ru = 'Оплата труда'"));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, ОписаниеФормы["ИмяЭлементаСрочныйДоговор"], 			"Заголовок", Нстр("ru = 'Срочный трудовой договор до'"));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, ОписаниеФормы["ИмяЭлементаДоговорКонтракт"], 			"Заголовок", Нстр("ru = 'Трудовой договор'"));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, ОписаниеФормы["ИмяЭлементаПредставитель"], 			"Заголовок", Нстр("ru = 'Руководитель'"));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, ОписаниеФормы["ИмяЭлементаДолжностьПредставителя"], 	"Заголовок", Нстр("ru = 'Должность'"));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, ОписаниеФормы["ИмяЭлементаИзменитьСведенияОДоговоре"], "Заголовок", Нстр("ru = 'Изменить сведения о договоре'"));
	#Вставка
	//СЭ Пилипчук 0016187
	Если ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.КадровыйПеревод") Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, ОписаниеФормы["ИмяЭлементаСрочныйДоговор"],"Заголовок", Нстр("ru = 'Срок действия до'"));
	КонецЕсли;
	Если ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.ПриемНаРаботу") Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, ОписаниеФормы["ИмяЭлементаСрочныйДоговор"],"Заголовок", Нстр("ru = 'Срок действия до'"));
	КонецЕсли;
	Если ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.ПродлениеКонтрактаДоговора") Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, ОписаниеФормы["ИмяЭлементаСрочныйДоговор"],"Заголовок", Нстр("ru = 'Продление контракта, договора'"));	
	КонецЕсли;
	//СЭ Пилипчук 0016187
	#КонецВставки
	
КонецПроцедуры
