
//СЭ+ Евгений [15069]  в новом релизе нету процедуры, чтоб не исправлять везде сделал в расширении, после обновления ЦРМ удалить модуль
Функция ПолучитьСтруктуруКэшируемыеЗначения() Экспорт
		
	Возврат ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
КонецФункции 

Функция ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект) Экспорт
	
	Возврат ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
КонецФункции

Функция ПараметрыПересчетаСуммыНДСВТЧ(Объект) Экспорт
	
	Возврат ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВТЧ(Объект);
	
КонецФункции

Функция ПараметрыЗаполненияЦеныВСтрокеТЧ(Объект, ВидЦеныВШапке = Ложь) Экспорт
	
	Возврат ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияЦеныВСтрокеТЧ(Объект, ВидЦеныВШапке);
	
КонецФункции

Функция ПолучитьСтруктуруЗаполненияУсловийПродажВСтрокеТЧ(Объект) Экспорт
	
	Возврат ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияУсловийПродажВСтрокеТЧ(Объект);
	
КонецФункции
//СЭ- Евгений [15069]  в новом релизе нету процедуры, чтоб не исправлять везде сделал в расширении, после обновления ЦРМ удалить модуль