
&НаСервере
&После("ПриСозданииНаСервере")
Процедура СЭ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//СЭ+ Евгений [16920]
	СЭ_ИзменитьТекстЗапросаСписка();
	СЭ_СоздатьЭлементыФормы();
	//СЭ- Евгений [16920]

КонецПроцедуры

&НаКлиенте
&После("ОбработкаОповещения")
Процедура СЭ_ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	//СЭ+ Евгений [16920]
	Если ИмяСобытия = "Запись_РегистрСведенийСостоянияОригиналовПервичныхДокументов" И Источник <> Неопределено Тогда
		СЭ_ЗаписатьДатуВозвратаПриИзмененииСостоянияОригинала(ИмяСобытия, Источник);
	КонецЕсли;
	//СЭ- Евгений [16920]
	
КонецПроцедуры

//СЭ+ Евгений [16920]
&НаСервереБезКонтекста
Процедура СЭ_ЗаписатьДатуВозвратаПриИзмененииСостоянияОригинала(ИмяСобытия, Источник)

	Справочники.ДоговорыКонтрагентов.СЭ_ЗаписатьДатуВозвратаПриИзмененииСостоянияОригинала(ИмяСобытия, Источник);	

КонецПроцедуры

&НаСервере
Процедура СЭ_ИзменитьТекстЗапросаСписка()

	СтрокаПоиска = "СправочникДоговорыКонтрагентов.Ссылка,";	
    СтрокаЗамены = "СправочникДоговорыКонтрагентов.Ссылка,
					|СправочникДоговорыКонтрагентов.СЭ_ТипДоговора.КраткоеНаименование КАК Тип,";	

    Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, СтрокаПоиска, СтрокаЗамены);
	
КонецПроцедуры 

&НаСервере
Процедура СЭ_СоздатьЭлементыФормы()

	нЭлемент = Элементы.Вставить("СЭ_ТипДоговора", Тип("ПолеФормы"), Элементы.Список, Элементы.СписокДатаНачалаДействия); 
	нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	нЭлемент.ПутьКДанным = "Список.Тип";
	нЭлемент.Заголовок = "Тип";
	нЭлемент.РастягиватьПоГоризонтали = Ложь;
	нЭлемент.Ширина = 5;	

КонецПроцедуры
//СЭ- Евгений [16920]

