                                 
 //+СЭ Пилипчук 0016039
&НаСервере
&Перед("ПриПолученииДанныхНаСервере")
Процедура СЭ_ПриПолученииДанныхНаСервере()
	
	СЭ_РаботаСФормамиСервер.СЭ_СоздатьРеквизитыСерияИНомерПоСерииВкадровыхДокументах(Элементы, "ДатаВремя", Объект.Ссылка); 
	
КонецПроцедуры   

&НаКлиенте
Процедура СЭ_ДатаПриИзмененииПосле(Элемент)
	СЭ_ДатаПриИзмененииПослеНаСервере();
КонецПроцедуры


&НаСервере
Процедура СЭ_ДатаПриИзмененииПослеНаСервере()
	//СЭ Пилипчук 0016039	
	СЭ_ОбщегоНазначенияВызовСервераПривилегированный.ВыдатьСообщениеОчисткиСерииИНомераПриИзмененииДаты(Объект); 	
	//СЭ Пилипчук 0016039
КонецПроцедуры

 //-СЭ Пилипчук 0016039 

 //СЭ Ульяна 0017363
 &НаСервере
Процедура СЭ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если РольДоступна("СЭ_РасчетОтпускаБезВозможностиРедактированияКадровойЧасти") тогда
		Элементы.ГруппаСведенияГоризонтальная.ТолькоПросмотр         = Истина;
		Элементы.ПериодЗаКоторыйПредоставляетсяОтпуск.ТолькоПросмотр = Истина;
		Элементы.ГруппаДополнительныеОтпуска.ТолькоПросмотр          = Истина;
	КонецЕсли;
	
КонецПроцедуры
//СЭ Ульяна 0017363
