
&После("ОбработкаПроверкиЗаполнения")
Процедура СЭ_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	//СЭ+ Евгений [16498]
	Если НЕ СЭ_МолодойСпециалист Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СЭ_ДатаНачалаСтатуса");
		МассивНепроверяемыхРеквизитов.Добавить("СЭ_ДатаОкончанияСтатуса");
	КонецЕсли;
	//СЭ- Евгений [16498]
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры


&После("ПередЗаписью")
Процедура СЭ_ПередЗаписью(Отказ)
	
	//Перепроверяем что только одно высшее образование в котором признак молодого специалиста
	Если СЭ_МолодойСпециалист Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =  
			"ВЫБРАТЬ
			|	ОбразованиеФизическихЛиц.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ОбразованиеФизическихЛиц КАК ОбразованиеФизическихЛиц
			|ГДЕ
			|	ОбразованиеФизическихЛиц.Владелец = &Владелец
			|	И ОбразованиеФизическихЛиц.ПометкаУдаления = ЛОЖЬ
			|	И ОбразованиеФизическихЛиц.Ссылка <> &Ссылка
			|	И ОбразованиеФизическихЛиц.СЭ_МолодойСпециалист = ИСТИНА";
		
		Запрос.УстановитьПараметр("Владелец", Владелец);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ТекстОшибки = "Уже есть образование с признаком ""Молодой специалист"", может быть только одно образование с включенным признаком.";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

