   
//СЭ+ Евгений [15069]  в новом релизе нету процедуры, чтоб не исправлять везде сделал в расширении, после обновления ЦРМ удалить модуль
Процедура ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения, Коллекция = Неопределено)   Экспорт

	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения, Коллекция);

КонецПроцедуры 

Процедура ОбработатьТЧ(ТЧ, СтруктураДействий, КэшированныеЗначения) Экспорт

	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ТЧ, СтруктураДействий, КэшированныеЗначения);	

КонецПроцедуры
//СЭ- Евгений [15069]  в новом релизе нету процедуры, чтоб не исправлять везде сделал в расширении, после обновления ЦРМ удалить модуль