
&НаСервере
Процедура СЭ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//СЭ Ульяна 0016487
	СЭ_СоздатьЭлементыФормы();
	//СЭ Ульяна 0016487

КонецПроцедуры

&НаСервере
Процедура СЭ_СоздатьЭлементыФормы()

	//СЭ Ульяна 0016487
		
	Элементы.Код.Видимость          = Ложь;
	Элементы.Наименование.Видимость = Ложь;
	
	нЭлемент = Элементы.Добавить("СЭ_PartNumber", Тип("ПолеФормы"), Элементы.ГруппаШапка); 
	нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	нЭлемент.ПутьКДанным = "Объект.СЭ_PartNumber";
		
	нЭлемент = Элементы.Добавить("СЭ_Баркод", Тип("ПолеФормы"), Элементы.ГруппаШапка); 
	нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	нЭлемент.ПутьКДанным = "Объект.СЭ_Баркод";
	
	нЭлемент = Элементы.Вставить("СЭ_Наименование", Тип("ПолеФормы"), Элементы.ГруппаНаименование, Элементы.Наименование); 
	нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	нЭлемент.ПутьКДанным = "Объект.СЭ_Наименование";
    нЭлемент.УстановитьДействие("ПриИзменении", "СЭ_НаименованиеПриИзменении");

	нЭлемент = Элементы.Добавить("СЭ_НаименованиеАнгл", Тип("ПолеФормы"), Элементы.ГруппаНаименование); 
	нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	нЭлемент.ПутьКДанным = "Объект.СЭ_НаименованиеАнгл";

	Если Пользователи.РолиДоступны("СЭ_ПросмотрВсехКарточекНоменклатуры", Пользователи.ТекущийПользователь()) тогда
		нЭлемент = Элементы.Добавить("СЭ_РазрешеноИспользование", Тип("ПолеФормы"), Элементы.СворачиваемаяГруппаОсновныеПараметрыУчета); 
		нЭлемент.Вид = ВидПоляФормы.ПолеФлажка; 
		нЭлемент.ПутьКДанным = "Объект.СЭ_РазрешеноИспользование";	
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(Объект.Ссылка) тогда

	////Создание реквизитов
	//ДобавляемыеРеквизиты = Новый Массив; 
	//НовыйРеквизит = Новый РеквизитФормы("СЭ_Наличие",Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(15,3))); 
	//ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);     
	//НовыйРеквизит = Новый РеквизитФормы("СЭ_ВРезерве",Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(15,3))); 
	//ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	//ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	//
	//НовГруппа 							= Элементы.Добавить("СЭ_ДоступностьНоменклатуры", Тип("ГруппаФормы"), Элементы.СворачиваемаяГруппаОбеспечение);
	//НовГруппа.Вид 						= ВидГруппыФормы.ОбычнаяГруппа;
	//НовГруппа.Отображение 				= ОтображениеОбычнойГруппы.Нет;
	////НовГруппа.ОтображатьЗаголовок 		= Ложь;
	//НовГруппа.Группировка 				= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	//НовГруппа.Заголовок 				= "На " + Формат(ТекущаяДата(), "ДФ='dd.MM.yyyy ЧЧ:мм'");
	////НовГруппа.ЦветТекстаЗаголовка       = ЦветаСтиля.CRM_ЧерныйЦветТекста;
	//

	//нЭлемент                = Элементы.Вставить("СЭ_Наличие", Тип("ПолеФормы"), НовГруппа); 
	//нЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	//нЭлемент.Заголовок      = "Наличие";
	//нЭлемент.ПутьКДанным    = "СЭ_Наличие";
	//нЭлемент.ТолькоПросмотр = Истина;
	//
	//нЭлемент                = Элементы.Вставить("СЭ_ВРезерве", Тип("ПолеФормы"), НовГруппа); 
	//нЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	//нЭлемент.Заголовок      = "Резерв";
	//нЭлемент.ПутьКДанным    = "СЭ_ВРезерве";
	//нЭлемент.ТолькоПросмотр = Истина;

	//ОстаткиИДоступность = Справочники.Номенклатура.СЭ_ЗаполнитьДоступностьНоменклатуры(Объект.Ссылка);
	//ЭтаФорма.СЭ_Наличие  = ОстаткиИДоступность.СЭ_Наличие;
	//ЭтаФорма.СЭ_ВРезерве = ОстаткиИДоступность.СЭ_ВРезерве;
	//
	//КонецЕсли;
	
	//СЭ Ульяна 0016487

КонецПроцедуры

//СЭ Ульяна 0016487
&НаКлиенте
Процедура СЭ_НаименованиеПриИзменении(Элемент)
     Объект.Наименование = Объект.СЭ_Наименование;
КонецПроцедуры

&НаКлиенте
Процедура СЭ_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	
	Если Элементы.Найти("СЭ_РазрешеноИспользование") = Неопределено Тогда
		Объект.СЭ_РазрешеноИспользование = Истина;
	КонецЕсли;
	
КонецПроцедуры
//СЭ Ульяна 0016487
