
&ИзменениеИКонтроль("НоменклатураОбработкаПолученияДанныхВыбора")
Процедура СЭ_НоменклатураОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	// Получим структуру возможных полей отбора справочника номенклатуры
	СтруктураРеквизитов = ЗначениеНастроекПовтИсп.РеквизитыСправочника("Номенклатура");

	Запрос        = Новый Запрос;
	СтрокаПоиска  = Параметры.СтрокаПоиска;

	ТекстЗапроса =
	#Удаление
	"ВЫБРАТЬ ПЕРВЫЕ 50
	#КонецУдаления
	#Вставка
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 50
	#КонецВставки
	|	СпрНоменклатура.Ссылка,
	|	СпрНоменклатура.ПометкаУдаления КАК ПометкаУдаления,
	|	СпрНоменклатура.Наименование КАК ПредставлениеСовпадения,
	|	СпрНоменклатура.Качество.Порядок КАК Качество,
	|	0 КАК Порядок,
	|	СпрНоменклатура.Код КАК ПредставлениеНоменклатуры,
	|	СпрНоменклатура.ЭтоГруппа
	|ПОМЕСТИТЬ НоменклатураПоиск
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|ГДЕ
	#Удаление
	|	СпрНоменклатура.Наименование ПОДОБНО &СтрокаПоиска СПЕЦСИМВОЛ ""~""
    #КонецУдаления
	#Вставка
	|	СпрНоменклатура.СЭ_Наименование ПОДОБНО &СтрокаПоиска СПЕЦСИМВОЛ ""~""
    #КонецВставки
	|	И &УсловиеОтбора
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 50
	|	СпрНоменклатура.Ссылка,
	|	СпрНоменклатура.ПометкаУдаления КАК ПометкаУдаления,
	|	СпрНоменклатура.НаименованиеЯзык1 КАК ПредставлениеСовпадения,
	|	СпрНоменклатура.Качество.Порядок КАК Качество,
	|	1 КАК Порядок,
	|	СпрНоменклатура.Код КАК ПредставлениеНоменклатуры,
	|	СпрНоменклатура.ЭтоГруппа
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|ГДЕ
	|	&ИспользуютсяДопЯзыки = ИСТИНА
	|	И СпрНоменклатура.НаименованиеЯзык1 ПОДОБНО &СтрокаПоиска СПЕЦСИМВОЛ ""~""
	|	И &УсловиеОтбора
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 50
	|	СпрНоменклатура.Ссылка,
	|	СпрНоменклатура.ПометкаУдаления КАК ПометкаУдаления,
	|	СпрНоменклатура.НаименованиеЯзык2 КАК ПредставлениеСовпадения,
	|	СпрНоменклатура.Качество.Порядок КАК Качество,
	|	2 КАК Порядок,
	|	СпрНоменклатура.Код КАК ПредставлениеНоменклатуры,
	|	СпрНоменклатура.ЭтоГруппа
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|ГДЕ
	|	&ИспользуютсяДопЯзыки = ИСТИНА
	|	И СпрНоменклатура.НаименованиеЯзык2 ПОДОБНО &СтрокаПоиска СПЕЦСИМВОЛ ""~""
	|	И &УсловиеОтбора
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 50
	|	СпрНоменклатура.Ссылка,
	|	СпрНоменклатура.ПометкаУдаления,
	|	СпрНоменклатура.Код,
	|	СпрНоменклатура.Качество.Порядок,
	|	3,
	|	СпрНоменклатура.Наименование,
	|	NULL
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|ГДЕ
	|	СпрНоменклатура.Код ПОДОБНО &СтрокаПоиска СПЕЦСИМВОЛ ""~""
	|	И &УсловиеОтбора
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 50
	|	СпрНоменклатура.Ссылка,
	|	СпрНоменклатура.ПометкаУдаления,
	|	СпрНоменклатура.Артикул,
	|	СпрНоменклатура.Качество.Порядок,
	|	4,
	|	СпрНоменклатура.Наименование,
	|	NULL
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|ГДЕ
	|	СпрНоменклатура.Артикул ПОДОБНО &СтрокаПоиска СПЕЦСИМВОЛ ""~""
	|	И &УсловиеОтбора
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 50
	|	СпрНоменклатура.Ссылка,
	|	СпрНоменклатура.ПометкаУдаления,
	|	СпрНоменклатура.КодДляПоиска,
	|	СпрНоменклатура.Качество.Порядок,
	|	5,
	|	СпрНоменклатура.Наименование,
	|	NULL
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|ГДЕ
	|	СпрНоменклатура.КодДляПоиска ПОДОБНО &СтрокаПоиска СПЕЦСИМВОЛ ""~""
	|	И &УсловиеОтбора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НоменклатураПоиск.Ссылка,
	|	МИНИМУМ(НоменклатураПоиск.Порядок) КАК Порядок
	|ПОМЕСТИТЬ НоменклатураПоПорядку
	|ИЗ
	|	НоменклатураПоиск КАК НоменклатураПоиск
	|
	|СГРУППИРОВАТЬ ПО
	|	НоменклатураПоиск.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 50
	|	ЕСТЬNULL(НоменклатураПоиск.Качество, 0) КАК Качество,
	|	НоменклатураПоиск.ПометкаУдаления КАК ПометкаУдаления,
	|	НоменклатураПоиск.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(НоменклатураПоиск.Порядок, 0) КАК Порядок,
	|	ЕСТЬNULL(НоменклатураПоиск.ПредставлениеСовпадения, """") КАК ПредставлениеСовпадения,
	|	ЕСТЬNULL(НоменклатураПоиск.ПредставлениеНоменклатуры, """") КАК ПредставлениеНоменклатуры
	|ИЗ
	|	НоменклатураПоПорядку КАК НоменклатураПоПорядку
	|		ЛЕВОЕ СОЕДИНЕНИЕ НоменклатураПоиск КАК НоменклатураПоиск
	|		ПО НоменклатураПоПорядку.Ссылка = НоменклатураПоиск.Ссылка
	|			И НоменклатураПоПорядку.Порядок = НоменклатураПоиск.Порядок
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	Качество,
	|	ПредставлениеСовпадения,
	|	ПредставлениеНоменклатуры";

	УсловиеОтбора = "ИСТИНА";

	ИменаНестандартныхОтборов = Новый Структура;
	ИменаНестандартныхОтборов.Вставить("ТипНоменклатуры", "ТипНоменклатуры");

	Для Каждого КлючИЗначениеОтбора Из Параметры.Отбор Цикл
		ИмяОтбора = КлючИЗначениеОтбора.Ключ;
		ЗначениеОтбора = КлючИЗначениеОтбора.Значение;

		ИмяНестандартногоОтбора = "";
		Если ИменаНестандартныхОтборов.Свойство(ИмяОтбора, ИмяНестандартногоОтбора) Тогда

			Если ИмяНестандартногоОтбора = "ТипНоменклатуры" 
				И ТипЗнч(ЗначениеОтбора) = Тип("Массив")
				И ЗначениеОтбора.Найти(Перечисления.ТипыНоменклатуры.Набор) <> Неопределено Тогда

				ЗначениеОтбора = ОбщегоНазначения.СкопироватьРекурсивно(ЗначениеОтбора); // Копия для неизменности входящего параметра
				ЗначениеОтбора.Удалить(ЗначениеОтбора.Найти(Перечисления.ТипыНоменклатуры.Набор));
				Запрос.УстановитьПараметр("ТипНоменклатуры", ЗначениеОтбора);

				ОграничиватьНаборыПоУслугам = ЗначениеОтбора.Найти(Перечисления.ТипыНоменклатуры.Услуга) <> Неопределено
				ИЛИ ЗначениеОтбора.Найти(Перечисления.ТипыНоменклатуры.Работа) <> Неопределено;
				ОграничиватьНаборыПоТоварам = ЗначениеОтбора.Найти(Перечисления.ТипыНоменклатуры.МногооборотнаяТара) <> Неопределено
				ИЛИ ЗначениеОтбора.Найти(Перечисления.ТипыНоменклатуры.Товар) <> Неопределено;

				ТекстОтбора = "
				|	И (СпрНоменклатура.ТипНоменклатуры В (&ТипНоменклатуры)
				|		ИЛИ СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
				|			И &ТекстОграниченияНаборов 
				|			И СпрНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
				|		ИЛИ СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
				|			И СпрНоменклатура.ИспользованиеХарактеристик <> ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать))";

				Если ОграничиватьНаборыПоТоварам И НЕ ОграничиватьНаборыПоУслугам Тогда
					ТекстОтбора = СтрЗаменить(
					ТекстОтбора,
					"&ТекстОграниченияНаборов",
					"НЕ ВариантыКомплектацииНоменклатуры.СодержитУслуги И ВариантыКомплектацииНоменклатуры.СодержитТовары");
				ИначеЕсли НЕ ОграничиватьНаборыПоТоварам И ОграничиватьНаборыПоУслугам Тогда
					ТекстОтбора = СтрЗаменить(
					ТекстОтбора,
					"&ТекстОграниченияНаборов",
					"ВариантыКомплектацииНоменклатуры.СодержитУслуги И НЕ ВариантыКомплектацииНоменклатуры.СодержитТовары");
				Иначе
					ТекстОтбора = СтрЗаменить(
					ТекстОтбора,
					"&ТекстОграниченияНаборов",
					"ИСТИНА");
				КонецЕсли;

				УсловиеОтбора = УсловиеОтбора + ТекстОтбора;

				ОписаниеТаблицы = 
				СхемыЗапросов.ОписаниеТаблицы(
				Тип("ТаблицаСхемыЗапроса"),
				"Справочник.ВариантыКомплектацииНоменклатуры",
				"ВариантыКомплектацииНоменклатуры",
				"Владелец, СодержитТовары, СодержитУслуги");

				ОписаниеСоединения =
				СхемыЗапросов.ОписаниеСоединения(
				ОписаниеТаблицы,
				"СпрНоменклатура.Ссылка = ВариантыКомплектацииНоменклатуры.Владелец
				|И ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) = ВариантыКомплектацииНоменклатуры.Характеристика
				|И ВариантыКомплектацииНоменклатуры.Основной",
				ТипСоединенияСхемыЗапроса.ЛевоеВнешнее);

				ТекстЗапроса =
				СхемыЗапросов.ДобавитьСоединениеВЗапрос(
				ТекстЗапроса,
				"СпрНоменклатура",
				ОписаниеСоединения,
				0);

				Продолжить;

			КонецЕсли;

		КонецЕсли;

		Если СтруктураРеквизитов.Свойство(ИмяОтбора) Тогда
			УсловиеОтбора = УсловиеОтбора + "
			|	И СпрНоменклатура." + КлючИЗначениеОтбора.Ключ + " В (&" + КлючИЗначениеОтбора.Ключ + ")";
			Запрос.УстановитьПараметр(КлючИЗначениеОтбора.Ключ,КлючИЗначениеОтбора.Значение);
		КонецЕсли;

	КонецЦикла;

	Если НЕ Параметры.Отбор.Свойство("ЭтоГруппа") И Параметры.Свойство("ВыборГруппИЭлементов") Тогда
		Если Параметры.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Группы Тогда
			УсловиеОтбора = УсловиеОтбора + "
			|	И СпрНоменклатура.ЭтоГруппа";
		ИначеЕсли Параметры.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы Тогда
			УсловиеОтбора = УсловиеОтбора + "
			|	И НЕ СпрНоменклатура.ЭтоГруппа";
		КонецЕсли;
	КонецЕсли;

	Если Параметры.Свойство("ВыборТовараДругогоКачества")
		И Параметры.ВыборТовараДругогоКачества
		И Параметры.Свойство("ТоварИсходногоКачества") Тогда

		Запрос.УстановитьПараметр("ТоварИсходногоКачества", Параметры.ТоварИсходногоКачества);

		Если ПолучитьФункциональнуюОпцию("ИспользоватьОбобщенныйУчетНекачественныхТоваров") Тогда

			УсловиеОтбора = УсловиеОтбора + "
			|	И НЕ СпрНоменклатура.Качество = ЗНАЧЕНИЕ(Перечисление.ГрадацииКачества.Новый)";

			ПоляНоменклатуры = Новый Структура;
			ПоляНоменклатуры.Вставить("ВидНоменклатуры");
			ПоляНоменклатуры.Вставить("ИспользоватьСерии",           "ВидНоменклатуры.ИспользоватьСерии");
			ПоляНоменклатуры.Вставить("НастройкаИспользованияСерий", "ВидНоменклатуры.НастройкаИспользованияСерий");

			РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.ТоварИсходногоКачества, ПоляНоменклатуры);

			Если РеквизитыНоменклатуры.ИспользоватьСерии
				И Не РеквизитыНоменклатуры.НастройкаИспользованияСерий =
				Перечисления.НастройкиИспользованияСерийНоменклатуры.ЭкземплярТовара Тогда

				УсловиеОтбора = УсловиеОтбора + "
				|	И СпрНоменклатура.ВидНоменклатуры =
				|		 ВЫРАЗИТЬ(&ТоварИсходногоКачества КАК Справочник.Номенклатура).ВидНоменклатуры";

			КонецЕсли;

		Иначе

			ОписаниеТаблицы = 
			СхемыЗапросов.ОписаниеТаблицы(
			Тип("ТаблицаСхемыЗапроса"),
			"РегистрСведений.ТоварыДругогоКачества",
			"ТоварыДругогоКачества",
			"НоменклатураБрак, Номенклатура");

			ОписаниеСоединения =
			СхемыЗапросов.ОписаниеСоединения(
			ОписаниеТаблицы,
			"ТоварыДругогоКачества.НоменклатураБрак = СпрНоменклатура.Ссылка
			|И ТоварыДругогоКачества.Номенклатура = &ТоварИсходногоКачества",
			ТипСоединенияСхемыЗапроса.Внутреннее);

			ТекстЗапроса =
			СхемыЗапросов.ДобавитьСоединениеВЗапрос(
			ТекстЗапроса,
			"СпрНоменклатура",
			ОписаниеСоединения,
			0);

		КонецЕсли;

	КонецЕсли;

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеОтбора" ,УсловиеОтбора);

	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("СтрокаПоиска", ОбщегоНазначения.СформироватьСтрокуДляПоискаВЗапросе(СтрокаПоиска) + "%");
	Запрос.УстановитьПараметр("ИспользуютсяДопЯзыки", НЕ МультиязычностьПовтИсп.КонфигурацияИспользуетТолькоОдинЯзык(Ложь));

	ДанныеВыбора = Новый СписокЗначений;

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		ТекстЗначения = СокрП(Выборка.ПредставлениеСовпадения) + " (" + Выборка.ПредставлениеНоменклатуры + ")";

		ЗначениеСписка = Новый Структура;
		ЗначениеСписка.Вставить("Значение", Выборка.Ссылка);
		ЗначениеСписка.Вставить("ПометкаУдаления", Выборка.ПометкаУдаления);

		ДанныеВыбора.Добавить(ЗначениеСписка, ТекстЗначения);

	КонецЦикла; 	

КонецПроцедуры

&ИзменениеИКонтроль("СерииНоменклатурыОбработкаПолученияДанныхВыбора")
Процедура СЭ_СерииНоменклатурыОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Если Параметры.Свойство("ВидНоменклатуры") Тогда

		ТекстЗапроса =
		"ВЫБРАТЬ ПЕРВЫЕ 50
		|	СерииНоменклатуры.Ссылка КАК Серия,
		|	СерииНоменклатуры.Наименование КАК Наименование,
		|	&ТекстЗапросаПолейСерий
		|ИЗ
		|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
		|ГДЕ
		|	СерииНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры
		|	И &ТекстЗапросаУсловияПоПолямСерий
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер,
		|	ГоденДо";

		Запрос = Новый Запрос;
		Если Не Параметры.Свойство("НастройкиИспользованияСерий") Тогда
			НастройкиИспользованияСерий = Справочники.ВидыНоменклатуры.НастройкиИспользованияСерий(Параметры.ВидНоменклатуры);
		Иначе
			НастройкиИспользованияСерий = Параметры.НастройкиИспользованияСерий;
		КонецЕсли;

		Запрос.УстановитьПараметр("ВидНоменклатуры", НастройкиИспользованияСерий.ВладелецСерий);

		ШаблонТекстаУсловия = " 
		|		ВЫБОР
		|			КОГДА СерииНоменклатуры.ВидНоменклатуры.%ИмяНастройки%
		|				ТОГДА &РеквизитНеЗаполнен
		|						ИЛИ СерииНоменклатуры.%ИмяРеквизита% %ВидСравнения% &ЗначениеРеквизита
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";

		МассивТекстовУсловий = Новый Массив;
		ИменаРеквизитовСерий = Новый Массив;

		Для Каждого Реквизит Из НастройкиИспользованияСерий.ОписанияИспользованияРеквизитовСерии Цикл

			Если Реквизит.Использование
				И Реквизит.ИмяНастройки <> "ИспользоватьRFIDМеткиСерии" Тогда

				ТекстУсловия = СтрЗаменить(ШаблонТекстаУсловия, "%ИмяНастройки%", Реквизит.ИмяНастройки);
				ТекстУсловия = СтрЗаменить(ТекстУсловия, "%ИмяРеквизита%", Реквизит.ИмяРеквизита);
				ТекстУсловия = СтрЗаменить(ТекстУсловия, "&РеквизитНеЗаполнен", "&РеквизитНеЗаполнен" + Реквизит.ИмяРеквизита);
				ТекстУсловия = СтрЗаменить(ТекстУсловия, "&ЗначениеРеквизита", "&ЗначениеРеквизита" + Реквизит.ИмяРеквизита);

				Если ТипЗнч(Параметры[Реквизит.ИмяРеквизита]) = Тип("Строка") Тогда
					ТекстУсловия = СтрЗаменить(ТекстУсловия, "%ВидСравнения%", "ПОДОБНО");
					Запрос.УстановитьПараметр("РеквизитНеЗаполнен" + Реквизит.ИмяРеквизита, ПустаяСтрока(Параметры[Реквизит.ИмяРеквизита]));
					Запрос.УстановитьПараметр("ЗначениеРеквизита" + Реквизит.ИмяРеквизита, "%" + СокрЛП(Параметры[Реквизит.ИмяРеквизита]) + "%");
				Иначе
					ТекстУсловия = СтрЗаменить(ТекстУсловия, "%ВидСравнения%", "=");
					Запрос.УстановитьПараметр("РеквизитНеЗаполнен" + Реквизит.ИмяРеквизита, Не ЗначениеЗаполнено(Параметры[Реквизит.ИмяРеквизита]));
					Запрос.УстановитьПараметр("ЗначениеРеквизита" + Реквизит.ИмяРеквизита, Параметры[Реквизит.ИмяРеквизита]);
				КонецЕсли;

				МассивТекстовУсловий.Добавить(ТекстУсловия);

			КонецЕсли;

			ИменаРеквизитовСерий.Добавить(Реквизит.ИмяРеквизита);

		КонецЦикла;

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаПолейСерий",
		Обработки.ПодборСерийВДокументы.ТекстЗапросаРеквизитыСерий("СерииНоменклатуры", НастройкиИспользованияСерий, Ложь, Ложь));

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаУсловияПоПолямСерий", СтрСоединить(МассивТекстовУсловий, Символы.ПС + "И" + Символы.НПП));

		Запрос.Текст = ТекстЗапроса;

		ДанныеВыбора = Новый СписокЗначений;

		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл

			Значение = Новый Структура("Серия," + СтрСоединить(ИменаРеквизитовСерий, ","));
			ЗаполнитьЗначенияСвойств(Значение, Выборка);

			ДанныеВыбора.Добавить(Значение, Выборка.Наименование);

		КонецЦикла;

	ИначеЕсли Параметры.Свойство("Номенклатура")
		И ЗначениеЗаполнено(Параметры.Номенклатура) Тогда

		СтрокаПоиска = Параметры.СтрокаПоиска;

		Запрос = Новый Запрос;
		Запрос.Текст =
		#Удаление
		"ВЫБРАТЬ ПЕРВЫЕ 50
		#КонецУдаления
		#Вставка
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 50
		#КонецВставки
		|	СпрСерии.Ссылка КАК Серия,
		|	СпрСерии.Наименование КАК СерияПредставление
		|ИЗ
		|	Справочник.Номенклатура КАК СпрНоменклатура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СпрСерии
		|		ПО (СпрСерии.ВидНоменклатуры = ВЫБОР
		|				КОГДА СпрНоменклатура.ВидНоменклатуры.НастройкиСерийБерутсяИзДругогоВидаНоменклатуры
		|					ТОГДА СпрНоменклатура.ВидНоменклатуры.ВладелецСерий
		|				ИНАЧЕ СпрНоменклатура.ВидНоменклатуры
		|			КОНЕЦ)  
		|ГДЕ
		|	СпрНоменклатура.Ссылка = &Номенклатура
		|	" + ?(СтрокаПоиска = Неопределено, "", "И СпрСерии.Наименование ПОДОБНО &СтрокаПоиска СПЕЦСИМВОЛ ""~""") + "
		|УПОРЯДОЧИТЬ ПО
		|	СерияПредставление";

		Запрос.УстановитьПараметр("Номенклатура", Параметры.Номенклатура);

		Если СтрокаПоиска <> Неопределено Тогда
			Запрос.УстановитьПараметр("СтрокаПоиска", "%" + ОбщегоНазначения.СформироватьСтрокуДляПоискаВЗапросе(СокрЛП(СтрокаПоиска)) + "%");
		КонецЕсли;

		ДанныеВыбора = Новый СписокЗначений;

		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ДанныеВыбора.Добавить(Выборка.Серия, Выборка.СерияПредставление);
		КонецЦикла;

	ИначеЕсли Параметры.СтрокаПоиска <> Неопределено Тогда

		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 50
		|	СерииНоменклатуры.Ссылка КАК Серия,
		|	СерииНоменклатуры.Наименование КАК СерияПредставление,
		|	ЕСТЬNULL(ДвиженияСерийТоваров.Номенклатура, НЕОПРЕДЕЛЕНО) КАК Номенклатура,
		|	ЕСТЬNULL(ДвиженияСерийТоваров.Номенклатура.Представление, """") КАК НоменклатураПредставление,
		|	ЕСТЬNULL(ДвиженияСерийТоваров.Характеристика, НЕОПРЕДЕЛЕНО) КАК Характеристика,
		|	ЕСТЬNULL(ДвиженияСерийТоваров.Характеристика.Представление, """") КАК ХарактеристикаПредставление
		|ИЗ
		|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДвиженияСерийТоваров КАК ДвиженияСерийТоваров
		|		ПО (ДвиженияСерийТоваров.Серия = СерииНоменклатуры.Ссылка)
		|ГДЕ
		|	&УсловиеСравнения
		|
		|УПОРЯДОЧИТЬ ПО
		|	СерияПредставление,
		|	НоменклатураПредставление";

		УсловиеСравнения = "СерииНоменклатуры.Наименование %ВидСравнения% &СтрокаПоиска";

		Запрос = Новый Запрос;
		Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&УсловиеСравнения", 
		СтрЗаменить(УсловиеСравнения, "%ВидСравнения%", "="));
		Запрос.УстановитьПараметр("СтрокаПоиска", СокрЛП(Параметры.СтрокаПоиска));

		Результат = Запрос.Выполнить();

		Если Результат.Пустой() Тогда

			Запрос = Новый Запрос;
			Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&УсловиеСравнения", 
			СтрЗаменить(УсловиеСравнения, "%ВидСравнения%", "ПОДОБНО") + " СПЕЦСИМВОЛ ""~""");
			Запрос.УстановитьПараметр("СтрокаПоиска", "%" + ОбщегоНазначения.СформироватьСтрокуДляПоискаВЗапросе(СокрЛП(Параметры.СтрокаПоиска)) + "%");

			Результат = Запрос.Выполнить();

		КонецЕсли;

		Выборка = Результат.Выбрать();

		ДанныеВыбора = Новый СписокЗначений;

		Пока Выборка.Следующий() Цикл

			Если ЗначениеЗаполнено(Выборка.Номенклатура) Тогда

				ПредставлениеНоменклатуры = НоменклатураКлиентСервер.ПредставлениеНоменклатуры(
				Выборка.НоменклатураПредставление,
				Выборка.ХарактеристикаПредставление);

				ПредставлениеЗначения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 (%2)';
				|en = '%1 (%2)'"),
				Выборка.СерияПредставление,
				ПредставлениеНоменклатуры);
			Иначе

				ПредставлениеЗначения = Выборка.СерияПредставление;

			КонецЕсли; 

			ДанныеВыбора.Добавить(Выборка.Серия, ПредставлениеЗначения);
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры
