
&ИзменениеИКонтроль("РезультатПреобразованияСведенийОЮрЛице")
Функция СЭ_РезультатПреобразованияСведенийОЮрЛице(РезультатФормирования)

	РезультатПреобразования = НовыйРезультатПреообразованияДанныхКонтрагента();

	РезультатПреобразования.ИНН            = РезультатФормирования.ИНН;
	РезультатПреобразования.ОписаниеОшибки = РезультатФормирования.ОписаниеОшибки;

	//Наименование
	Если РезультатФормирования.Свойство("Наименование")
		И Не ПустаяСтрока(РезультатФормирования.Наименование) Тогда

		РезультатПреобразования.Наименование = РезультатФормирования.Наименование;

	ИначеЕсли РезультатФормирования.Свойство("НаименованиеПолное")
		И Не ПустаяСтрока(РезультатФормирования.НаименованиеПолное) Тогда

		РезультатПреобразования.Наименование = РезультатФормирования.НаименованиеПолное;

	КонецЕсли;

	//Наименование сокращенное
	Если РезультатФормирования.Свойство("НаименованиеСокращенное")
		И Не ПустаяСтрока(РезультатФормирования.НаименованиеСокращенное) Тогда

		РезультатПреобразования.НаименованиеСокращенное = РезультатФормирования.НаименованиеСокращенное;

	ИначеЕсли РезультатФормирования.Свойство("НаименованиеПолное")
		И Не ПустаяСтрока(РезультатФормирования.НаименованиеПолное) Тогда

		РезультатПреобразования.НаименованиеСокращенное = РезультатФормирования.ЕГРЮЛ.НаименованиеПолное;

	КонецЕсли;

	// Юридический адрес
	Если РезультатФормирования.Свойство("ЮридическийАдрес")
		И РезультатФормирования.ЮридическийАдрес <> Неопределено Тогда

		ДанныеЮридическогоАдреса = Новый Структура;
		ДанныеЮридическогоАдреса.Вставить("КонтактнаяИнформация", РезультатФормирования.ЮридическийАдрес.КонтактнаяИнформация);
		ДанныеЮридическогоАдреса.Вставить("Представление",        РезультатФормирования.ЮридическийАдрес.Представление);

		РезультатПреобразования.ЮридическийАдрес = ДанныеЮридическогоАдреса;

	КонецЕсли;

	// Телефон
	Если РезультатФормирования.Свойство("Телефон")
		И РезультатФормирования.Телефон <> Неопределено Тогда

		ДанныеТелефона = Новый Структура;
		ДанныеТелефона.Вставить("КонтактнаяИнформация", РезультатФормирования.Телефон.КонтактнаяИнформация);
		ДанныеТелефона.Вставить("Представление",        РезультатФормирования.Телефон.Представление);

		РезультатПреобразования.ЮридическийАдрес = ДанныеЮридическогоАдреса

	КонецЕсли;
	
	#Вставка
	//СЭ+ Евгений [15252] есть места где проверяется НаименованиеМеждународное но его тут нет
	НаименованиеМеждународное = "";
	Если РезультатПреобразования.Свойство("Наименование") Тогда
		НаименованиеМеждународное = РезультатПреобразования.Наименование;
	КонецЕсли;
	РезультатПреобразования.Вставить("НаименованиеМеждународное", НаименованиеМеждународное);
	//СЭ- Евгений [15252]
	#КонецВставки
	
	Возврат РезультатПреобразования;

КонецФункции
