
&ИзменениеИКонтроль("СведенияОЮридическомЛицеПоИНН")
Функция СЭ_СведенияОЮридическомЛицеПоИНН(Знач ИНН)

	ЗаписатьИнформациюВЖурналРегистрации(
	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Получение реквизитов юридического лица для УНП %1';
	|en = 'Receive business entity attributes for TIN %1'"),
	ИНН),
	"Контрагент",
	ДополнительноеСобытиеПолучениеДанных());

	РеквизитыОрганизации = НовыеРеквизитыЮридическогоЛица();
	РеквизитыОрганизации.ИНН = ИНН;  
	
	#Вставка
	//СЭ+ Евгений в ЦРМ обращается к ЕГРЮЛ если это Юр лицо, но этого тут нет, вероятно надо просто данные контрагента
	РеквизитыОрганизации.Вставить("ЕГРЮЛ", Неопределено);
	//СЭ- Евгений в ЦРМ обращается к ЕГРЮЛ если это Юр лицо, но этого тут нет, вероятно надо просто данные контрагента
	#КонецВставки
	
	ОписаниеОшибки = "";
	ОбъектXDTO     = Неопределено;

	Попытка

		Прокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси("http");
		HTTPСоединение = Новый HTTPСоединение("grp.nalog.gov.by/api/grp-public/",,,, Прокси);
		HTTPЗапрос = Новый HTTPЗапрос("data?unp=" + РеквизитыОрганизации.ИНН + "&charset=UTF-8&type=xml"); 
		HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);

		Если HTTPОтвет.КодСостояния <> 200 Тогда
			Возврат РеквизитыОрганизации;	
		КонецЕсли;	

		ЧтениеXML = Новый ЧтениеXML; 
		ЧтениеXML.УстановитьСтроку(HTTPОтвет.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8));
		ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);

		ОбработатьОшибкуСервиса(ОбъектXDTO, ОписаниеОшибки, "getCorporationRequisitesByINN", РеквизитыОрганизации);

		Если ЗначениеЗаполнено(РеквизитыОрганизации.ОписаниеОшибки) Тогда
			Возврат РеквизитыОрганизации;
		КонецЕсли;

		РеквизитыОрганизации.ДатаРегистрации = ОбъектXDTO.ROW.DREG;
		ЗаполнитьНаименованияЮридическогоЛица(ОбъектXDTO, РеквизитыОрганизации);
		ЗаполнитьЮридическийАдрес(ОбъектXDTO, РеквизитыОрганизации, ФабрикаXDTO);
		ЗаполнитьРегистрациюВНалоговомОргане(ОбъектXDTO, РеквизитыОрганизации);

	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки     = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='УНП %1:'"), РеквизитыОрганизации.ИНН)
		+ Символы.ПС + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);

	КонецПопытки;
	
	#Вставка
	//СЭ+ Евгений в ЦРМ обращается к ЕГРЮЛ если это Юр лицо, но этого тут нет, вероятно надо просто данные контрагента
	//ДанныеКонтрагента = ПартнерыИКонтрагентыЛокализация.РезультатПреобразованияСведенийОЮрЛице(РеквизитыОрганизации);
	//ДанныеКонтрагента.НаименованиеПолное 	= РеквизитыОрганизации.НаименованиеПолное;
	//ДанныеКонтрагента.ДатаРегистрации 		= СтроковыеФункцииКлиентСервер.СтрокаВДату(РеквизитыОрганизации.ДатаРегистрации);
	РеквизитыОрганизации.ЕГРЮЛ = РеквизитыОрганизации;
	//СЭ- Евгений в ЦРМ обращается к ЕГРЮЛ если это Юр лицо, но этого тут нет, вероятно надо просто данные контрагента
	#КонецВставки
	
	Возврат РеквизитыОрганизации;

КонецФункции
