
&НаСервере
&После("ПриСозданииНаСервере")
Процедура СЭ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СЭ_СоздатьРеквизитыФормы();
	СЭ_СоздатьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Процедура СЭ_СоздатьРеквизитыФормы()

	//СЭ+ Евгений [16920] для связи параметров выбора для реквизита счет организации
	НовыйРекв1 = Новый РеквизитФормы("СЭ_Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));

	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(НовыйРекв1);

	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	СЭ_ЗаполнитьОрганизациюПоУНП();
	//СЭ- Евгений [16920]

КонецПроцедуры

&НаСервере
Процедура СЭ_ЗаполнитьОрганизациюПоУНП()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.ПометкаУдаления = ЛОЖЬ
		|	И Организации.ИНН = &ИНН";
	
	Запрос.УстановитьПараметр("ИНН", "100177569");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭтотОбъект["СЭ_Организация"] = Выборка.Ссылка;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СЭ_СоздатьЭлементыФормы()

	//СЭ+ Евгений [16920] реквизиты по умолчанию в договоре с клиентом
	
	//Страница
	нСтраница = Элементы.Добавить("СЭ_СтраницаРеквизитыПоУмолчанию", Тип("ГруппаФормы"), Элементы.Страницы);
	нСтраница.Вид = ВидГруппыФормы.Страница;
	нСтраница.Заголовок = "Реквизиты по умолчанию";
	
	//Группа
	нГруппа = Элементы.Добавить("СЭ_ГруппаЗаполнениеВДоговореКонтрагента", Тип("ГруппаФормы"), Элементы.СЭ_СтраницаРеквизитыПоУмолчанию);
	нГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	нГруппа.Заголовок = "Заполнение реквизитов в договоре";
	нГруппа.ОтображатьЗаголовок = Истина;
	нГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	нГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	//Элементы
	нЭлемент = Элементы.Вставить("СЭ_ЗначениеВДоговор_Подразделение", Тип("ПолеФормы"), Элементы.СЭ_ГруппаЗаполнениеВДоговореКонтрагента); 
	нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	нЭлемент.ПутьКДанным = "Объект.СЭ_ЗначениеВДоговор_Подразделение";
	
	нЭлемент = Элементы.Вставить("СЭ_ЗначениеВДоговор_СчетОрганизации", Тип("ПолеФормы"), Элементы.СЭ_ГруппаЗаполнениеВДоговореКонтрагента); 
	нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	нЭлемент.ПутьКДанным = "Объект.СЭ_ЗначениеВДоговор_СчетОрганизации";
	
	НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "СЭ_Организация");
    НовыйМассив = Новый Массив();
    НовыйМассив.Добавить(НоваяСвязь);
    Элементы.СЭ_ЗначениеВДоговор_СчетОрганизации.СвязиПараметровВыбора = Новый ФиксированныйМассив(НовыйМассив);
    
	нЭлемент = Элементы.Вставить("СЭ_ЗначениеВДоговор_Валюта", Тип("ПолеФормы"), Элементы.СЭ_ГруппаЗаполнениеВДоговореКонтрагента); 
	нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	нЭлемент.ПутьКДанным = "Объект.СЭ_ЗначениеВДоговор_Валюта";
	
	нЭлемент = Элементы.Вставить("СЭ_ЗначениеВДоговор_ТипДоговора", Тип("ПолеФормы"), Элементы.СЭ_ГруппаЗаполнениеВДоговореКонтрагента); 
	нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	нЭлемент.ПутьКДанным = "Объект.СЭ_ЗначениеВДоговор_ТипДоговора";
	
	нЭлемент = Элементы.Вставить("СЭ_ЗначениеВДоговор_ДействуетС", Тип("ПолеФормы"), Элементы.СЭ_ГруппаЗаполнениеВДоговореКонтрагента); 
	нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	нЭлемент.ПутьКДанным = "Объект.СЭ_ЗначениеВДоговор_ДействуетС";
	
	//СЭ- Евгений [16920]
	
КонецПроцедуры
