				 
//СЭ+ Евгений [15069]  в новом релизе нету процедуры, чтоб не исправлять везде сделал в расширении, после обновления ЦРМ удалить модуль				 
Процедура ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения, ДополнительныеПараметрыЗаполнения = Неопределено) Экспорт
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения, ДополнительныеПараметрыЗаполнения);	
КонецПроцедуры
//СЭ- Евгений [15069]  в новом релизе нету процедуры, чтоб не исправлять везде сделал в расширении, после обновления ЦРМ удалить модуль