
&НаСервере
&ИзменениеИКонтроль("ЗаполнитьДанные")
Процедура СЭ_ЗаполнитьДанные()
	НастройкиМастера = ПолучитьСохраненныеНастройкиМастера();
	Если ТипЗнч(НастройкиМастера) <> Тип("Структура") Тогда
		НастройкиМастера = Неопределено;
	КонецЕсли;

	// Контактная информация справочника Партнеры.
	МассивРодителей = Новый Массив();
	МассивРодителей.Добавить(Справочники.ВидыКонтактнойИнформации.СправочникПартнеры);
	МассивРодителей.Добавить(Справочники.ВидыКонтактнойИнформации.CRM_СправочникПартнерыЧастноеЛицо);
	МассивРодителей.Добавить(Справочники.ВидыКонтактнойИнформации.CRM_СправочникПартнерыКомпания);
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации
	|ГДЕ
	|	Родитель В (&МассивРодителей)
	|	И НЕ ПометкаУдаления
	|	И НЕ ЭтоГруппа
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|");
	Запрос.УстановитьПараметр("МассивРодителей", МассивРодителей);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаРеквизитыПартнераКИ.Добавить();
		НоваяСтрока.Реквизит = Выборка.Ссылка;
		НоваяСтрока.Представление = Строка(Выборка.Ссылка);

		Если ТипЗнч(НастройкиМастера) = Тип("Структура")
			И НастройкиМастера.Свойство("ТаблицаРеквизитыПартнераКИ")
			И ТипЗнч(НастройкиМастера.ТаблицаРеквизитыПартнераКИ) = Тип("Массив") Тогда
			Если НастройкиМастера.ТаблицаРеквизитыПартнераКИ.Найти(НоваяСтрока.Реквизит) <> Неопределено Тогда
				НоваяСтрока.Пометка = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	// Контактная информация справочника КонтактныеЛицаПартнеров.
	МассивРодителей = Новый Массив();
	МассивРодителей.Добавить(Справочники.ВидыКонтактнойИнформации.СправочникКонтактныеЛицаПартнеров);
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации
	|ГДЕ
	|	Родитель В (&МассивРодителей)
	|	И НЕ ПометкаУдаления
	|	И НЕ ЭтоГруппа
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|");
	Запрос.УстановитьПараметр("МассивРодителей", МассивРодителей);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаРеквизитыКонтактногоЛицаКИ.Добавить();
		НоваяСтрока.Реквизит = Выборка.Ссылка;
		НоваяСтрока.Представление = Строка(Выборка.Ссылка);

		Если ТипЗнч(НастройкиМастера) = Тип("Структура")
			И НастройкиМастера.Свойство("ТаблицаРеквизитыКонтактногоЛицаКИ")
			И ТипЗнч(НастройкиМастера.ТаблицаРеквизитыКонтактногоЛицаКИ) = Тип("Массив") Тогда
			Если НастройкиМастера.ТаблицаРеквизитыКонтактногоЛицаКИ.Найти(НоваяСтрока.Реквизит) <> Неопределено Тогда
				НоваяСтрока.Пометка = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Если ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения") Тогда
		// Дополнительные реквизиты справочника Партнеры.
		МассивРеквизитов = Новый Массив();
		Для Каждого СтрокаТаблицы Из УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Партнеры_Общие").ДополнительныеРеквизиты Цикл
			Если МассивРеквизитов.Найти(СтрокаТаблицы.Свойство) = Неопределено Тогда
				МассивРеквизитов.Добавить(СтрокаТаблицы.Свойство);
				ДопРеквизитыОбщие.Добавить(СтрокаТаблицы.Свойство);
			КонецЕсли;
		КонецЦикла;
		#Удаление
		Для Каждого СтрокаТаблицы Из УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Партнеры_Компании_CRM").ДополнительныеРеквизиты Цикл
			Если МассивРеквизитов.Найти(СтрокаТаблицы.Свойство) = Неопределено Тогда
				МассивРеквизитов.Добавить(СтрокаТаблицы.Свойство);
				ДопРеквизитыЮрЛица.Добавить(СтрокаТаблицы.Свойство);
			КонецЕсли;
		КонецЦикла;
		#КонецУдаления
		#Вставка 
		//СЭ+ Евгений исправляем ошибки ЦРМ на версии ЕРП 22
		Если УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Партнеры_Компании_CRM") <> Неопределено Тогда
			Для Каждого СтрокаТаблицы Из УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Партнеры_Компании_CRM").ДополнительныеРеквизиты Цикл
				Если МассивРеквизитов.Найти(СтрокаТаблицы.Свойство) = Неопределено Тогда
					МассивРеквизитов.Добавить(СтрокаТаблицы.Свойство);
					ДопРеквизитыЮрЛица.Добавить(СтрокаТаблицы.Свойство);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		//СЭ- Евгений 
		#КонецВставки
		#Удаление
		Для Каждого СтрокаТаблицы Из УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Партнеры_ЧастныеЛица_CRM").ДополнительныеРеквизиты Цикл
			Если МассивРеквизитов.Найти(СтрокаТаблицы.Свойство) = Неопределено Тогда
				МассивРеквизитов.Добавить(СтрокаТаблицы.Свойство);
				ДопРеквизитыФизЛица.Добавить(СтрокаТаблицы.Свойство);
			КонецЕсли;
		КонецЦикла;
		#КонецУдаления
		#Вставка
		//СЭ+ Евгений исправляем ошибки ЦРМ на версии ЕРП 22
		Если УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Партнеры_ЧастныеЛица_CRM") <> Неопределено Тогда
			Для Каждого СтрокаТаблицы Из УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Партнеры_ЧастныеЛица_CRM").ДополнительныеРеквизиты Цикл
				Если МассивРеквизитов.Найти(СтрокаТаблицы.Свойство) = Неопределено Тогда
					МассивРеквизитов.Добавить(СтрокаТаблицы.Свойство);
					ДопРеквизитыФизЛица.Добавить(СтрокаТаблицы.Свойство);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		//СЭ- Евгений 
		#КонецВставки
		Для Каждого ДопРеквизитСсылка Из МассивРеквизитов Цикл
			НоваяСтрока = ТаблицаРеквизитыПартнераДополнительные.Добавить();
			НоваяСтрока.Реквизит = ДопРеквизитСсылка;
			НоваяСтрока.Представление = Строка(ДопРеквизитСсылка);

			Если ТипЗнч(НастройкиМастера) = Тип("Структура")
				И НастройкиМастера.Свойство("ТаблицаРеквизитыПартнераДополнительные")
				И ТипЗнч(НастройкиМастера.ТаблицаРеквизитыПартнераДополнительные) = Тип("Массив") Тогда
				Если НастройкиМастера.ТаблицаРеквизитыПартнераДополнительные.Найти(НоваяСтрока.Реквизит) <> Неопределено Тогда
					НоваяСтрока.Пометка = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

		// Дополнительные реквизиты справочника КонтактныеЛицаПартнеров.
		МассивРеквизитов = Новый Массив();
		Для Каждого СтрокаТаблицы Из УправлениеСвойствами.НаборСвойствПоИмени("Справочник_КонтактныеЛицаПартнеров").ДополнительныеРеквизиты Цикл
			Если МассивРеквизитов.Найти(СтрокаТаблицы.Свойство) = Неопределено Тогда
				МассивРеквизитов.Добавить(СтрокаТаблицы.Свойство);
			КонецЕсли;
		КонецЦикла;
		Для Каждого ДопРеквизитСсылка Из МассивРеквизитов Цикл
			НоваяСтрока = ТаблицаРеквизитыКонтактногоЛицаДополнительные.Добавить();
			НоваяСтрока.Реквизит = ДопРеквизитСсылка;
			НоваяСтрока.Представление = Строка(ДопРеквизитСсылка);

			Если ТипЗнч(НастройкиМастера) = Тип("Структура")
				И НастройкиМастера.Свойство("ТаблицаРеквизитыКонтактногоЛицаДополнительные")
				И ТипЗнч(НастройкиМастера.ТаблицаРеквизитыКонтактногоЛицаДополнительные) = Тип("Массив") Тогда
				Если НастройкиМастера.ТаблицаРеквизитыКонтактногоЛицаДополнительные.Найти(НоваяСтрока.Реквизит) <> Неопределено Тогда
					НоваяСтрока.Пометка = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;

	// Реквизиты справочников
	МассивИсключений = Новый Массив();
	МассивИсключений.Добавить("ЮрФизЛицо");
	МассивИсключений.Добавить("ДатаРегистрации");
	МассивИсключений.Добавить("Комментарий");
	МассивИсключений.Добавить("CRM_УчаствуетВАнкетировании");
	МассивИсключений.Добавить("сфпПользовательДляПереключенияЗвонков");
	Для Каждого РеквизитМд Из Метаданные.Справочники.Партнеры.Реквизиты Цикл
		Если МассивИсключений.Найти(РеквизитМд.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ТаблицаРеквизитыПартнераДополнительные.Добавить();
		НоваяСтрока.Реквизит = РеквизитМд.Имя;
		НоваяСтрока.Представление = РеквизитМд.Представление();
		Если ТипЗнч(НастройкиМастера) = Тип("Структура")
			И НастройкиМастера.Свойство("ТаблицаРеквизитыПартнераДополнительные")
			И ТипЗнч(НастройкиМастера.ТаблицаРеквизитыПартнераДополнительные) = Тип("Массив") Тогда
			Если НастройкиМастера.ТаблицаРеквизитыПартнераДополнительные.Найти(НоваяСтрока.Реквизит) <> Неопределено Тогда
				НоваяСтрока.Пометка = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	МассивИсключений = Новый Массив();
	МассивИсключений.Добавить("ДатаРегистрацииСвязи");
	МассивИсключений.Добавить("сфпПользовательДляПереключенияЗвонков");
	МассивИсключений.Добавить("CRM_УчаствуетВАнкетировании");
	МассивИсключений.Добавить("CRM_НапоминатьОДнеРождения");
	Для Каждого РеквизитМд Из Метаданные.Справочники.КонтактныеЛицаПартнеров.Реквизиты Цикл
		Если МассивИсключений.Найти(РеквизитМд.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ТаблицаРеквизитыКонтактногоЛицаДополнительные.Добавить();
		НоваяСтрока.Реквизит = РеквизитМд.Имя;
		НоваяСтрока.Представление = РеквизитМд.Представление();
		Если ТипЗнч(НастройкиМастера) = Тип("Структура")
			И НастройкиМастера.Свойство("ТаблицаРеквизитыКонтактногоЛицаДополнительные")
			И ТипЗнч(НастройкиМастера.ТаблицаРеквизитыКонтактногоЛицаДополнительные) = Тип("Массив") Тогда
			Если НастройкиМастера.ТаблицаРеквизитыКонтактногоЛицаДополнительные.Найти(НоваяСтрока.Реквизит) <> Неопределено Тогда
				НоваяСтрока.Пометка = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Если ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения") Тогда
		// Реквизиты дополнительной информации справочника Партнеры.
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	ДополнительнаяИнформация.Ссылка КАК Ссылка,
		|	ДополнительнаяИнформация.Наименование КАК Наименование
		|ИЗ
		|	ПланВидовХарактеристик.CRM_ДополнительнаяИнформация КАК ДополнительнаяИнформация
		|ГДЕ
		|	НЕ ДополнительнаяИнформация.ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО
		|	ДополнительнаяИнформация.Наименование
		|");
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ТаблицаРеквизитыПартнераДополнительные.Добавить();
			НоваяСтрока.Реквизит = Выборка.Ссылка;
			НоваяСтрока.Представление = Выборка.Наименование;
			Если ТипЗнч(НастройкиМастера) = Тип("Структура")
				И НастройкиМастера.Свойство("ТаблицаРеквизитыПартнераДополнительные")
				И ТипЗнч(НастройкиМастера.ТаблицаРеквизитыПартнераДополнительные) = Тип("Массив") Тогда
				Если НастройкиМастера.ТаблицаРеквизитыПартнераДополнительные.Найти(НоваяСтрока.Реквизит) <> Неопределено Тогда
					НоваяСтрока.Пометка = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	// Таблица РеквизитыПоискаДублейПартнеров
	РеквизитыПоискаДублейПартнеров.Добавить("Наименование;ПОДОБНО",				НСтр("ru='Наименование';en='Name'"));
	РеквизитыПоискаДублейПартнеров.Добавить("НаименованиеПолное;ПОДОБНО",
	НСтр("ru='Наименование полное';en='Full name'"));
	РеквизитыПоискаДублейПартнеров.Добавить("CRM_ИНН;=",						НСтр("ru='ИНН';en='TIN'"));
	РеквизитыПоискаДублейПартнеров.Добавить("Контакт_Адрес;ПОДОБНО",			НСтр("ru='Адрес';en='Address'"));
	РеквизитыПоискаДублейПартнеров.Добавить("Контакт_АдресЭлектроннойПочты;=",	НСтр("ru='Email';en='Email'"));
	РеквизитыПоискаДублейПартнеров.Добавить("Контакт_Телефон;=",				НСтр("ru='Телефон';en='Phone'"));

	Если ТипЗнч(НастройкиМастера) = Тип("Структура")
		И НастройкиМастера.Свойство("РеквизитыПоискаДублейПартнеров")
		И ТипЗнч(НастройкиМастера.РеквизитыПоискаДублейПартнеров) = Тип("Массив") Тогда
		Для Каждого ЭлементСписка Из РеквизитыПоискаДублейПартнеров Цикл
			Если НастройкиМастера.РеквизитыПоискаДублейПартнеров.Найти(ЭлементСписка.Значение) <> Неопределено Тогда
				ЭлементСписка.Пометка = Истина;
			КонецЕсли;
		КонецЦикла;
	Иначе
		ЗначениеХранилища = Константы.CRM_РеквизитыПоискаДублейПартнеров.Получить();
		РеквизитыПоиска = ЗначениеХранилища.Получить();
		Если ТипЗнч(РеквизитыПоиска) = Тип("СписокЗначений") Тогда
			Для Каждого ЭлементСписка Из РеквизитыПоиска Цикл
				НайденныйЭлемент = РеквизитыПоискаДублейПартнеров.НайтиПоЗначению(ЭлементСписка.Значение);
				Если НайденныйЭлемент <> Неопределено Тогда
					НайденныйЭлемент.Пометка = ЭлементСписка.Пометка;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	ВедетсяИсторияРеквизитовКлиентов = Истина; //ПолучитьФункциональнуюОпцию("CRM_ВестиИсториюРеквизитовКлиентов");
	ВедетсяИсторияПотенциалаКлиента = Ложь;
	ВедетсяИсторияРеквизитовВлияющихНаПотенциалКлиента = Ложь;
	РеквизитыРасчетаПотенциалаКлиента = Неопределено;
	Если ВедетсяИсторияРеквизитовКлиентов Тогда
		ВерсионируемыеРеквизиты =
		РегистрыСведений.CRM_НастройкаВерсионированияРеквизитовПартнеров.ПолучитьСписокВерсионируемыхРеквизитов();
		Если ВерсионируемыеРеквизиты.НайтиПоЗначению("CRM_Потенциал") <> Неопределено Тогда
			ВедетсяИсторияПотенциалаКлиента = Истина;
		КонецЕсли;
		Если ВедетсяИсторияПотенциалаКлиента Тогда
			РеквизитыРасчетаПотенциалаКлиента = CRM_КлиентыСервер.ПолучитьРеквизитыРасчетаПотенциалаКлиента();
			Для Каждого ВерсионируемыйРеквизит Из ВерсионируемыеРеквизиты Цикл
				Если РеквизитыРасчетаПотенциалаКлиента.Реквизиты.Найти(ВерсионируемыйРеквизит.Значение) <> Неопределено Тогда
					ВедетсяИсторияРеквизитовВлияющихНаПотенциалКлиента = Истина;
					Прервать;
				КонецЕсли;
				Если РеквизитыРасчетаПотенциалаКлиента.ДополнительныеРеквизиты.Найти(ВерсионируемыйРеквизит.Значение) <> Неопределено Тогда
					ВедетсяИсторияРеквизитовВлияющихНаПотенциалКлиента = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Если РеквизитыРасчетаПотенциалаКлиента = Неопределено Тогда
		РеквизитыРасчетаПотенциалаКлиента = CRM_КлиентыСервер.ПолучитьРеквизитыРасчетаПотенциалаКлиента();
	КонецЕсли;
	СтрСоставРеквизитов = "";
	МдПартнеры = Метаданные.Справочники.Партнеры;
	нСчетчикПереноса = 0;
	Для Каждого ИмяРеквизита Из РеквизитыРасчетаПотенциалаКлиента.Реквизиты Цикл
		НайденныйРеквизит = МдПартнеры.Реквизиты.Найти(ИмяРеквизита);
		Если НайденныйРеквизит <> Неопределено Тогда
			ПредставлениеРеквизита = НайденныйРеквизит.Представление();
			Если Не ЗначениеЗаполнено(ПредставлениеРеквизита) Тогда
				ПредставлениеРеквизита = ИмяРеквизита;
			КонецЕсли;
			СтрСоставРеквизитов = СтрСоставРеквизитов + ?(ЗначениеЗаполнено(СтрСоставРеквизитов), ", ", "");
			Если нСчетчикПереноса % 5 = 0 Тогда
				СтрСоставРеквизитов = СтрСоставРеквизитов + ?(ЗначениеЗаполнено(СтрСоставРеквизитов), Символы.ПС, "");
			КонецЕсли;
			СтрСоставРеквизитов = СтрСоставРеквизитов + """" + ПредставлениеРеквизита + """";
			нСчетчикПереноса = нСчетчикПереноса + 1;
		КонецЕсли;
	КонецЦикла;
	Для Каждого ДопРеквизитСсылка Из РеквизитыРасчетаПотенциалаКлиента.ДополнительныеРеквизиты Цикл
		Если ЗначениеЗаполнено(ДопРеквизитСсылка) Тогда
			СтрСоставРеквизитов = СтрСоставРеквизитов + ?(ЗначениеЗаполнено(СтрСоставРеквизитов), ", ", "");
			Если нСчетчикПереноса % 5 = 0 Тогда
				СтрСоставРеквизитов = СтрСоставРеквизитов + ?(ЗначениеЗаполнено(СтрСоставРеквизитов), Символы.ПС, "");
			КонецЕсли;
			СтрСоставРеквизитов = СтрСоставРеквизитов + """" + ДопРеквизитСсылка.Заголовок + """";
			нСчетчикПереноса = нСчетчикПереноса + 1;
		КонецЕсли;
	КонецЦикла;
	СтрСоставРеквизитов = СтрСоставРеквизитов + ?(ЗначениеЗаполнено(СтрСоставРеквизитов), ".", "");
	Элементы.ДекорацияКонтрольПотенциалаФлагИзменилисьРеквизитыВлияющиеНаПотенциалСоставРеквизитов.Заголовок =
	СтрСоставРеквизитов;
	// Проект
	Если ТипЗнч(НастройкиМастера) = Тип("Структура") И НастройкиМастера.Свойство("Проект")
		И ТипЗнч(НастройкиМастера.Проект) = Тип("СправочникСсылка.Проекты") Тогда
		Проект = НастройкиМастера.Проект;
	КонецЕсли;
	// КонтрольПотенциалаФлагБезЗаполненногоПотенциала
	Если ТипЗнч(НастройкиМастера) = Тип("Структура")
		И НастройкиМастера.Свойство("КонтрольПотенциалаФлагБезЗаполненногоПотенциала")
		И ТипЗнч(НастройкиМастера.КонтрольПотенциалаФлагБезЗаполненногоПотенциала) = Тип("Булево") Тогда
		КонтрольПотенциалаФлагБезЗаполненногоПотенциала = НастройкиМастера.КонтрольПотенциалаФлагБезЗаполненногоПотенциала;
	Иначе
		КонтрольПотенциалаФлагБезЗаполненногоПотенциала = Истина;
	КонецЕсли;
	// КонтрольПотенциалаФлагИзменилисьРеквизитыВлияющиеНаПотенциал
	Если ВедетсяИсторияРеквизитовВлияющихНаПотенциалКлиента Тогда
		Если ТипЗнч(НастройкиМастера) = Тип("Структура")
			И НастройкиМастера.Свойство("КонтрольПотенциалаФлагИзменилисьРеквизитыВлияющиеНаПотенциал")
			И ТипЗнч(НастройкиМастера.КонтрольПотенциалаФлагИзменилисьРеквизитыВлияющиеНаПотенциал) = Тип("Булево") Тогда
			КонтрольПотенциалаФлагИзменилисьРеквизитыВлияющиеНаПотенциал =
			НастройкиМастера.КонтрольПотенциалаФлагИзменилисьРеквизитыВлияющиеНаПотенциал;
		Иначе
			КонтрольПотенциалаФлагИзменилисьРеквизитыВлияющиеНаПотенциал = Истина;
		КонецЕсли;
	Иначе
		КонтрольПотенциалаФлагИзменилисьРеквизитыВлияющиеНаПотенциал = Ложь;
	КонецЕсли;
	// КонтрольРегистрацииКлиентовФлагСобытия
	Если ТипЗнч(НастройкиМастера) = Тип("Структура")
		И НастройкиМастера.Свойство("КонтрольРегистрацииКлиентовФлагСобытия")
		И ТипЗнч(НастройкиМастера.КонтрольРегистрацииКлиентовФлагСобытия) = Тип("Булево") Тогда
		КонтрольРегистрацииКлиентовФлагСобытия = НастройкиМастера.КонтрольРегистрацииКлиентовФлагСобытия;
	Иначе
		КонтрольРегистрацииКлиентовФлагСобытия = Истина;
	КонецЕсли;
	// КонтрольРегистрацииКлиентовФлагЭлектронныеПисьма
	Если ТипЗнч(НастройкиМастера) = Тип("Структура")
		И НастройкиМастера.Свойство("КонтрольРегистрацииКлиентовФлагЭлектронныеПисьма")
		И ТипЗнч(НастройкиМастера.КонтрольРегистрацииКлиентовФлагЭлектронныеПисьма) = Тип("Булево") Тогда
		КонтрольРегистрацииКлиентовФлагЭлектронныеПисьма = НастройкиМастера.КонтрольРегистрацииКлиентовФлагЭлектронныеПисьма;
	Иначе
		КонтрольРегистрацииКлиентовФлагЭлектронныеПисьма = Истина;
	КонецЕсли;

	ИспользоватьГруппыПользователей = ПолучитьФункциональнуюОпцию("ИспользоватьГруппыПользователей");

	ВидКонтроля = Перечисления.CRM_ВидыМастераПроверкиКлиентскойБазы.ЗаполнениеКонтактнойИнформации;

	Проверяющий = Пользователи.ТекущийПользователь();

	ПользовательСеанса = Пользователи.ТекущийПользователь();

	УстановитьЗаголовокОтборДляКИ();
	УстановитьЗаголовокОтборДляДопРеквизитов();
	УстановитьЗаголовокОтборДляДублирующихсяРеквизитов();
КонецПроцедуры
