
&ИзменениеИКонтроль("Форма_ПриСозданииНаСервере")
Процедура СЭ_Форма_ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка)

	стрИмяФормы = ЭтаФорма.ИмяФормы;

	Если стрИмяФормы = "Обработка.CRM_ПанельАдминистрированияCRM.Форма.РазделСторонниеСервисы" Тогда
		Обр_CRM_ПанельАдминистрированияCRM_РазделСторонниеСервисы(ЭтаФорма, Отказ, СтандартнаяОбработка);
	КонецЕсли;

	Если стрИмяФормы = "Справочник.Партнеры.Форма.CRM_Модуль_ФормаБыстрогоВвода" Тогда
		Спр_Партнеры_CRM_Модуль_ФормаБыстрогоВвода(ЭтаФорма, Отказ, СтандартнаяОбработка);
	КонецЕсли;

	#Удаление
	Если стрИмяФормы = "Справочник.Партнеры.Форма.CRM_Модуль_ФормаЭлементаРеквизитыКонтрагента" Тогда
	#КонецУдаления
	#Вставка
	//СЭ+ Евгений [15069] Нету такой формы больше
	//Если стрИмяФормы = "Справочник.Партнеры.Форма.CRM_Модуль_ФормаЭлементаРеквизитыКонтрагента" Тогда
	Если стрИмяФормы = "Справочник.Партнеры.Форма.CRM_Модуль_ФормаЭлементаРеквизитыКонтрагентаНовая" Тогда
	//СЭ- Евгений [15069] Нету такой формы больше
	#КонецВставки
		Спр_Партнеры_CRM_Модуль_ФормаЭлементаРеквизитыКонтрагента(ЭтаФорма, Отказ, СтандартнаяОбработка);
	КонецЕсли;

	Если стрИмяФормы = "Справочник.Партнеры.Форма.CRM_Модуль_ФормаЭлементаРеквизитыКонтрагентаНовая" Тогда
		Спр_Партнеры_CRM_Модуль_ФормаЭлементаРеквизитыКонтрагентаНовая(ЭтаФорма, Отказ, СтандартнаяОбработка);
	КонецЕсли;

	Если стрИмяФормы = "Справочник.Партнеры.Форма.CRM_Модуль_ФормаСписка" Тогда
		Спр_Партнеры_CRM_Модуль_ФормаСписка(ЭтаФорма, Отказ, СтандартнаяОбработка);
	КонецЕсли;

	Если стрИмяФормы = "Документ.CRM_Интерес.Форма.ФормаДокументаНовая" Тогда
		Док_CRM_Интерес_ФормаДокументаНовая(ЭтаФорма, Отказ, СтандартнаяОбработка);
	КонецЕсли;

	Попытка

		Если ТипЗнч(ЭтаФорма.ПараметрыПодключаемыхКоманд) = Тип("Структура")и ЭтаФорма.ПараметрыПодключаемыхКоманд.Свойство("ПодменюСУсловиямиВидимости") Тогда
			Для Каждого ЭлементСтруктуры из ЭтаФорма.ПараметрыПодключаемыхКоманд.ПодменюСУсловиямиВидимости Цикл

				Если ЭлементСтруктуры.Имя = "ПодменюОбновлениеВерсииИБ" и ЭлементСтруктуры.КомандыСУсловиямиВидимости.Количество()>0 Тогда
					ЭлементСтруктуры.КомандыСУсловиямиВидимости.Очистить();
				КонецЕсли;

			КонецЦикла;
		КонецЕсли;
	Исключение

	КонецПопытки;

КонецПроцедуры
