
//СЭ Ульяна 0016747
	 
&НаСервере
&После("ПриСозданииНаСервере")
Процедура СЭ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СЭ_СоздатьЭлементыФормы();
КонецПроцедуры

&НаСервере
Процедура СЭ_СоздатьЭлементыФормы()

	 НоваяКоманда = ЭтаФорма.Команды.Добавить("СЭ_ЗаполнитьПоДаннымСемьи");
	 НоваяКоманда.Действие = "СЭ_ЗаполнитьПоДаннымСемьи";  
	 
	 НовыйЭлемент = Элементы.Добавить("СЭ_ЗаполнитьПоДаннымСемьи", Тип("КнопкаФормы"), Элементы.ВычетыНаДетей.КоманднаяПанель);
	 НовыйЭлемент.ИмяКоманды = "СЭ_ЗаполнитьПоДаннымСемьи";
	 НовыйЭлемент.Заголовок  = "Заполнить по данным семьи";
		
КонецПроцедуры

&НаКлиенте
Процедура СЭ_ЗаполнитьПоДаннымСемьи(Команда)

	Если Объект.ВычетыНаДетей.Количество() > 0 Тогда
		Оп = Новый ОписаниеОповещения("СЭ_ЗаполнитьПоДаннымСемьиЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оп, "Данные о вычетах будут перезаполнены. Продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		СЭ_ЗаполнитьПоДаннымСемьиНаСервере();	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СЭ_ЗаполнитьПоДаннымСемьиЗавершение(Результат, ДопПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		СЭ_ЗаполнитьПоДаннымСемьиНаСервере();	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СЭ_ЗаполнитьПоДаннымСемьиНаСервере()
	
	Объект.ВычетыНаДетей.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоставыСемейФизическихЛиц.ФИО КАК ФИО,
		|	СоставыСемейФизическихЛиц.ДатаРождения КАК ДатаРождения,
		|	ДОБАВИТЬКДАТЕ(СоставыСемейФизическихЛиц.ДатаРождения, ГОД, 18) КАК ДействуетДо
		|ПОМЕСТИТЬ втТЧ
		|ИЗ
		|	РегистрСведений.СоставыСемейФизическихЛиц КАК СоставыСемейФизическихЛиц
		|ГДЕ
		|	СоставыСемейФизическихЛиц.ФизическоеЛицо = &ФизическоеЛицо
		|	И СоставыСемейФизическихЛиц.СтепеньРодства В(&СтепеньРодства)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТЧ.ФИО КАК ФИО,
		|	втТЧ.ДатаРождения КАК ДатаРождения,
		|	втТЧ.ДействуетДо КАК ДействуетДо
		|ИЗ
		|	втТЧ КАК втТЧ
		|ГДЕ
		|	втТЧ.ДействуетДо > &ВыбранныйМесяц
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДействуетДо";
	
	МассивСтепениРодства = Новый Массив;
	МассивСтепениРодства.Добавить(Справочники.СтепениРодстваФизическихЛиц.НайтиПоНаименованию("Сын", Истина));
	МассивСтепениРодства.Добавить(Справочники.СтепениРодстваФизическихЛиц.НайтиПоНаименованию("Дочь", Истина));

	Запрос.УстановитьПараметр("ФизическоеЛицо"	, Объект.Сотрудник);
	Запрос.УстановитьПараметр("ВыбранныйМесяц"	, Объект.Месяц);
	Запрос.УстановитьПараметр("СтепеньРодства"	, МассивСтепениРодства);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
	
		Если Выборка.Количество() > 1 Тогда
			КодВычета = ПредопределенноеЗначение("Справочник.ВидыВычетовНДФЛ.Код611");
		Иначе
			КодВычета = ПредопределенноеЗначение("Справочник.ВидыВычетовНДФЛ.Код610");
		КонецЕсли;
		
		Выборка.Следующий();
		НовСтрока = Объект.ВычетыНаДетей.Добавить();
		НовСтрока.КодВычета 	= КодВычета;  
		//НовСтрока.КодВычетаИнфо = КодВычета.Наименование;
		НовСтрока.ДействуетДо 	= Выборка.ДействуетДо;
		
		ОбновитьОписаниеВычетовНаДетей();
		//УстановитьИнформационнуюНадписьОВозможностиПроведения();

	Иначе
		Сообщить("В карточке сотрудника не найдено данных о детях");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СЭ_ФизическоеЛицоПриИзмененииПосле(Элемент)

	Объект.ВычетыНаДетей.Очистить();
	
КонецПроцедуры

//СЭ Ульяна 0016747
