
&НаСервере
&После("ПриСозданииНаСервере")
Процедура СЭ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//СЭ+ Евгений [15069] Ошибка в запросе дин. списка, подробнее в 14663
	СЭ_ИзменитьЗапросСписка();
	//СЭ- Евгений [15069] Ошибка в запросе дин. списка, подробнее в 14663

КонецПроцедуры

//СЭ+ Евгений [15069] Ошибка в запросе дин. списка, подробнее в 14663
&НаСервере
Процедура СЭ_ИзменитьЗапросСписка()

	ТекстЗапроса = Список.ТекстЗапроса;
	
	СтрокаПоиска = "ВЫБРАТЬ
					|		СправочникРолиИсполнителейПереопределяемый.Ссылка,";
	
	СтрокаЗамены = "ВЫБРАТЬ РАЗЛИЧНЫЕ
					|		СправочникРолиИсполнителейПереопределяемый.Ссылка,";
	
	НовыйТекстЗапроса = СтрЗаменить(ТекстЗапроса, СтрокаПоиска, СтрокаЗамены);
	
	Список.ТекстЗапроса = НовыйТекстЗапроса;
	
КонецПроцедуры
//СЭ- Евгений [15069] Ошибка в запросе дин. списка, подробнее в 14663