						

&НаСервере
&Перед("ПриПолученииДанныхНаСервере")
Процедура СЭ_ПриПолученииДанныхНаСервере(ТекущийОбъект)
	//+СЭ Пилипчук 0016039
	СЭ_РаботаСФормамиСервер.СЭ_СоздатьРеквизитыСерияИНомерПоСерииВкадровыхДокументах(Элементы, "ГруппаНомерДатаПриказаОПриеме", ТекущийОбъект.Ссылка); 
	//-СЭ Пилипчук 0016039
КонецПроцедуры

&НаКлиенте
Процедура СЭ_ДатаПриИзмененииПосле(Элемент)
	СЭ_ДатаПриИзмененииПослеНаСервере();
КонецПроцедуры 

&НаСервере
Процедура СЭ_ДатаПриИзмененииПослеНаСервере()
	
	//СЭ Пилипчук 0016039	
	СЭ_ОбщегоНазначенияВызовСервераПривилегированный.ВыдатьСообщениеОчисткиСерииИНомераПриИзмененииДаты(Объект); 	
	//СЭ Пилипчук 0016039
	
КонецПроцедуры

