
#Область ОбработчикиСобытийФормыСотрудника

&ИзменениеИКонтроль("СотрудникиПриСозданииНаСервере")
Процедура СЭ_СотрудникиПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка)

	Если Форма.Параметры.Ключ.Пустая() Тогда
		ДобавитьРеквизитыВФормеСотрудника(Форма);
	КонецЕсли;

	СотрудникиФормыБазовый.СотрудникиПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);

	// Инициализация формы

	Если Форма.Параметры.Свойство("РежимОткрытияОкна") 
		И ЗначениеЗаполнено(Форма.Параметры.РежимОткрытияОкна) Тогда

		Форма.РежимОткрытияОкна = Форма.Параметры.РежимОткрытияОкна;

	КонецЕсли;

	Если Форма.Параметры.Ключ.Пустая() Тогда

		Если НЕ ЗначениеЗаполнено(Форма.Сотрудник.ГоловнаяОрганизация) Тогда
			Форма.Сотрудник.ГоловнаяОрганизация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.Параметры.Организация, "ГоловнаяОрганизация");
		КонецЕсли;

	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ГосударственнаяСлужбаФормы");
		Модуль.ФормаСотрудникаДобавитьЭлементыФормы(Форма);
	КонецЕсли; 

	// Заполнение КОРП функциональности
	// Кадровый резерв
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйРезерв") Тогда
		МодульФормы = ОбщегоНазначения.ОбщийМодуль("КадровыйРезервФормы");
		МодульФормы.СоздатьКомандуКадровыйРезервВФорме(Форма, Форма.Элементы.ГруппаКадровыйРезерв);
	КонецЕсли;

	// Охрана труда
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда") Тогда
		МодульФормы = ОбщегоНазначения.ОбщийМодуль("ОхранаТрудаФормы");
		МодульФормы.СоздатьКомандуОхранаТрудаВФормеСотрудника(Форма, Форма.Элементы.ГруппаОхранаТруда);
	КонецЕсли;

	// Льготы сотрудников
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ЛьготыСотрудников") Тогда
		МодульФормы = ОбщегоНазначения.ОбщийМодуль("ЛьготыСотрудников");
		МодульФормы.СоздатьКомандуИндивидуальныеЛьготыВФормеСотрудника(Форма, Форма.Элементы.ГруппаИндивидуальныеЛьготы);
	КонецЕсли;
	
#Вставка

	// СЭ+ Немкович [15627] - 	добавление в форму справочника "Сотрудники" поля-ссылки на фотографию физлица;
	// 							алгоритм добавления фотографии (поля) аналогичен алгоритму при создании формы
	// 							элемента справочника "ФизическиеЛица" с незначительными корректировками
	МассивРеквизитов = Новый Массив;
	РеквизитАдресФотографии = Новый РеквизитФормы("АдресФотографии", Новый ОписаниеТипов("Строка"));
	МассивРеквизитов.Добавить(РеквизитАдресФотографии);
	
	Форма.ИзменитьРеквизиты(МассивРеквизитов);
	
	//Форма.АдресФотографии = КадровыйУчетРасширенный.АдресФотографииФизическогоЛица(Форма.Сотрудник.ФизическоеЛицо.Ссылка);
	Форма.АдресФотографии = ПолучитьНавигационнуюСсылку(Форма.Сотрудник.ФизическоеЛицо.Ссылка, "Картинка");
	
	// Добавление элементов формы
	Если Форма.Элементы.Найти("АдресФотографии") <> Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	
	Если Форма.Элементы.Найти("ГруппаФотография") = неопределено тогда 
		ГруппаФотография = Элементы.Добавить("ГруппаФотография", Тип("ГруппаФормы"), Элементы.ФИОНомер);
		ГруппаФотография.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаФотография.Отображение 			= ОтображениеОбычнойГруппы.Нет;
		ГруппаФотография.ОтображатьЗаголовок 	= Ложь;
	КонецЕсли;
	
	//ПолеФотографияОтступ = Элементы.Добавить("ФотографияОтступ", Тип("ДекорацияФормы"), ГруппаФотография);
	//ПолеФотографияОтступ.Вид = ВидДекорацииФормы.Надпись;
	//ПолеФотографияОтступ.РастягиватьПоГоризонтали = Истина;
	
	ПолеАдресФотографии = Элементы.Добавить("АдресФотографии", Тип("ПолеФормы"), ГруппаФотография);
	ПолеАдресФотографии.Вид = ВидПоляФормы.ПолеКартинки;
	ПолеАдресФотографии.ПутьКДанным = "АдресФотографии";
	ПолеАдресФотографии.РастягиватьПоВертикали = Ложь;
	ПолеАдресФотографии.РастягиватьПоГоризонтали = Ложь;
	ПолеАдресФотографии.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеАдресФотографии.ТекстНевыбраннойКартинки = НСтр("ru = 'Фотография'");
	ПолеАдресФотографии.РазмерКартинки = РазмерКартинки.АвтоРазмер;
	ПолеАдресФотографии.ЦветТекста = ЦветаСтиля.НедоступныеДанныеЦвет;
	ПолеАдресФотографии.Высота = 4;
	ПолеАдресФотографии.Ширина = 10;
	// СЭ- Немкович
	
#КонецВставки

КонецПроцедуры

#КонецОбласти
