
&НаСервере
&После("ПриСозданииНаСервере")
Процедура СЭ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//СЭ+ Евгений [15477] больше нету модуля СПАРКРИСКИ
	Элементы.ЛокализацияГруппаСпарк.Видимость = Ложь;
	//СЭ- Евгений [15477]
	
	//СЭ+ Евгений [15477] ОКПО виден всегда, и уже типовой настройкой решается будет видная вся группа с ОКПО или нет
	//Элементы.КодПоОКПО.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	Элементы.ДекорацияОКПО.Видимость 	= Истина;
	Элементы.КодПоОКПО.Видимость 		= Истина;
	УстановитьВидимостьРеквизитов();
	//СЭ-Евгений [15477] 
	
	
	
	//+СЭ Пилипчук 0016266
	Если Элементы.Найти("СЭ_ЗагрузкаДолжность") = Неопределено тогда
		ДобавляемыеРеквизиты = Новый Массив;
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("СЭ_ЗагрузкаДолжность", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(250, ДопустимаяДлина.Переменная)),, "Должность для ПФ"));
	    ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		НовыйЭлемент = Элементы.Вставить("СЭ_ЗагрузкаДолжность", Тип("ПолеФормы"), Элементы.ГруппаДополнительно, Элементы.ГруппаПервичныйИнтерес);
		НовыйЭлемент.Заголовок = "Должность для ПФ";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.РастягиватьПоГоризонтали = ложь;
		НовыйЭлемент.ПутьКДанным = "СЭ_ЗагрузкаДолжность";
		НовыйЭлемент.ТолькоПросмотр = Ложь;
		НовыйЭлемент.Доступность = Истина; 
		ЭтаФорма.СЭ_ЗагрузкаДолжность = КонтрагентПартнера.СЭ_ЗагрузкаДолжность;
	КонецЕсли;
	
	Если Элементы.Найти("СЭ_ЗагрузкаДолжностьРодПадеж") = неопределено тогда
		ДобавляемыеРеквизиты = Новый Массив;
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("СЭ_ЗагрузкаДолжностьРодПадеж", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(250, ДопустимаяДлина.Переменная)),, "Должность/ФИО (род. падеж)  для ПФ"));
		ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		
		НовыйЭлемент = Элементы.Вставить("СЭ_ЗагрузкаДолжностьРодПадеж", Тип("ПолеФормы"), Элементы.ГруппаДополнительно, Элементы.ГруппаПервичныйИнтерес);
		НовыйЭлемент.Заголовок = "Должность/ФИО (род. падеж)  для ПФ";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.РастягиватьПоГоризонтали = ложь;
		НовыйЭлемент.ПутьКДанным = "СЭ_ЗагрузкаДолжностьРодПадеж";
		НовыйЭлемент.ТолькоПросмотр = Ложь;
		НовыйЭлемент.Доступность = Истина; 
		
		ЭтаФорма.СЭ_ЗагрузкаДолжностьРодПадеж = КонтрагентПартнера.СЭ_ЗагрузкаДолжностьРодПадеж;
	КонецЕсли; 
	//-СЭ Пилипчук 0016266
	
КонецПроцедуры


&НаСервере
&После("ПриЧтенииНаСервере")
Процедура СЭ_ПриЧтенииНаСервере(ТекущийОбъект)
	//СЭ+ Евгений [15477] ОКПО виден всегда, и уже типовой настройкой решается будет видная вся группа с ОКПО или нет
	УстановитьВидимостьРеквизитов();
	//СЭ- Евгений [15477]
	
	
	//+СЭ Пилипчук 0016266
	Если Элементы.Найти("СЭ_ЗагрузкаДолжность") = Неопределено тогда
		ДобавляемыеРеквизиты = Новый Массив;
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("СЭ_ЗагрузкаДолжность", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(250, ДопустимаяДлина.Переменная)),, "Должность для ПФ"));
	    ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		НовыйЭлемент = Элементы.Вставить("СЭ_ЗагрузкаДолжность", Тип("ПолеФормы"), Элементы.ГруппаДополнительно, Элементы.ГруппаПервичныйИнтерес);
		НовыйЭлемент.Заголовок = "Должность для ПФ";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.РастягиватьПоГоризонтали = ложь;
		НовыйЭлемент.ПутьКДанным = "СЭ_ЗагрузкаДолжность";
		НовыйЭлемент.ТолькоПросмотр = Ложь;
		НовыйЭлемент.Доступность = Истина;
		ЭтаФорма.СЭ_ЗагрузкаДолжность = КонтрагентПартнера.СЭ_ЗагрузкаДолжность;
	КонецЕсли;
	
	Если Элементы.Найти("СЭ_ЗагрузкаДолжностьРодПадеж") = неопределено тогда
		ДобавляемыеРеквизиты = Новый Массив;
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("СЭ_ЗагрузкаДолжностьРодПадеж", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(250, ДопустимаяДлина.Переменная)),, "Должность/ФИО (род. падеж)  для ПФ"));
		ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		
		НовыйЭлемент = Элементы.Вставить("СЭ_ЗагрузкаДолжностьРодПадеж", Тип("ПолеФормы"), Элементы.ГруппаДополнительно, Элементы.ГруппаПервичныйИнтерес);
		НовыйЭлемент.Заголовок = "Должность/ФИО (род. падеж)  для ПФ";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.РастягиватьПоГоризонтали = ложь;
		НовыйЭлемент.ПутьКДанным = "СЭ_ЗагрузкаДолжностьРодПадеж";
		НовыйЭлемент.ТолькоПросмотр = Ложь;
		НовыйЭлемент.Доступность = Истина; 
		ЭтаФорма.СЭ_ЗагрузкаДолжностьРодПадеж = КонтрагентПартнера.СЭ_ЗагрузкаДолжностьРодПадеж;
	КонецЕсли; 
	//-СЭ Пилипчук 0016266
КонецПроцедуры


&НаСервере
&ИзменениеИКонтроль("ЗаписатьКонтрагентаПартнера")
Процедура СЭ_ЗаписатьКонтрагентаПартнера()

	СоздатьКонтрагента = КонтрагентПартнера.Пустая();

	Если СоздатьКонтрагента Тогда
		КонтрагентОбъект = Справочники.Контрагенты.СоздатьЭлемент();
	Иначе
		КонтрагентОбъект = КонтрагентПартнера.ПолучитьОбъект();
	КонецЕсли;

	УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, КонтрагентОбъект);

	КонтрагентОбъект.Наименование = Объект.Наименование;
	Если Объект.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо И Не ПустаяСтрока(Объект.CRM_Имя + Объект.CRM_Фамилия + Объект.CRM_Отчество) Тогда
		КонтрагентОбъект.НаименованиеПолное = СокрЛП(Объект.CRM_Фамилия + " " + Объект.CRM_Имя + " " + Объект.CRM_Отчество);
	Иначе
		КонтрагентОбъект.НаименованиеПолное = Объект.НаименованиеПолное;
	КонецЕсли;
	КонтрагентОбъект.НаименованиеМеждународное = НаименованиеМеждународное;
	КонтрагентОбъект.НаименованиеВТранскрипции = НаименованиеВТранскрипции;
	КонтрагентОбъект.Партнер                   = Объект.Ссылка;
	КонтрагентОбъект.ЮрФизЛицо                 = ЮрФизЛицо;
	КонтрагентОбъект.ОбособленноеПодразделение = ОбособленноеПодразделение;
	КонтрагентОбъект.СтранаРегистрации         = СтранаРегистрации;
	КонтрагентОбъект.РегистрационныйНомер      = РегистрационныйНомер;
	КонтрагентОбъект.НалоговыйНомер            = НалоговыйНомер;
	КонтрагентОбъект.ИНН                       = ИНН;
    #Вставка  
	//+СЭ Пилипчук 0016266
	КонтрагентОбъект.СЭ_ЗагрузкаДолжность = ЭтаФорма.СЭ_ЗагрузкаДолжность;
	КонтрагентОбъект.СЭ_ЗагрузкаДолжностьРодПадеж = ЭтаФорма.СЭ_ЗагрузкаДолжностьРодПадеж; 
	//+СЭ Пилипчук 0016266
	#КонецВставки
	КонтрагентОбъект.ИсторияНаименований.Загрузить(ИсторияНаименований.Выгрузить());

	Если Не ЗначениеЗаполнено(ГоловнойКонтрагент) И Не ОбособленноеПодразделение Тогда

		Если СоздатьКонтрагента Тогда
			НоваяСсылка = Справочники.Контрагенты.ПолучитьСсылку();
			КонтрагентОбъект.УстановитьСсылкуНового(НоваяСсылка);
			ГоловнойКонтрагент = КонтрагентОбъект.ПолучитьСсылкуНового();
		Иначе
			ГоловнойКонтрагент = КонтрагентПартнера;
		КонецЕсли;

	КонецЕсли;
	КонтрагентОбъект.ГоловнойКонтрагент = ГоловнойКонтрагент;
	ПартнерыИКонтрагенты.ЗаполнитьКонтактнуюИнформациюКонтрагентаПартнера(КонтрагентОбъект, ЭтотОбъект, Объект.КонтактнаяИнформация);
	ПартнерыИКонтрагентыЛокализация.ПередЗаписьюКонтрагентаПартнера(КонтрагентОбъект, ЭтотОбъект);

	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПередЗаписьюНаСервереКонтрагент(ЭтотОбъект, КонтрагентОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	КонтрагентОбъект.Записать();

	КонтрагентПартнера = КонтрагентОбъект.Ссылка;

КонецПроцедуры

