
&НаСервере
&ИзменениеИКонтроль("СоздатьПотенциальныйКлиентНаСервере")
Процедура СЭ_СоздатьПотенциальныйКлиентНаСервере()

	ПотенциальныйКлиентОбъект = Справочники.CRM_ПотенциальныеКлиенты.СоздатьЭлемент();
	ПотенциальныйКлиентОбъект.Наименование = ФИО;
	ПотенциальныйКлиентОбъект.Организация = Организация;
	ПотенциальныйКлиентОбъект.Должность = Должность;
	ПотенциальныйКлиентОбъект.БизнесРегион = БизнесРегион;
	ПотенциальныйКлиентОбъект.Отрасль = Отрасль;
	ПотенциальныйКлиентОбъект.Родитель = РодительПК;
	
	#Вставка
	//СЭ+ Евгений [15261]
	Если ЗначениеЗаполнено(ЭтотОбъект.Организация) Тогда
		ПотенциальныйКлиентОбъект.Наименование = ЭтотОбъект.Организация;	
	КонецЕсли;
	Если ЗначениеЗаполнено(ЭтотОбъект.ФИО) Тогда
		ПотенциальныйКлиентОбъект.Фамилия = ЭтотОбъект.ФИО;	
	КонецЕсли;
	//СЭ- Евгений [15261]
	#КонецВставки
	
	Если ЗначениеЗаполнено(Телефон) Тогда
		ВидКИ = Справочники.ВидыКонтактнойИнформации.CRM_ТелефонПотенциальногоКлиента;
		ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон;
		Если Элементы.Телефон1.Маска = "" Тогда
			СтруктураТелефона = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(Телефон);
			Представление = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона(СтруктураТелефона.КодСтраны,
			СтруктураТелефона.КодГорода, СтруктураТелефона.НомерТелефона, СтруктураТелефона.Добавочный,
			"");
		Иначе
			Представление = Телефон;
		КонецЕсли;
		ДанныеКИ = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(Представление,
		ВидКИ, "");
		УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(ПотенциальныйКлиентОбъект, ДанныеКИ, ВидКИ, ТипКИ);
	КонецЕсли;

	Если ЗначениеЗаполнено(Почта) Тогда
		ВидКИ = Справочники.ВидыКонтактнойИнформации.CRM_EmailПотенциальногоКлиента;
		ТипКИ = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		СтруктураПолейКИ = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(ВидКИ);
		ДанныеКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(СтруктураПолейКИ, Почта, ВидКИ);
		УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(ПотенциальныйКлиентОбъект, ДанныеКИ, ВидКИ, ТипКИ);
	КонецЕсли;

	Если ЗначениеЗаполнено(ИДАккаунта) Тогда
		ВидКИ = CRM_РаботаСМессенджерамиСерверПовтИсп.ПолучитьВидКИМессенджера(Обращение.УчетнаяЗапись,
		Справочники.CRM_ПотенциальныеКлиенты.ПустаяСсылка());
		ТипКИ = ВидКИ.Тип;
		Если ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			СтруктураТелефона = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(ИДАккаунта);
			Представление = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона(СтруктураТелефона.КодСтраны,
			СтруктураТелефона.КодГорода, СтруктураТелефона.НомерТелефона, "",
			"");
			ДанныеКИ = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(Представление,
			ВидКИ, "");
		Иначе
			СтруктураПолейКИ = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(ВидКИ);
			ДанныеКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(СтруктураПолейКИ, ИДАккаунта, ВидКИ);
		КонецЕсли;
		УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(ПотенциальныйКлиентОбъект, ДанныеКИ, ВидКИ, ТипКИ);
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		Если ЭтотОбъект["Свойства_ИспользоватьСвойства"] И ЭтотОбъект["Свойства_ИспользоватьДопРеквизиты"] Тогда
			CRM_УправлениеСвойствамиСлужебный.ПеренестиЗначенияИзРеквизитовФормыВОбъект(ЭтотОбъект, ПотенциальныйКлиентОбъект);
		КонецЕсли;
	КонецЕсли;

	ПотенциальныйКлиентОбъект.Записать();
	ПотенциальныйКлиент = ПотенциальныйКлиентОбъект.Ссылка;

КонецПроцедуры
