
&НаКлиенте
&После("ОбработкаОповещения")
Процедура СЭ_ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	//СЭ+ Евгений [16920]
	Если ИмяСобытия = "Запись_РегистрСведенийСостоянияОригиналовПервичныхДокументов" И Источник <> Неопределено Тогда
		СЭ_ЗаписатьДатуВозвратаПриИзмененииСостоянияОригинала(ИмяСобытия, Источник);
	КонецЕсли;
	//СЭ- Евгений [16920]
	
КонецПроцедуры

//СЭ+ Евгений [16920]
&НаСервереБезКонтекста
Процедура СЭ_ЗаписатьДатуВозвратаПриИзмененииСостоянияОригинала(ИмяСобытия, Источник)

	Справочники.ДоговорыКонтрагентов.СЭ_ЗаписатьДатуВозвратаПриИзмененииСостоянияОригинала(ИмяСобытия, Источник);	

КонецПроцедуры
//СЭ- Евгений [16920]