
&НаСервере
&После("ДополнитьФорму")
Процедура СЭ_ДополнитьФорму()
	
	СЭ_РаботаСФормамиСервер.СЭ_СоздатьРеквизитыСерияИНомерПоСерииВкадровыхДокументах(Элементы, "ДатаНомерГруппа", ЭтаФорма.Объект.Ссылка); 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
&ИзменениеИКонтроль("ПараметрыЗаполнения")
Функция СЭ_ПараметрыЗаполнения()

	ПараметрыЗаполнения = Новый Структура;

	ПараметрыЗаполнения.Вставить("Организация");
	ПараметрыЗаполнения.Вставить("Основание");
	ПараметрыЗаполнения.Вставить("Сотрудник");
	ПараметрыЗаполнения.Вставить("ФизическоеЛицо");
	ПараметрыЗаполнения.Вставить("ДатаНачалаСобытия");
	ПараметрыЗаполнения.Вставить("ДатаНачала");
	ПараметрыЗаполнения.Вставить("ДатаОкончания");
	ПараметрыЗаполнения.Вставить("ДнейВПути");
	ПараметрыЗаполнения.Вставить("ОрганизацияНазначения");
	ПараметрыЗаполнения.Вставить("Цель");
	ПараметрыЗаполнения.Вставить("МестоНазначения");
	ПараметрыЗаполнения.Вставить("КомандировкаЗаСчетСредств");
    #Вставка
	ПараметрыЗаполнения.Вставить("СЭ_НомерПоСерии");
	#КонецВставки
	Возврат ПараметрыЗаполнения;

КонецФункции

&НаСервере
&ИзменениеИКонтроль("СоздатьКомандировкиПоМассивуСтрок")
Процедура СЭ_СоздатьКомандировкиПоМассивуСтрок(МассивИдентификаторов)

	УстановитьПривилегированныйРежим(Истина);

	Если МассивИдентификаторов = Неопределено Тогда
		МассивИдентификаторов = Новый Массив;
		Для каждого Строка Из Объект.Сотрудники Цикл
			Если Строка.Командировка.Пустая() Тогда
				МассивИдентификаторов.Добавить(Строка.ПолучитьИдентификатор());  		 	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Если МассивИдентификаторов.ВГраница() >= 0 Тогда
		УстановитьПривилегированныйРежим(Истина);

		Структура = Новый Структура("Месяц");
		ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(Структура);

		ПараметрыЗаполнения = ПараметрыЗаполнения(); 
		ПараметрыЗаполнения.Вставить("ПериодРегистрации", Структура.Месяц);
		ПараметрыЗаполнения.Вставить("Организация", Объект.Организация);
		ПараметрыЗаполнения.Вставить("Основание", Объект.Основание);
		ПараметрыЗаполнения.Вставить("Руководитель", Объект.Руководитель);
		ПараметрыЗаполнения.Вставить("ДолжностьРуководителя", Объект.ДолжностьРуководителя);
		#Вставка
		ПараметрыЗаполнения.Вставить("СЭ_НомерПоСерии", Объект.СЭ_НомерПоСерии);
		#КонецВставки
		ПараметрыЗаполнения.Вставить("ПланируемаяДатаВыплаты",
		РасчетЗарплатыРасширенныйКлиентСервер.ПланируемаяДатаВыплатыЗарплаты(Объект.Организация, Структура.Месяц));

		ВидРасчетаКомандировки  = ВидРасчетаКомандировки();

		Для каждого Идентификатор Из МассивИдентификаторов Цикл
			Строка = Объект.Сотрудники.НайтиПоИдентификатору(Идентификатор);
			Если Строка  = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, Строка, "Сотрудник,ФизическоеЛицо,ДатаНачала,ДатаОкончания,ДнейВПути,МестоНазначения,ОрганизацияНазначения,Цель,КомандировкаЗаСчетСредств");
			ПараметрыЗаполнения.Вставить("ДатаНачалаСобытия", Строка.ДатаНачала);
			Строка.Командировка = РасчетныйДокументПоПараметрыЗаполнения(ПараметрыЗаполнения, ВидРасчетаКомандировки);
			ЭтаФорма.Модифицированность = Истина;
		КонецЦикла;
	КонецЕсли;

	Если ЭтаФорма.Модифицированность Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
	КонецЕсли;

КонецПроцедуры
